nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
/*
     Protocol_808.C
 */

#include <rtthread.h>
#include <rthw.h>
#include "stm32f4xx.h"
#include "usart.h"
#include "board.h"
#include <serial.h>
#include "math.h"
#include  <stdlib.h>
#include  <stdio.h>
#include  <string.h>
#include "App_moduleConfig.h"
#include "math.h"
#include "stdarg.h"
#include "string.h"

#define   SYSID 0x037a

#define    ROUTE_DIS_Default 0x3F000000

#define   BLIND_NUM        10100  
#define   MQ_PKNUM 20

//----   多媒体发送状态 -------
_Media_SD_state Photo_sdState;      //  图片发送状态
_Media_SD_state Sound_sdState;      //声音发送
_Media_SD_state Video_sdState;      //视频发送
_Media_SD_state DrvRecoder_sdState; //行车记录仪发送状态
_Media_SD_state BlindZone_sdState;  //盲区发送

//------ Photo -----
u32 PicFileSize = 0;                // 图片文件大小
u8	PictureName[40];

//------  voice -----
u8	local_trig	= 0;                //  本地定时上报
u32 local_timer = 0;                // 本地定时计数器

//------  video  --------
u8 line_warn_enable = 0;            // 使能路线报警


/*
             杂
 */
//------ phone
u8 CallState = CallState_Idle;      // 通话状态

//   ASCII  to   GB    ---- start
//0-9        10
u8 arr_A3B0[20] = { 0xA3, 0xB0, 0xA3, 0xB1, 0xA3, 0xB2, 0xA3, 0xB3, 0xA3, 0xB4, 0xA3, 0xB5, 0xA3, 0xB6, 0xA3, 0xB7, 0xA3, 0xB8, 0xA3, 0xB9 };

//@ A-O      16
u8 arr_A3C0[32] = { 0xA3, 0xC0, 0xA3, 0xC1, 0xA3, 0xC2, 0xA3, 0xC3, 0xA3, 0xC4, 0xA3, 0xC5, 0xA3, 0xC6, 0xA3, 0xC7, 0xA3, 0xC8, 0xA3, 0xC9, 0xA3, 0xCA, 0xA3, 0xCB, 0xA3, 0xCC0, 0xA3, 0xCD, 0xA3, 0xCE, 0xA3, 0xCF };

//P-Z         11个
u8 arr_A3D0[22] = { 0xA3, 0xD0, 0xA3, 0xD1, 0xA3, 0xD2, 0xA3, 0xD3, 0xA3, 0xD4, 0xA3, 0xD5, 0xA3, 0xD6, 0xA3, 0xD7, 0xA3, 0xD8, 0xA3, 0xD9, 0xA3, 0xDA };

//.  a-0       16
u8 arr_A3E0[32] = { 0xA3, 0xE0, 0xA3, 0xE1, 0xA3, 0xE2, 0xA3, 0xE3, 0xA3, 0xE4, 0xA3, 0xE5, 0xA3, 0xE6, 0xA3, 0xE7, 0xA3, 0xE8, 0xA3, 0xE9, 0xA3, 0xEA, 0xA3, 0xEB, 0xA3, 0xEC, 0xA3, 0xED, 0xA3, 0xEE, 0xA3, 0xEF };

//p-z          11
u8 arr_A3F0[22] = { 0xA3, 0xF0, 0xA3, 0xF1, 0xA3, 0xF2, 0xA3, 0xF3, 0xA3, 0xF4, 0xA3, 0xF5, 0xA3, 0xF6, 0xA3, 0xF7, 0xA3, 0xF8, 0xA3, 0xF9, 0xA3, 0xFA };
//-------  ASCII to GB ------

u8	spd_dex[420];
u8	Latiude_hex[420];

u8  _700H_buffer[700]; 


/*
   //------------------ 定位精度process    --------------------------------------------
   u16 spd_dex[420]={0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
                  0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,8,17,26,35,
                  44,53,62,71,80,89,98,107,116,125,134,143,152,161,170,179,188,197,206,
                  215,224,233,242,252,261,270,279,288,297,306,315,324,333,342,351,360,
                  369,378,387,396,405,414,423,432,441,450,459,468,477,486,495,504,513,
                  522,531,540,549,558,567,576,585,594,603,612,621,630,639,648,657,666,
                  675,684,693,702,711,720,729,738,747,756,765,774,783,792,801,810,819,
                  828,837,846,855,864,873,882,891,900,909,918,927,936,945,954,963,972,
                  981,990,999,1008,1017,1026,1035,1044,1053,1062,1071,1080,1080,1080,1080
                  ,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,
                  1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,
                  1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,
                  1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,
                  1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,
                  1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,
                  1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,
                  1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,1080,
                  1080,1080,1080,1080,1080,1071,1062,1053,1044,1035,1026,1017,1008,999,990,
                  981,972,963,954,945,936,927,918,909,900,891,882,873,864,855,846,837,828,819,
                  810,801,792,783,774,765,756,747,738,729,720,711,702,693,684,675,666,657,648,
                  639,630,621,612,603,594,585,576,567,558,549,540,531,522,513,504,495,486,477,
                  468,459,450,441,432,423,414,405,396,387,378,369,360,351,342,333,324,315,306,
                  297,288,279,270,261,252,243,233,224,215,206,197,188,179,170,161,152,143,134,
                  125,116,107,98,89,80,71,62,53,44,35,26,17,8};
   u32 Latiude_hex[420]={0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,
   0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,
   0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,
   0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x2625A00,0x26259FF,0x26259FC,
   0x26259F6,0x26259EE,0x26259E4,0x26259D8,0x26259C9,0x26259B8,0x26259A5,0x2625990,0x2625978,0x262595E,0x2625942,0x2625924,0x2625903,0x26258E0,0x26258BB,0x2625894,0x262586A,0x262583E,
   0x2625810,0x26257E0,0x26257AD,0x2625778,0x2625741,0x2625707,0x26256CC,0x262568E,0x262564E,0x262560B,0x26255C7,0x2625580,0x2625537,0x26254EB,0x262549D,0x262544E,0x26253FB,0x26253A7,
   0x2625350,0x26252F7,0x262529C,0x262523F,0x26251DF,0x262517D,0x2625119,0x26250B3,0x262504A,0x2624FDF,0x2624F72,0x2624F02,0x2624E91,0x2624E1D,0x2624DA6,0x2624D2E,0x2624CB3,0x2624C36,
   0x2624BB7,0x2624B36,0x2624AB2,0x2624A2C,0x26249A4,0x2624919,0x262488D,0x26247FE,0x262476C,0x26246D9,0x2624643,0x26245AB,0x2624511,0x2624474,0x26243D6,0x2624335,0x2624291,0x26241EC,
   0x2624144,0x262409A,0x2623FEE,0x2623F3F,0x2623E8F,0x2623DDC,0x2623D26,0x2623C6F,0x2623BB5,0x2623AF9,0x2623A3B,0x262397A,0x26238B8,0x26237F3,0x262372B,0x2623662,0x2623596,0x26234C8,
   0x26233F8,0x2623325,0x2623250,0x2623179,0x26230A0,0x2622FC5,0x2622EE7,0x2622E07,0x2622D24,0x2622C40,0x2622B59,0x2622A70,0x2622985,0x2622897,0x26227A7,0x26226B5,0x26225C1,0x26224CA,
   0x26223D2,0x26222D7,0x26221D9,0x26220DA,0x2621FD8,0x2621ED4,0x2621DCD,0x2621CC5,0x2621BBA,0x2621AAD,0x262199F,0x2621891,0x2621782,0x2621674,0x2621566,0x2621458,0x262134A,0x262123B,
   0x262112D,0x262101F,0x2620F11,0x2620E03,0x2620CF5,0x2620BE6,0x2620AD8,0x26209CA,0x26208BC,0x26207AE,0x262069F,0x2620591,0x2620483,0x2620375,0x2620267,0x2620159,0x262004A,0x261FF3C,
   0x261FE2E,0x261FD20,0x261FC12,0x261FB03,0x261F9F5,0x261F8E7,0x261F7D9,0x261F6CB,0x261F5BC,0x261F4AE,0x261F3A0,0x261F292,0x261F184,0x261F076,0x261EF67,0x261EE59,0x261ED4B,0x261EC3D,
   0x261EB2F,0x261EA20,0x261E912,0x261E804,0x261E6F6,0x261E5E8,0x261E4DA,0x261E3CB,0x261E2BD,0x261E1AF,0x261E0A1,0x261DF93,0x261DE84,0x261DD76,0x261DC68,0x261DB5A,0x261DA4C,0x261D93D,
   0x261D82F,0x261D721,0x261D613,0x261D505,0x261D3F7,0x261D2E8,0x261D1DA,0x261D0CC,0x261CFBE,0x261CEB0,0x261CDA1,0x261CC93,0x261CB85,0x261CA77,0x261C969,0x261C85B,0x261C74C,0x261C63E,
   0x261C530,0x261C422,0x261C314,0x261C205,0x261C0F7,0x261BFE9,0x261BEDB,0x261BDCD,0x261BCBE,0x261BBB0,0x261BAA2,0x261B994,0x261B886,0x261B778,0x261B669,0x261B55B,0x261B44D,0x261B33F,
   0x261B231,0x261B122,0x261B014,0x261AF06,0x261ADF8,0x261ACEA,0x261ABDB,0x261AACD,0x261A9BF,0x261A8B1,0x261A7A3,0x261A695,0x261A586,0x261A478,0x261A36A,0x261A25C,0x261A14E,0x261A03F,
   0x2619F31,0x2619E23,0x2619D15,0x2619C07,0x2619AFA,0x26199EF,0x26198E6,0x26197E0,0x26196DC,0x26195DA,0x26194DA,0x26193DD,0x26192E2,0x26191E9,0x26190F3,0x2618FFE,0x2618F0C,0x2618E1C,
   0x2618D2F,0x2618C44,0x2618B5B,0x2618A74,0x261898F,0x26188AD,0x26187CD,0x26186EF,0x2618614,0x261853A,0x2618463,0x261838E,0x26182BC,0x26181EC,0x261811E,0x2618052,0x2617F88,0x2617EC1,
   0x2617DFC,0x2617D39,0x2617C79,0x2617BBA,0x2617AFE,0x2617A45,0x261798D,0x26178D8,0x2617825,0x2617774,0x26176C6,0x2617619,0x261756F,0x26174C8,0x2617422,0x261737F,0x26172DE,0x261723F,
   0x26171A3,0x2617108,0x2617070,0x2616FDB,0x2616F47,0x2616EB6,0x2616E27,0x2616D9A,0x2616D10,0x2616C88,0x2616C02,0x2616B7E,0x2616AFC,0x2616A7D,0x2616A00,0x2616986,0x261690D,0x2616897,
   0x2616823,0x26167B1,0x2616742,0x26166D5,0x261666A,0x2616601,0x261659B,0x2616536,0x26164D4,0x2616475,0x2616417,0x26163BC,0x2616363,0x261630D,0x26162B8,0x2616266,0x2616216,0x26161C8,
   0x261617D,0x2616134,0x26160ED,0x26160A8,0x2616066,0x2616026,0x2615FE8,0x2615FAC,0x2615F73,0x2615F3C,0x2615F07,0x2615ED4,0x2615EA4,0x2615E75,0x2615E4A,0x2615E20,0x2615DF9,0x2615DD3,
   0x2615DB1,0x2615D90,0x2615D72,0x2615D55,0x2615D3C,0x2615D24,0x2615D0F,0x2615CFB,0x2615CEB,0x2615CDC,0x2615CD0,0x2615CC5,0x2615CBE,0x2615CB8,0x2615CB5};




 */

