nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
//----------- 行车记录仪相关  -----------------
Avrg_MintSpeed	Avrgspd_Mint;
u32				PerMinSpdTotal	= 0;    //记录每分钟速度总数
u8				avgspd_Mint_Wr	= 0;    // 填写每分钟平均速度记录下标
u8				avgspd_Sec_Wr	= 0;    // 填写每秒钟平均速度记录下标
u8				avgWriteOver	= 0;    // 写溢出标志位
u8				AspdCounter		= 0;    // 每分钟速度有效报数计数器
u8				Vehicle_sensor	= 0;    // 车辆传感器状态   0.2s  查询一次


/*
   D7  刹车
   D6  左转灯
   D5  右转灯
   D4  远光灯
   D3  近光灯
   D2  雾灯
   D1  车门
   D0  预留
 */
u8			Vehicle_sensor_BAK = 0;     // 车辆传感器状态	0.2s  查询一次

DOUBT_TYPE	Sensor_buf[100];            // 20s 状态记录
u8			save_sensorCounter	= 0, sensor_writeOverFlag = 0;;
u32			total_plus			= 0;

//   -------  CAN BD new  --------------
CAN_TRAN	CAN_trans;

u8			Camera_Number	= 1;
u8			DispContent		= 1;    // 发送时是否显示数据内容


/*
            1 <->  正常显示
            2 <->  显示发送信息的
            3 <->  显示 任务的运行情况
            0<-> 不显示调试输出，只显示协议数据
 */

u8	TextInforCounter = 0;           //文本信息条数

u8	FCS_GPS_UDP = 0;                //UDP 数据异或和
u8	FCS_RX_UDP	= 0;                // UDP 数据接收校验

u8	Centre_IP_modify	= 0;        //  中修改IP了
u8	IP_change_counter	= 0;        //   中心修改IP 计数器
u8	Down_Elec_Flag		= 0;        //   断油断电使能标志位

//------------ 超速报警---------------------
SPD_EXP		speed_Exd;

GPRMC_PRO	GPRMC_Funs =
{
	Time_pro,
	Status_pro,
	Latitude_pro,
	Lat_NS_pro,
	Longitude_pro,
	Long_WE_pro,
	Speed_pro,
	Direction_pro,
	Date_pro
};

//--------  GPS prototcol----------------------------------------------------------------------------------
static u32	fomer_time_seconds, tmp_time_secnonds, delta_time_seconds;
u8			UDP_dataPacket_flag = 0x03;             /*V	   0X03      ;		   A	  0X02*/
u8			GPS_getfirst		= 0, Shoushi = 0;;  //  首次有经纬度
u8			HDOP_value			= 99;               //  Hdop 数值
u8			Satelite_num		= 0;                // 卫星颗数
u8			CurrentTime[3];
u8			BakTime[3];
u8			Sdgps_Time[3];                          // GPS 发送 时间记录   BCD 方式
u8			gps_log[50];                            //gps log

//static u8      UDP_AsciiTx[1800];
ALIGN( RT_ALIGN_SIZE )
u8 GPRS_info[3000];
u16 GPRS_infoWr_Tx = 0;

ALIGN( RT_ALIGN_SIZE )
u8 UDP_HEX_Rx[1024];                                    // EM310 接收内容hex
u16		UDP_hexRx_len		= 0;                        // hex 内容 长度
u16		UDP_DecodeHex_Len	= 0;                        // UDP接收后808 解码后的数据长度

GPS_RMC GPRMC;                                          // GPMC格式
BD_SEND  BDSD;  //    北斗顺序发送


/*                         pGpsRmc->status,\
   pGpsRmc->latitude_value,\
   pGpsRmc->latitude,\
   pGpsRmc->longtitude_value,\
   pGpsRmc->longtitude,\
   pGpsRmc->speed,\
   pGpsRmc->azimuth_angle);
 */

//----------808 协议 -------------------------------------------------------------------------------------
u16			GPS_Hight		= 0;                        //   808协议-> 高程   m
u16			GPS_speed		= 0;                        //   808协议-> 速度   0.1km/h
u16			GPS_direction	= 0;                        //   808协议-> 方向   度
u16			Centre_FloatID	= 0;                        //  中心消息流水号
u16			Centre_CmdID	= 0;                        //  中心命令ID

u8			Original_info[1024];                        // 没有转义处理前的原始信息
u16			Original_info_Wr = 0;                       // 原始信息写地址
//---------- 用GPS校准特征系数相关 ----------------------------
u8			Speed_area			= 60;                   // 校验K值范围
u16			Speed_gps			= 0;                    // 通过GPS计算出来的速度 0.1km/h
u8			Speed_Rec			= 0;                    // 速度传感器 校验K用的存储器
u16			Speed_cacu			= 0;                    // 通过K值计算出来的速度
u16			Spd_adjust_counter	= 0;                    // 确保匀速状态计数器
u16			Former_DeltaPlus[K_adjust_Duration];        // 前几秒的脉冲数
u8			Former_gpsSpd[K_adjust_Duration];           // 前几秒的速度
u8			DF_K_adjustState = 0;                       // 特征系数自动校准状态说明  1:自动校准过    0:尚未自动校准
//-----  车台注册定时器  ----------
DevRegst	DEV_regist;                                 // 注册
DevLOGIN	DEV_Login;                                  //  鉴权

//------- 文本信息下发 -------
TEXT_INFO	TextInfo;                                   // 文本信息下发
//------- 事件 ----
EVENT		EventObj;                                   // 事件
EVENT		EventObj_8[8];                              // 事件
//-------文本信息-------
MSG_TEXT	TEXT_Obj;
MSG_TEXT	TEXT_Obj_8[8], TEXT_Obj_8bak[8];

//------ 提问  --------
CENTRE_ASK		ASK_Centre;                             // 中心提问
//------  信息点播  ---
MSG_BRODCAST	MSG_BroadCast_Obj;                      // 信息点播
MSG_BRODCAST	MSG_Obj_8[8];                           // 信息点播
//------  电话本  -----
PHONE_BOOK		PhoneBook, Rx_PhoneBOOK;                //  电话本
PHONE_BOOK		PhoneBook_8[20];

//-----  车辆控制 ------
VEHICLE_CONTROL Vech_Control;                           //  车辆控制
//-----  电子围栏  -----
POLYGEN_RAIL	Rail_Polygen;                           // 多边形围栏
RECT_RAIL		Rail_Rectangle;                         // 矩形围栏
RECT_RAIL       Rail_Rectangle_multi[8]; // 矩形围栏
CIRCLE_RAIL     Rail_Cycle_multi[8];     // 圆形围栏

CIRCLE_RAIL		Rail_Cycle;                             // 圆形围栏
//------- 线路设置 -----
POINT			POINT_Obj;                              // 路线的拐点
ROUTE			ROUTE_Obj;                              // 路线相关
//-------    行车记录仪  -----
RECODER			Recode_Obj;                             // 行车记录仪
//-------  拍照  ----
CAMERA			Camera_Obj;                             //  中心拍照相关
//-----   录音  ----
VOICE_RECODE	VoiceRec_Obj;                           //  录音功能
//------ 多媒体  --------
MULTIMEDIA		MediaObj;                               // 多媒体信息
//-------  数据信息透传  -------
DATATRANS		DataTrans;                              // 数据信息透传
//-------  进出围栏状态 --------
INOUT			InOut_Object;                           // 进出围栏状态
//-------- 多媒体检索  ------------
MEDIA_INDEX		MediaIndex;                             // 多媒体信息
//------- 车辆负载状态 ---------------
u8				CarLoadState_Flag = 1;                  //选中车辆状态的标志   1:空车   2:半空   3:重车

//------- 多媒体信息类型---------------
u8	Multimedia_Flag = 1;                                //需要上传的多媒体信息类型   1:视频   2:音频   3:图像
u8	SpxBuf[SpxBuf_Size];
u16 Spx_Wr			= 0, Spx_Rd = 0;
u8	Duomeiti_sdFlag = 0;

//------- 录音开始或者结束---------------
u8 Recor_Flag = 1;                                      //  1:录音开始   2:录音结束

//----------808协议 -------------------------------------------------------------------------------------
u8				SIM_code[6];                            // 要发送的IMSI	号码
u8				IMSI_CODE[15]	= "000000000000000";    //SIM 卡的IMSI 号码
u8				Warn_Status[4]	=
{
	0x00, 0x00, 0x00, 0x00
};                                                      //  报警标志位状态信息
