nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
u8				Car_Status[4] =
{
	0x00, 0x00, 0x00, 0x00
};                                                      //  车辆状态信息
T_GPS_Info_GPRS Gps_Gprs, Bak_GPS_gprs;
T_GPS_Info_GPRS Temp_Gps_Gprs;

u8   EverySecond_Time_Get=0;                   // 获取每秒时间标志  0: not get  1: get  day not change  2 : get  day need change
u8   Lati_Get=0;                               // 纬度GGA  处理过
u8   Longi_Get=0;                              //  精度 GGA  接收 过






u8				A_time[6];                              // 定位时刻的时间

u8				ReadPhotoPageTotal	= 0;
u8				SendPHPacketFlag	= 0;                ////收到中心启动接收下一个block时置位

//-------- 紧急报警 --------
u8	warn_flag			= 0;
u8	f_Exigent_warning	= 0;                            //0;     //脚动 紧急报警装置 (INT0 PD0)
u8	Send_warn_times		= 0;                            //   设备向中心上报报警次数，最大3 次
u32 fTimer3s_warncount	= 0;

//------  车门开关拍照 -------
DOORCamera DoorOpen;                                    //  开关车门拍照

//------- 北斗扩展协议  ------------
GNSS_RAW			GNSS_rawdata;                       //  GNSS 详细数据上报
BD_EXTEND			BD_EXT;                             //  北斗扩展协议
DETACH_PKG			Detach_PKG;                         // 分包重传相关
SET_QRY				Setting_Qry;                        //  终端参数查询
PRODUCT_ATTRIBUTE	ProductAttribute;                   // 终端属性
HUMAN_CONFIRM_WARN	HumanConfirmWarn;                   // 人工确认报警

// ---- 拐点 -----
u16 Inflexion_Current		= 0;
u16 Inflexion_Bak			= 0;
u16 Inflexion_chgcnter		= 0;                        //变化计数器
u16 InflexLarge_or_Small	= 0;                        // 判断curent 和 Bak 大小    0 equql  1 large  2 small
u16 InflexDelta_Accumulate	= 0;                        //  差值累计

// ----休眠状态  ------------
u8	SleepState		= 0;                                //   0  不休眠ACC on            1  休眠Acc Off
u8	SleepConfigFlag = 0;                                //  休眠时发送鉴权标志位

//---- 固定文件大小 ---
u32 mp3_fsize		= 5616;
u8	mp3_sendstate	= 0;
u32 wmv_fsize		= 25964;
u8	wmv_sendstate	= 0;

//-------------------   公共 ---------------------------------------
static u8	GPSsaveBuf[40];             // 存储GPS buffer
static u8	ISP_buffer[520];
static u16	GPSsaveBuf_Wr = 0;

POSIT		Posit[60];                  // 每分钟位置信息存储
u8			PosSaveFlag = 0;            // 存储Pos 状态位

NANDSVFlag	NandsaveFlg;
A_AckFlag	Adata_ACKflag;              // 无线GPRS协议 接收相关 RS232 协议返回状态寄存器
TCP_ACKFlag SD_ACKflag;                 // 无线GPRS协议返回状态标志
u32			SubCMD_8103H	= 0;        //  02 H命令 设置记录仪安装参数回复 子命令
u32			SubCMD_FF01H	= 0;        //  FF02 北斗信息扩展
u32			SubCMD_FF03H	= 0;        //  FF03  设置扩展终端参数设置1

u8			SubCMD_10H			= 0;    //  10H   设置记录仪定位告警参数
u8			OutGPS_Flag			= 0;    //  0  默认  1  接外部有源天线
u8			Spd_senor_Null		= 0;    // 手动传感器速度为0
u32			Centre_DoubtRead	= 0;    //  中心读取事故疑点数据的读字段
u32			Centre_DoubtTotal	= 0;    //  中心读取事故疑点的总字段
u8			Vehicle_RunStatus	= 0;    //  bit 0: ACC 开 关             1 开  0关
//  bit 1: 通过速度传感器感知    1 表示行驶  0 表示停止
//  bit 2: 通过gps速度感知       1 表示行驶  0 表示停止
u8	Status_TiredwhRst = 0;              //  当复位时 疲劳驾驶的状态   0 :停车  1:停车但没触发 2:触发了还没结束

u32 SrcFileSize		= 0, DestFilesize = 0, SrcFile_read = 0;
u8	SleepCounter	= 0;

u16 DebugSpd		= 0;                //调试用GPS速度
u8	MMedia2_Flag	= 0;                // 上传固有音频 和实时视频  的标志位    0 传固有 1 传实时

u8	tts_bro_tired_flag = 0;             // 为了认证  ， 只播报一次 疲劳驾驶已经解除

//-----  ISP    远程下载相关 -------
ISP_BD BD_ISP;                          //  BD   升级包

//------ IC 卡模块 ---
IC_MODULE			IC_MOD;             //IC 模块

unsigned short int	FileTCB_CRC16	= 0;
unsigned short int	Last_crc		= 0, crc_fcs = 0;

//---------  中心应答  -----------
u8				Send_Rdy4ok = 0;
unsigned char	Rstart_time = 0;

MQU				MangQU;
MQU             MQ_TrueUse; // 真正的盲区补报模式     

//---------- SMS SD ------------------
SMS_SD SMS_send;

//---------------  速度脉冲相关--------------
u16			Delta_1s_Plus	= 0;
u16			Delta_1s_Plus2	= 0;
u16			Sec_counter		= 0;

LENGTH_BUF	Rx_reg;
LENGTH_BUF	app_rx;
u32			Appringbuf_wr	= 0;            // 循环存储buffer
u32			AppRingbuf_rd	= 0;


//---------74CH595  Q5   control Power----
u8   Print_power_Q5_enable=0;   
u8   Buzzer_on_Q7_enable=0; 

u32     MQsend_counter=0;
//++++++++++++++++++++++++++++++++++++++++++++++++++++行车记录仪+++++
u8 t_hour=0,t_min=0,t_second=0;

void K_AdjustUseGPS( u32 sp, u32 sp_DISP ); // 通过GPS 校准  K 值  (车辆行驶1KM 的脉冲数目)


u16 Protocol_808_Encode( u8 *Dest, u8 *Src, u16 srclen );


void Protocol_808_Decode( void );           // 解析指定buffer :  UDP_HEX_Rx


void Photo_send_end( void );


void Sound_send_end( void );


void Video_send_end( void );
void mq_true_enable(u8 value);



unsigned short int CRC16_file( unsigned short int num );


void Spd_ExpInit( void );


void AvrgSpd_MintProcess( u8 hour, u8 min, u8 sec );


u32 Distance_Point2Line( u32 Cur_Lat, u32 Cur_Longi, u32 P1_Lat, u32 P1_Longi, u32 P2_Lat, u32 P2_Longi );


void RouteRail_Judge( u8* LatiStr, u8* LongiStr );


void app_queenable( u8* instr );
u32 Get_MQ_true_CuurentTotal_packets(void);



//  A.  Total

void  Mangqu_Init( void )
{
	MangQU.PacketNum	= 0;
	MangQU.Sd_timer		= 0;
	MangQU.Sd_flag		= 0;
	//---  5-3
	MangQU.Enable_SD_state = 0;

    //  another  struct  init	
	MQ_TrueUse.PacketNum	= 0;
	MQ_TrueUse.Sd_timer		= 0;
	MQ_TrueUse.Sd_flag		= 0;
	//---  5-3
	MQ_TrueUse.Enable_SD_state = 0; 
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void delay_us( u16 j )
{
	u8 i;
	while( j-- )
	{
		i = 3;
		while( i-- )
		{
			;
		}
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void delay_ms( u16 j )
{
	while( j-- )
	{
		DF_delay_us( 2000 ); // 1000
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void App_que_process( void )
{
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u8  Do_SendGPSReport_GPRS( void )
{
	unsigned short int	crc_file	= 0;
	u16					count		= 0, str_len = 0;
	u8					i			= 0;
	u8					reg_gps[30], reg_wr = 0;
	u8					packet_type = 0;

     //  顺序上报BD 信息
        if(BDSD.Enable_Working==1)
            {
		         if( BDSD.SendFlag==RdCycle_RdytoSD)
		         {
                   Stuff_BDSD_0200H();
                   BDSD.SendFlag=RdCycle_SdOver;
				   return true;
		         }
        	}
	// 1.  GNSS 详细数据上传----------------------------------------------------
	//          真正补报
    if( MQ_TrueUse.Enable_SD_state == 1 )
	{
		if( ( MQ_TrueUse.Sd_flag == 1 ) && ( DEV_Login.Operate_enable == 2 ) )
		{
		                
		               
		                Stuff_MangQu_Packet_Send_0704H_True();  
						MQ_TrueUse.Sd_flag=2;  //2;  
		    return true;            
		}		
	}
	//--------------------------------------------------------------------------------
	if( MangQU.Enable_SD_state == 1 )
	{
		if( ( MangQU.Sd_flag == 1 ) && ( DEV_Login.Operate_enable == 2 ) )
		{
		                Stuff_MangQu_Packet_Send_0704H();  
						//MangQU.Sd_flag=0;
		                MangQU.Sd_flag=2;  //2;  
		              /*  MangQU.PacketNum++;
					    if(MangQU.PacketNum>=(BLIND_NUM/MQ_PKNUM))
									  	    	{
									  	    	   MangQU.PacketNum=0;
												   MangQU.Enable_SD_state=0; 
												   rt_kprintf("\r\nReturn Normal all\r\n");  
									  	    	}
									  	    	*/
				return true;					  	    	
		}		
	}
	if( ( 1 == GNSS_rawdata.WorkEnable ) && ( GNSS_rawdata.save_status ) )
	{
		if( GNSS_rawdata.save_status & ( 1 << GNSS_rawdata.rd_num ) )   // 检查当前rd   数值状态
		{
			str_len = strlen( GNSS_rawdata.Raw[GNSS_rawdata.rd_num] );
			/*
			rt_kprintf("\r\n ----------Rx info--------------\r\n");
			 for(count=0;count<str_len;count++)
			   rt_kprintf("%c",GNSS_rawdata.Raw[GNSS_rawdata.rd_num][count]); 
			 rt_kprintf("\r\n ----------Rx info end--------------\r\n");
			Stuff_GNSSRawData_0900H( GNSS_rawdata.Raw[GNSS_rawdata.rd_num], str_len );
			//---------------------------
			*/
			GNSS_rawdata.rd_num++;
			if( GNSS_rawdata.rd_num > 3 )
			{
				GNSS_rawdata.rd_num = 0;
			}
			GNSS_rawdata.save_status &= ~( 1 << GNSS_rawdata.rd_num ); //clear
		}
		return true;
	}
	//2.  鉴权--------------------------------------------------------------------
	if( DEV_Login.Operate_enable != 2 )
	{
		if( 1 == DEV_Login.Enable_sd )
		{
			Stuff_DevLogin_0102H( ); //  鉴权   ==2 时鉴权完毕
			DEV_Login.Enable_sd = 0;
			//------ 发送鉴权不判断 ------------------
			//DEV_Login.Operate_enable=2;  //  不用判断鉴权了
			return true;
		}
	}
	// 3. 多媒体数据上传
	if( MediaObj.Media_transmittingFlag == 2 )
	{
		if( 1 == MediaObj.SD_Data_Flag )
		{
			Stuff_MultiMedia_Data_0801H( );
			MediaObj.SD_Data_Flag = 0;
			return true;
		}
		return true;                        // 按照808 协议要求 ，传输多媒体过程中不允许发送别的信息包
	}
	//  4.   终端注册
	if( 1 == DEV_regist.Enable_sd )
	{
		Stuff_RegisterPacket_0100H( 0 );    // 注册
		JT808Conf_struct.Msg_Float_ID = 0;
		Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
		DEV_regist.Enable_sd = 0;
		//  JT808Conf_struct.Regsiter_Status=1; //标注注册，但不存储
		return true;
	}
	// 5.  终端注销
	if( 1 == DEV_regist.DeRegst_sd )
	{
		Stuff_DeviceDeregister_0101H( );
		DEV_regist.DeRegst_sd = 0;
		return true;
	}
#if   0
	//  6.  终端心跳包
	if( ( 1 == JT808Conf_struct.DURATION.Heart_SDFlag ) && ( DataLink_Status( ) ) && ( SleepState == 0 ) && ( stopNormal == 0 ) )   //  心跳
	{
		Stuff_DeviceHeartPacket_0002H( );
		JT808Conf_struct.DURATION.Heart_SDFlag	= 0;
		JT808Conf_struct.DURATION.TCP_SD_state	= 1;                                                                                //发送完后置 1
		return true;
	}
	// 7.  休眠时终端心跳包
	if( ( 1 == SleepConfigFlag ) && ( DataLink_Status( ) ) && ( SleepState == 1 ) )                                                 //  休眠时心跳
	{
		Stuff_DevLogin_0102H( );                                                                                                    //  鉴权   ==2 时鉴权完毕
		rt_kprintf( "\r\n	 休眠时用鉴权做心跳包 ! \r\n");
		SleepConfigFlag = 0;
		return true;
	}
#endif
	//  8.   定位数据批量上传
	if( 1 == SD_ACKflag.f_BD_BatchTrans_0704H )                                                                                     //  定位数据批量上传
	{
		Stuff_BatchDataTrans_BD_0704H( );
		SD_ACKflag.f_BD_BatchTrans_0704H = 0;
		return true;
	}
	// 9.  中心拍照命令应答
	if( 1 == SD_ACKflag.f_BD_CentreTakeAck_0805H )                                                                                  // 中心拍照命令应答
	{
		Stuff_CentreTakeACK_BD_0805H( );
		SD_ACKflag.f_BD_CentreTakeAck_0805H = 0;
		return true;
	}
	//   10.  终端属性上传
	if( 1 == SD_ACKflag.f_BD_DeviceAttribute_8107 )                                                                                 //  终端属性上传
	{
		Stuff_DeviceAttribute_BD_0107H( );
		SD_ACKflag.f_BD_DeviceAttribute_8107 = 0;
		return true;
	}
	//   11.  位置信息查询
	if( 1 == SD_ACKflag.f_CurrentPosition_0201H )                                                                                   // 位置信息查询
	{
		Stuff_Current_Data_0201H( );
		SD_ACKflag.f_CurrentPosition_0201H = 0;
		return true;
	}
	//   12.   事件报告
	if( 1 == SD_ACKflag.f_CurrentEventACK_0301H )                                                                                   //  事件报告
	{
		Stuff_EventACK_0301H( );
		SD_ACKflag.f_CurrentEventACK_0301H = 0;
		return true;
	}
	//  13. 提问应答
	if( 2 == ASK_Centre.ASK_SdFlag )                                                                                                //  提问应答
	{
		Stuff_ASKACK_0302H( );
		ASK_Centre.ASK_SdFlag = 0;
		return true;
	}
	// 14. 车辆应答控制
	if( 1 == Vech_Control.ACK_SD_Flag )                                                                                             //  车辆应答控制
	{
		Stuff_ControlACK_0500H( );
		Vech_Control.ACK_SD_Flag = 0;
		return true;
	}
	//  15.  行车记录仪数据上传
	if( ( 1 == Recode_Obj.SD_Data_Flag ) && ( 1 == Recode_Obj.CountStep )&&((0==Recode_Obj.RSD_State)||(3==Recode_Obj.RSD_State)) ) 
	{
		//  1. clear   one  packet  flag
		switch( Recode_Obj.CMD ) 
		{
			/*                divide  not  stop
			   case 0x08:
			   case 0x09:
			   case 0x10:
			   case 0x11:
			   case 0x12:
			   case 0x15:
			 */
			case 0x07:
			case 0x13:
			case 0x14:
				Recode_Obj.SD_Data_Flag = 0;
				Recode_Obj.CountStep	= 0;
				break;
		}
		//  2.  stuff   recorder   infomation
		//  judge  packet  type
		if( Recode_Obj.Devide_Flag == 1 )
		{
			packet_type = Packet_Divide;
		} else
		{
			packet_type = Packet_Normal;
		}

        
		rt_kprintf( "\r\n 记录仪 CMD_ID =0x%2X \r\n", Recode_Obj.CMD );
		if( packet_type == Packet_Divide )
		{
		  if((Recode_Obj.RSD_State==0)||(Recode_Obj.RSD_State==3))  // 在非列表重传情况下进行 bak  
		   {
		       Recode_Obj.Bak_current_num=Recode_Obj.Current_pkt_num;
               Recode_Obj.Bak_fcs= Recode_Obj.fcs;   
			   Recode_Obj.Bak_CMD=Recode_Obj.CMD;
		   }
		  
			rt_kprintf( "\r\n              current =%d  Total: %d \r\n", Recode_Obj.Current_pkt_num, Recode_Obj.Total_pkt_num );
		}
		Stuff_RecoderACK_0700H( packet_type ); //   行车记录仪数据上传
		//  3. step  by  step  send   from  00H  ---  07H
		switch( Recode_Obj.CMD )
		{
			case 0x00:   Recode_Obj.SD_Data_Flag	= 1;
				Recode_Obj.CMD						= 0x01;
				break;
			case 0x01:   Recode_Obj.SD_Data_Flag	= 1;
				Recode_Obj.CMD						= 0x02;
				break;
			case 0x02:   Recode_Obj.SD_Data_Flag	= 1;
				Recode_Obj.CMD						= 0x03;
				break;
			case 0x03:   Recode_Obj.SD_Data_Flag	= 1;
				Recode_Obj.CMD						= 0x04;
				break;
			case 0x04:    Recode_Obj.SD_Data_Flag	= 1;
				Recode_Obj.CMD						= 0x05;
				break;
			case 0x05:   Recode_Obj.SD_Data_Flag	= 1;
				Recode_Obj.CMD						= 0x06;
				break;
			//-----------------------------------------
			case 0x06:   Recode_Obj.SD_Data_Flag	= 1;
				Recode_Obj.CMD						= 0x07;
				break;
				//-----------------------------------------
		}

		if( Recode_Obj.CountStep == 1 )
		{
			Recode_Obj.CountStep = 2; Recode_Obj.timer = 0;
		}

