nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
		return true;
	}
	//-------------------------------------------------------------
	return false;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void strtrim( u8 *s, u8 c )
{
	u8	*p1, *p2;
	u16 i, j;

	if( s == 0 )
	{
		return;
	}

	// delete the trailing characters
	if( *s == 0 )
	{
		return;
	}
	j	= strlen( (char const*)s );
	p1	= s + j;
	for( i = 0; i < j; i++ )
	{
		p1--;
		if( *p1 != c )
		{
			break;
		}
	}
	if( i < j )
	{
		p1++;
	}
	*p1 = 0; // null terminate the undesired trailing characters

	// delete the leading characters
	p1 = s;
	if( *p1 == 0 )
	{
		return;
	}
	for( i = 0; *p1++ == c; i++ )
	{
		;
	}
	if( i > 0 )
	{
		p2 = s;
		p1--;
		for(; *p1 != 0; )
		{
			*p2++ = *p1++;
		}
		*p2 = 0;
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
int str2ip( char *buf, u8 *ip )
{   // convert an ip:port string into a binary values
	int i;
	u16 _ip[4];

	memset( _ip, 0, sizeof( _ip ) );

	strtrim( (u8*)buf, ' ' );

	i = sscanf( buf, "%u.%u.%u.%u", (u32*)&_ip[0], (u32*)&_ip[1], (u32*)&_ip[2], (u32*)&_ip[3] );

	*(u8*)( ip + 0 )	= (u8)_ip[0];
	*(u8*)( ip + 1 )	= (u8)_ip[1];
	*(u8*)( ip + 2 )	= (u8)_ip[2];
	*(u8*)( ip + 3 )	= (u8)_ip[3];

	return i;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
int IP_Str( char *buf, u32 IP )
{
	T_IP_Addr ip;

	if( !buf )
	{
		return 0;
	}

	ip.ip32 = IP;

	return sprintf( buf, "%u.%u.%u.%u", ip.ip8[0], ip.ip8[1], ip.ip8[2], ip.ip8[3] );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u16 AsciiToGb( u8 *dec, u8 InstrLen, u8 *scr )
{
	u16 i			= 0, j = 0, m = 0;
	u16 Info_len	= 0;

	for( i = 0, j = 0; i < InstrLen; i++, j++ )
	{
		m = scr[i];
		if( ( m >= 0x30 ) && ( m <= 0x39 ) )
		{
			memcpy( &dec[j], &arr_A3B0[( m - '0' ) * 2], 2 );
			j++;
		}else if( ( m >= 0x41 ) && ( m <= 0x4f ) )
		{
			memcpy( &dec[j], &arr_A3C0[( m - 0x41 + 1 ) * 2], 2 );
			j++;
		}else if( ( m >= 0x50 ) && ( m <= 0x5a ) )
		{
			memcpy( &dec[j], &arr_A3D0[( m - 0x50 ) * 2], 2 );
			j++;
		}else if( ( m >= 0x61 ) && ( m <= 0x6f ) )
		{
			memcpy( &dec[j], &arr_A3E0[( m - 0x61 + 1 ) * 2], 2 );
			j++;
		}else if( ( m >= 0x70 ) && ( m <= 0x7a ) )
		{
			memcpy( &dec[j], &arr_A3F0[( m - 0x70 ) * 2], 2 );
			j++;
		}else
		{
			dec[j] = m;
		}
	}
	Info_len = j;
	return Info_len;
}

// B.   Protocol

//==================================================================================================
// 第一部分 :   以下是GPS 解析转换相关函数
//==================================================================================================

void Time_pro( u8 *tmpinfo, u8 hour, u8 min, u8 sec )
{
	//---- record  to memory
	GPRMC.utc_hour	= hour;
	GPRMC.utc_min	= min;
	GPRMC.utc_sec	= sec;

	CurrentTime[0]	= hour;
	CurrentTime[1]	= min;
	CurrentTime[2]	= sec;

	//-----------  天地通协议 -------------
	Temp_Gps_Gprs.Time[0]	= hour;
	Temp_Gps_Gprs.Time[1]	= ( tmpinfo[2] - 0x30 ) * 10 + tmpinfo[3] - 0x30;
	Temp_Gps_Gprs.Time[2]	= ( tmpinfo[4] - 0x30 ) * 10 + tmpinfo[5] - 0x30;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void Status_pro( u8 *tmpinfo )
{
	GPRMC.status = tmpinfo[0];

	//-------------------------天地通协议-----------------------------
	if( tmpinfo[0] == 'V' || tmpinfo[0] == 'v' )
	{
		UDP_dataPacket_flag = 0X03;
		StatusReg_GPS_V( );
	}else if( tmpinfo[0] == 'A' || tmpinfo[0] == 'a' )
	{
		UDP_dataPacket_flag = 0X02;
		StatusReg_GPS_A( );
	}

	//---------------------------------------------------------
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void Latitude_pro( u8 *tmpinfo )
{
	u32 latitude;
	GPRMC.latitude_value = atof( (char*)tmpinfo );


	/*     Latitude
	       ddmm.mmmm
	 */

	//--------	808 协议 --------------------
	if( UDP_dataPacket_flag == 0X02 ) //精确到百万分之一度
	{
		//------------  dd part   --------
		latitude = ( u32 )( ( tmpinfo[0] - 0x30 ) * 10 + ( u32 )( tmpinfo[1] - 0x30 ) ) * 1000000;
		//------------  mm  part  -----------


		/*    转换成百万分之一度
		      mm.mmmm   *  1000000/60=mm.mmmm*50000/3=mm.mmmm*10000*5/3
		 */
		latitude = latitude + ( u32 )( ( ( tmpinfo[2] - 0x30 ) * 100000 + ( tmpinfo[3] - 0x30 ) * 10000 + ( tmpinfo[5] - 0x30 ) * 1000 + ( tmpinfo[6] - 0x30 ) * 100 + ( tmpinfo[7] - 0x30 ) * 10 + ( tmpinfo[8] - 0x30 ) ) * 5 / 3 );

		if( latitude == 0 )
		{
			GPS_getfirst = 0;
			StatusReg_GPS_V( );
			return;
		}

		Temp_Gps_Gprs.Latitude[0]	= ( u8 )( latitude >> 24 );
		Temp_Gps_Gprs.Latitude[1]	= ( u8 )( latitude >> 16 );
		Temp_Gps_Gprs.Latitude[2]	= ( u8 )( latitude >> 8 );
		Temp_Gps_Gprs.Latitude[3]	= ( u8 )latitude;
	}
	//----------------------------------------------
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void Lat_NS_pro( u8 *tmpinfo )
{
	GPRMC.latitude = tmpinfo[0];
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void Longitude_pro( u8 *tmpinfo )
{
	u32 longtitude;
	GPRMC.longtitude_value = atof( (char*)tmpinfo );


	/*     Latitude
	        dddmm.mmmm
	 */
	//--------  808协议  ---------
	if( UDP_dataPacket_flag == 0X02 ) //精确到百万分之一度
	{
		//------  ddd part -------------------
		longtitude = ( u32 )( ( tmpinfo[0] - 0x30 ) * 100 + ( tmpinfo[1] - 0x30 ) * 10 + ( tmpinfo[2] - 0x30 ) ) * 1000000;
		//------  mm.mmmm --------------------


		/*    转换成百万分之一度
		   mm.mmmm	 *	1000000/60=mm.mmmm*50000/3=mm.mmmm*10000*5/3
		 */
		longtitude = longtitude + ( u32 )( ( ( tmpinfo[3] - 0x30 ) * 100000 + ( tmpinfo[4] - 0x30 ) * 10000 + ( tmpinfo[6] - 0x30 ) * 1000 + ( tmpinfo[7] - 0x30 ) * 100 + ( tmpinfo[8] - 0x30 ) * 10 + ( tmpinfo[9] - 0x30 ) ) * 5 / 3 );
		if( longtitude == 0 )
		{
			GPS_getfirst = 0; StatusReg_GPS_V( ); return;
		}

