nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
		//---jiade --guojingdu yong ---
		if( app_que_enable == 1 )
		{
			longtitude = 116 * 1000000 - ( CSQ_counter % 8 ) + ( TIM1_Timer_Counter % 3 );
		}

		Temp_Gps_Gprs.Longitude[0]	= ( u8 )( longtitude >> 24 );
		Temp_Gps_Gprs.Longitude[1]	= ( u8 )( longtitude >> 16 );
		Temp_Gps_Gprs.Longitude[2]	= ( u8 )( longtitude >> 8 );
		Temp_Gps_Gprs.Longitude[3]	= ( u8 )longtitude;
	}

	//---------------------------------------------------
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void Long_WE_pro( u8 *tmpinfo )
{
	GPRMC.longtitude = tmpinfo[0];
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void Speed_pro( u8 *tmpinfo, u8 Invalue, u8 Point )
{
	u32 sp	= 0, sp_DISP = 0;
	u32 reg = 0;

	//-------------------------------------------------------------------------------------------------------------
	if( Invalue == INIT )
	{
		return;
	}else //---------------------------------------------------------------------------------------------------------
	{
		GPRMC.speed = atof( (char*)tmpinfo );
		//---------------------------------------------------
		if( UDP_dataPacket_flag == 0x02 )
		{
			//-----808 协议 --------------
			//两个字节单位0.1 km/h
			if( Point == 1 )                                                    //0.0-9.9=>
			{
				//++++++++  Nathan Modify on 2008-12-1   ++++++++++
				if( ( tmpinfo[0] >= 0x30 ) && ( tmpinfo[0] <= 0x39 ) && ( tmpinfo[2] >= 0x30 ) && ( tmpinfo[2] <= 0x39 ) )
				{
					sp = ( tmpinfo[0] - 0x30 ) * 10 + ( tmpinfo[2] - 0x30 );    //扩大10倍
				}else
				{
					return;
				}
			}else if( Point == 2 )                                              //10.0-99.9
			{
				//++++++++  Nathan Modify on 2008-12-1   ++++++++++
				if( ( tmpinfo[0] >= 0x30 ) && ( tmpinfo[0] <= 0x39 ) && ( tmpinfo[1] >= 0x30 ) && ( tmpinfo[1] <= 0x39 ) && ( tmpinfo[3] >= 0x30 ) && ( tmpinfo[3] <= 0x39 ) )
				{
					sp = ( tmpinfo[0] - 0x30 ) * 100 + ( tmpinfo[1] - 0x30 ) * 10 + tmpinfo[3] - 0x30;
				}else
				{
					return;
				}
			}else if( Point == 3 ) //100.0-999.9
			{
				//++++++++  Nathan Modify on 2008-12-1	++++++++++
				if( ( tmpinfo[0] >= 0x30 ) && ( tmpinfo[0] <= 0x39 ) && ( tmpinfo[1] >= 0x30 ) && ( tmpinfo[1] <= 0x39 ) && ( tmpinfo[2] >= 0x30 ) && ( tmpinfo[2] <= 0x39 ) && ( tmpinfo[4] >= 0x30 ) && ( tmpinfo[4] <= 0x39 ) )
				{
					sp = ( tmpinfo[0] - 0x30 ) * 1000 + ( tmpinfo[1] - 0x30 ) * 100 + ( tmpinfo[2] - 0x30 ) * 10 + tmpinfo[4] - 0x30;
				}else
				{
					return;
				}
			}else
			{
				if( JT808Conf_struct.Speed_GetType == 0 )
				{
					GPS_speed = 0;
				} else
				{
					GPS_speed = Speed_cacu;
				}
			}

			// --------  sp 当前是0.1 knot------------------
			sp = (u32)( sp * 185.6 );                                   //  1 海里=1.856 千米  现在是m/h

			if( sp > 220000 )                                           //时速大于220km/h则剔除
			{
				return;
			}

			sp_DISP = sp / 100;                                         //  sp_Disp 单位是 0.1km/h

			//------------------------------ 通过GPS模块数据获取到的速度 --------------------------------
			Speed_gps = (u16)sp_DISP;
			//---------------------------------------------------------------------------
			if( JT808Conf_struct.Speed_GetType )                        // 通过速度传感器 获取速度
			{
				GPS_speed = Speed_cacu;
#if 0                                                                   //  北斗认证先不用自动校准
				K_AdjustUseGPS( sp, sp_DISP );                          //  调整K值
				if( JT808Conf_struct.DF_K_adjustState == 0 )
				{
					// ---  在未校准前，获得到的速度是通过GPS计算得到的
					GPS_speed = Speed_gps;
					//------- GPS	里程计算--------
					if( sp >= 5000 )                                    //	过滤零点漂移  速度大于
					{
						reg								= sp / 3600;    // 除以3600 是m/s
						JT808Conf_struct.Distance_m_u32 += reg;
						if( JT808Conf_struct.Distance_m_u32 > 0xFFFFFF )
						{
							JT808Conf_struct.Distance_m_u32 = 0;        //里程最长这么多米
						}
						//----- 定距回传处理---
						if( 1 == JT808Conf_struct.SD_MODE.DIST_TOTALMODE )
						{
							DistanceAccumulate += reg;
							if( DistanceAccumulate >= Current_SD_Distance )
							{
								DistanceAccumulate = 0;
								PositionSD_Enable( ); //发送
								Current_UDP_sd = 1;
							}
						}
						//------- 定距处理结束 -----
					}
				}
#endif
			}else
			{                                                       // 从GPS 取速度
				//------- GPS	里程计算--------
				if( sp >= 5000 )                                    //	过滤零点漂移  速度大于
				{
					JT808Conf_struct.Distance_m_u32 += sp / 3600;   // 除以3600 是m/s
					if( JT808Conf_struct.Distance_m_u32 > 0xFFFFFF )
					{
						JT808Conf_struct.Distance_m_u32 = 0;        //里程最长这么多米
					}
					//----- 定距回传处理---
					if( 1 == JT808Conf_struct.SD_MODE.DIST_TOTALMODE )
					{
						DistanceAccumulate += reg;
						if( DistanceAccumulate >= Current_SD_Distance )
						{
							DistanceAccumulate = 0;
							PositionSD_Enable( );   //发送
							Current_UDP_sd = 1;
						}
					}
					//------- 定距处理结束 -----
				}

				GPS_speed = Speed_gps;              // 用GPS数据计算得的速度 单位0.1km/h

				//-----------------------------------------------
			}
			// if(DispContent==2)
			//  rt_kprintf("\r\n				  速度: %d Km/h\r\n",GPS_speed/10);
		}
		else if( UDP_dataPacket_flag == 0x03 )
		{
			if( 0 == JT808Conf_struct.Speed_GetType )
			{
				//----- GPS 临时速度	km/h  ---------
				GPS_speed = 0;
			}
			if( JT808Conf_struct.Speed_GetType ) // 通过速度传感器 获取速度
			{
				//  K_AdjustUseGPS(sp,sp_DISP);  //  调整K值
				GPS_speed = Speed_cacu;
			}
			Speed_gps = 0;
		//	if( DispContent == 2 )
			//{
			//	rt_kprintf( "\r\n 2 GPS没定位\r\n" );
			//}
		}
	}
	//---------------------------------------------------
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void Direction_pro( u8 *tmpinfo, u8 Invalue, u8 Point )
{
	u32 sp = 0;
	//------------------------------------------------------------------------------------------------
	if( Invalue == INIT )
	{
		return;
	}else //-------------------------------------------------------------------------------------------
	{
		GPRMC.azimuth_angle = atof( (char*)tmpinfo );

		//--------------808 协议  1 度-------------------------
		if( UDP_dataPacket_flag == 0x02 )
		{
			if( Point == 1 ) //5.8
			{
				if( ( tmpinfo[0] >= 0x30 ) && ( tmpinfo[0] <= 0x39 ) && ( tmpinfo[2] >= 0x30 ) && ( tmpinfo[2] <= 0x39 ) )
				{
					sp = ( tmpinfo[0] - 0x30 );
				} else
				{
					return;
				}
			}else if( Point == 2 ) // 14.7
			{
				if( ( tmpinfo[0] >= 0x30 ) && ( tmpinfo[0] <= 0x39 ) && ( tmpinfo[1] >= 0x30 ) && ( tmpinfo[1] <= 0x39 ) && ( tmpinfo[3] >= 0x30 ) && ( tmpinfo[3] <= 0x39 ) )
				{
					sp = ( tmpinfo[0] - 0x30 ) * 10 + ( tmpinfo[1] - 0x30 );
				} else
				{
					return;
				}
			}else //357.38
			if( Point == 3 )
			{
				if( ( tmpinfo[0] >= 0x30 ) && ( tmpinfo[0] <= 0x39 ) && ( tmpinfo[1] >= 0x30 ) && ( tmpinfo[1] <= 0x39 ) && ( tmpinfo[2] >= 0x30 ) && ( tmpinfo[2] <= 0x39 ) && ( tmpinfo[4] >= 0x30 ) && ( tmpinfo[4] <= 0x39 ) )
				{
					sp = ( tmpinfo[0] - 0x30 ) * 100 + ( tmpinfo[1] - 0x30 ) * 10 + ( tmpinfo[2] - 0x30 );
				} else
				{
					return;
				}
			}else
			{
				sp = 0;
			}
			GPS_direction = sp; //  单位 1度

			//----------  拐点补传相关   ----------
			// Inflexion_Process();
		}else if( UDP_dataPacket_flag == 0x03 )
		{
			GPS_direction = 0;
		}

		return;
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void Date_pro( u8 *tmpinfo, u8 fDateModify, u8 hour, u8 min, u8 sec )
{
	uint8_t		year = 0, mon = 0, day = 0;
	TDateTime	now;

