nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
	day		= ( ( tmpinfo[0] - 0x30 ) * 10 ) + ( tmpinfo[1] - 0x30 );
	mon		= ( ( tmpinfo[2] - 0x30 ) * 10 ) + ( tmpinfo[3] - 0x30 );
	year	= ( ( tmpinfo[4] - 0x30 ) * 10 ) + ( tmpinfo[5] - 0x30 );

	if( fDateModify )
	{
		//sscanf(tmpinfo,"%2d%2d%2d",&day,&mon,&year);
		day++;
		if( mon == 2 )
		{
			if( ( year % 4 ) == 0 )
			{
				if( day == 30 )
				{
					day = 1; mon++;
				}
			}else if( day == 29 )
			{
				day = 1; mon++;
			}
		}else if( ( mon == 4 ) || ( mon == 6 ) || ( mon == 9 ) || ( mon == 11 ) )
		{
			if( day == 31 )
			{
				mon++; day = 1;
			}
		}else
		{
			if( day == 32 )
			{
				mon++; day = 1;
			}
			if( mon == 13 )
			{
				mon = 1; year++;
			}
		}
	}
	GPRMC.utc_year	= year;
	GPRMC.utc_mon	= mon;
	GPRMC.utc_day	= day;
	if( ( ( sec == 0 ) && ( GPRMC.status == 'A' ) ) || ( Shoushi == 1 ) )
	{
		now.year	= year;
		now.month	= mon;
		now.day		= day;
		now.hour	= hour;
		now.min		= min;
		now.sec		= sec;
		now.week	= 1;
		Device_RTC_set( now );
		Shoushi = 0;
	}
	//------------------------------------------------
	if( GPRMC.status == 'A' )                                               //  记录定位时间
	{
		Time2BCD( A_time );
		//------- Debug 存储 每秒的经纬度  || 实际应该是 存储每分钟的位置  -----
		//  内容持续55秒每秒更新，这寄存器中记录的是在每分钟内最后一包定位的经纬度 ,预留5秒用于存储上一小时的位置
		if( sec < 55 )
		{
			memcpy( Posit[min].latitude_BgEnd, Gps_Gprs.Latitude, 4 );      //北纬
			memcpy( Posit[min].longitude_BgEnd, Gps_Gprs.Longitude, 4 );    //经度
			Posit[min].longitude_BgEnd[0] |= 0x80;                          //  东经
		}
		if( ( min == 59 ) && ( sec == 55 ) )
		{                                                                   // 每个小时的位置信息
			NandsaveFlg.MintPosit_SaveFlag = 1;
		}
	}
	//---- 存储当前的起始里程  跨天时------------
	if( ( hour == 0 ) && ( min == 0 ) && ( sec < 3 ) )                      // 存储3次确保存储成功
	{
		JT808Conf_struct.DayStartDistance_32 = JT808Conf_struct.Distance_m_u32;
		Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
	}

	//-------------------------------------------------
	//---------  天地通协议  -------

	//if(systemTick_TriggerGPS==0)
	{
		Temp_Gps_Gprs.Date[0]	= year;
		Temp_Gps_Gprs.Date[1]	= mon;
		Temp_Gps_Gprs.Date[2]	= day;
	}

	//-------------- 计算算平均速度 ----------------
	AvrgSpd_MintProcess( hour, min, sec );
}

//---------  GGA --------------------------
void HDop_pro( u8 *tmpinfo )
{
	float dop;

	dop			= atof( (char*)tmpinfo );
	HDOP_value	= dop;          //  Hdop 数值
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void  GPS_Delta_DurPro( void )  //告GPS 触发上报处理函数
{
	if( line_warn_enable == 1 )
	{
		rt_kprintf( "\r\n  %d-%d-%d %d:%d:%d %s", Temp_Gps_Gprs.Date[0], Temp_Gps_Gprs.Date[1], Temp_Gps_Gprs.Date[2], \
		            Temp_Gps_Gprs.Time[0], Temp_Gps_Gprs.Time[1], Temp_Gps_Gprs.Time[2], gps_log );
	}

	if( 1 == JT808Conf_struct.SD_MODE.DUR_TOTALMODE ) // 定时上报模式
	{
		//----- 上一包数据记录的时间
		fomer_time_seconds = ( u32 )( BakTime[0] * 60 * 60 ) + ( u32 )( BakTime[1] * 60 ) + ( u32 )BakTime[2];

		//-----  当前数据记录的时间
		tmp_time_secnonds = ( u32 )( CurrentTime[0] * 60 * 60 ) + ( u32 )( CurrentTime[1] * 60 ) + ( u32 )CurrentTime[2];

		//一天86400秒

		if( tmp_time_secnonds > fomer_time_seconds )
		{
			delta_time_seconds = tmp_time_secnonds - fomer_time_seconds;
			//systemTickGPS_Clear();
		}else if( tmp_time_secnonds < fomer_time_seconds )
		{
			delta_time_seconds = 86400 - fomer_time_seconds + tmp_time_secnonds;
			//systemTickGPS_Clear();
		}else
		{
			// systemTickGPS_Set();
			UDP_dataPacket_flag = 0X03;
			StatusReg_GPS_V( );
		}

		if( ( SleepState == 1 ) && ( delta_time_seconds == ( Current_SD_Duration - 5 ) ) )  //  --  休眠时 先发鉴权
		{
			SleepConfigFlag = 1;                                                            //发送前5 发送一包鉴权
		}

		if( ( delta_time_seconds >= Current_SD_Duration ) && ( local_trig == 0 ) )          //limitSend_idle
		{
			if( app_que_enable == 0 )                                                       // app 不是能上报
			{
				if( stop_current == 0 )
				{
					                                                  // 每次都是即时上报
	                 if(MQ_TrueUse.Enable_SD_state) 
	                 {
		                  if(MQ_TrueUse.Enable_SD_state==2)  // 存储时候存储。 上报时候不存储
		                  	{      
		                  	      //  upgrade    CurrentTotal  
		                  	       Get_MQ_true_CuurentTotal_packets(); 
								  //---- 盲区写入队列process--------
									MangQU_true_create(Temp_Gps_Gprs);
								    MQsend_counter++;
									//if(GpsStatus.Raw_Output==1) 
									rt_kprintf( "\r\n                 %d-%d-%d %d:%d:%d   sd=%d     Timeenable:%d  lati:%d  longi:%d\r\n",Temp_Gps_Gprs.Date[0], Temp_Gps_Gprs.Date[1], Temp_Gps_Gprs.Date[2], \
												Temp_Gps_Gprs.Time[0], Temp_Gps_Gprs.Time[1], Temp_Gps_Gprs.Time[2],MQsend_counter,EverySecond_Time_Get,Lati_Get,Longi_Get);  
		                  	}
	                 }
					 else
					 {
						 if(BDSD.Enable_Working==1)
						 	{   // 顺序存储判断补报
	                           BD_send_Mque_Tx(Temp_Gps_Gprs);
						 	} 
					    else
					 	 {
	                        PositionSD_Enable( );
						    Current_UDP_sd = 1;   
					 	 }
					}	
				}
			}
			memcpy( BakTime, CurrentTime, 3 );                                              // update

			if( stopNormal == 1 )
			{
				gps_sd_coutner++;
				rt_kprintf( "\r\n %d    %d-%d-%d %d:%d:%d %s", gps_sd_coutner, Temp_Gps_Gprs.Date[0], Temp_Gps_Gprs.Date[1], Temp_Gps_Gprs.Date[2], \
				            Temp_Gps_Gprs.Time[0], Temp_Gps_Gprs.Time[1], Temp_Gps_Gprs.Time[2], gps_log );
			}else
			{
				gps_sd_coutner = 0;
			}
			// rt_kprintf("\r\ntmp_time=%d,fomer_time=%d,delta_time=%d,Current=%d",tmp_time_secnonds,fomer_time_seconds,delta_time_seconds,Current_SD_Duration);
		}
	}

	//------------------------------ do this every  second-----------------------------------------
	memcpy( (char*)&Gps_Gprs, (char*)&Temp_Gps_Gprs, sizeof( Temp_Gps_Gprs ) );

	//------  电子围栏 判断  ----------


	/*  if((Temp_Gps_Gprs.Time[2]%20)==0) //   认证时不检测圆形电子围栏
	   {
	      CycleRail_Judge(Temp_Gps_Gprs.Latitude,Temp_Gps_Gprs.Longitude);
	   //rt_kprintf("\r\n --- 判断圆形电子围栏");
	   }	*/
	// if((Temp_Gps_Gprs.Time[2]==5)||(Temp_Gps_Gprs.Time[2]==25)||(Temp_Gps_Gprs.Time[2]==45)) //

