nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
	//  if(Temp_Gps_Gprs.Time[2]%2==0)//    认证时要求2 秒
	// {
	     RectangleRail_Judge( Temp_Gps_Gprs.Latitude, Temp_Gps_Gprs.Longitude );
	//rt_kprintf("\r\n -----判断矩形电子围栏");
	//    }

	if( line_warn_enable == 1 )
	{
		RouteLineWarn_judge( Temp_Gps_Gprs.Latitude, Temp_Gps_Gprs.Longitude );
	}

	/*
	     if((Temp_Gps_Gprs.Time[2]%3)==0) //     路线判断
	   {
	         // printf("\r\n --- 判断圆形电子围栏");
	          RouteRail_Judge(Temp_Gps_Gprs.Latitude,Temp_Gps_Gprs.Longitude);
	   }
	 */
	//rt_kprintf("\r\n Delta_seconds %d \r\n",delta_time_seconds);

	
    EverySecond_Time_Get=0; // clear
    Longi_Get=0;
	Lati_Get=0; 
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void local_time( void )
{
	if( local_trig == 1 )                                                           //  GPS 时间
	{
		local_timer++;

		if( ( SleepState == 1 ) && ( local_timer == ( Current_SD_Duration - 5 ) ) ) //  --  休眠时 先发鉴权
		{
			SleepConfigFlag = 1;                                                    //发送前5 发送一包鉴权
		}

		if( ( local_timer >= Current_SD_Duration ) && ( local_trig == 0 ) )         //limitSend_idle
		{
			PositionSD_Enable( );
			// if(SleepState==1)
			Current_UDP_sd	= 1;
			local_timer		= 0;                                                    // clear

			memcpy( BakTime, CurrentTime, 3 );                                      // update
			rt_kprintf( "\r\n-->local time trig\r\n" );
		}
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void  Exact_Test_time( void )
{
	if( local_trig == 2 )                                                                                                                                                                               //  GPS 时间
	{
		local_timer++;
		if( local_timer >= 9 )                                                                                                                                                                          //900ms
		{
			local_timer = 0;
			PositionSD_Enable( );
			// if(SleepState==1)
			Current_UDP_sd	= 1;
			local_timer		= 0;                                                                                                                                                                        // clear
			memcpy( BakTime, CurrentTime, 3 );                                                                                                                                                          // update
			rt_kprintf( "\r\n->DWJD-\r\n" );
		}
	}
}

//----------------------------------------------------------------------------------------------------
void  SpeedSensorProcess( void )                                                                                                                                                                        // 通过汽车的速度传感器获得 速度 并计算里程
{
	u32 Distance_1s_m = 0;                                                                                                                                                                              // 一秒钟运行 多少米
//  u32 sp=0;
	//  1. 用K值计算速度   -----------------------------------------------------------


	/*
	      K 表示 每公里 脉冲数
	      1米/脉冲数 :   K/1000
	      Delta_1s_Plus: 每秒钟采集到的脉冲数
	      每秒行驶米数:  Delta_1s_Plus *1000/K
	      => Delta_1s_Plus *1000/K*3.6*10 单位:0.1  km/h  =>Delta_1s_Plus *36000/K  单位:0.1 km/h
	 */
	Speed_cacu		= ( Delta_1s_Plus * 36000 ) / JT808Conf_struct.Vech_Character_Value;                                                                                                                // 通过计算得到的速度
	GPS_speed		= Speed_cacu;                                                                                                                                                                       //把计算得到的传感器速度给 协议 寄存器
	Distance_1s_m	= ( Delta_1s_Plus * 1000 ) / JT808Conf_struct.Vech_Character_Value;                                                                                                                 // 每秒运行多少米
	// 2. 计算里程相关  -------------------------------------------------------------
	//------------------------------------
	ModuleStatus |= Status_Pcheck;

	//------- GPS  里程计算  --------
	JT808Conf_struct.Distance_m_u32 += Distance_1s_m;                                                                                                                                                   // 除以3600 是m/s
	if( JT808Conf_struct.Distance_m_u32 > 0xFFFFFF )
	{
		JT808Conf_struct.Distance_m_u32 = 0;                                                                                                                                                            //里程最长这么多米
	}
	// ------------------------------------------------------------------------------
}

//---------------------------------------------------------------------------------------------------
void K_AdjustUseGPS( u32 sp, u32 sp_DISP )                                                                                                                                                              // 通过GPS 校准  K 值  (车辆行驶1KM 的脉冲数目)
{
	u32 Reg_distance	= 0;
	u32 Reg_plusNum		= 0;
	u16 i				= 0;

	if( JT808Conf_struct.DF_K_adjustState )                                                                                                                                                             // 只有没校准时才有效
	{
		return;
	}

	Speed_Rec = (u8)( sp_DISP / 10 );                                                                                                                                                                   // GPS速度    单位:km/h
	// -------	要求速度在60到65km/h  -------------
	if( ( ( Speed_Rec >= Speed_area ) && ( Speed_Rec <= ( Speed_area + 8 ) ) ) || ( ( Speed_Rec >= 40 ) && ( Speed_Rec <= ( 40 + 8 ) ) ) || ( ( Speed_Rec >= 70 ) && ( Speed_Rec <= ( 70 + 8 ) ) ) )    // Speed_area=60
	// if(Speed_Rec>=Speed_area)
//   if((Speed_Rec>=40)&&(Speed_Rec<=48))   // Speed_area=60
	{
		Spd_adjust_counter++;
		if( Spd_adjust_counter > K_adjust_Duration )                                                                                                                                                    //持续在速度在60~65下认为已经是匀速了
		{
			// 用获取到的匀速GPS速度作为基准，和根据传感器计算出来的速度，做K值得校准
			Reg_distance	= 0;                                                                                                                                                                        // clear
			Reg_plusNum		= 0;                                                                                                                                                                        // clear
			for( i = 0; i < K_adjust_Duration; i++ )
			{
				Reg_distance	+= Former_gpsSpd[i];                                                                                                                                                    // 除以3.6km/h 表示该秒内走了多少米
				Reg_plusNum		+= Former_DeltaPlus[i];
			}


