nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
			/*
			     做一个判断  ， 如果速度传感器不管用， 那么返回，
			 */
			if( Reg_plusNum < 20 )
			{
				Spd_adjust_counter = 0;
				rt_kprintf( "\r\n    速度传感器 没有脉冲!\r\n" );
				return;
			}
			//===================================================================
			// 转换成根据GPS速度计算行驶了多少米，(总距离) 先求和在除以3.6 ，为了计算方便 先x10  再除以36
			Reg_distance = (u32)( Reg_distance * 10 / 36 ); // 转换成根据GPS速度计算行驶了多少米，(总距离)
			// (Reg_plusNum/Reg_distance) 表示用脉冲总数除以距离(米)= 每米产生多少个脉冲 ，因为K值是1000米脉冲数，所以应该乘以1000
			JT808Conf_struct.Vech_Character_Value = 1000 * Reg_plusNum / Reg_distance;
			//-------  存储新的特征系数 --------------------------------
			JT808Conf_struct.DF_K_adjustState	= 1;        // clear  Flag
			ModuleStatus						|= Status_Pcheck;
			Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );

			Spd_adjust_counter = 0;                         // clear  counter
		}else
		{                                                   //-------- 记录规定时间内的脉冲数和GPS速度----------
			Former_gpsSpd[Spd_adjust_counter]		= Speed_Rec;
			Former_DeltaPlus[Spd_adjust_counter]	= Delta_1s_Plus;
		}
	}else
	{
		Spd_adjust_counter = 0;                             // 只要速度超出预设范围 计数器清0
	}
}

//==================================================================================================
// 第二部分 :   以下是外部传感器状态监测
//==================================================================================================


/*
     -----------------------------
     2.1   和协议相关的功能函数
     -----------------------------
 */

void IMSI_Convert_SIMCODE( void )
{
	SIM_code[0] = IMSI_CODE[3] - 0X30;
	SIM_code[0] <<= 4;
	SIM_code[0] |= IMSI_CODE[4] - 0X30;

	SIM_code[1] = IMSI_CODE[5] - 0X30;
	SIM_code[1] <<= 4;
	SIM_code[1] |= IMSI_CODE[6] - 0X30;

	SIM_code[2] = IMSI_CODE[7] - 0X30;
	SIM_code[2] <<= 4;
	SIM_code[2] |= IMSI_CODE[8] - 0X30;

	SIM_code[3] = IMSI_CODE[9] - 0X30;
	SIM_code[3] <<= 4;
	SIM_code[3] |= IMSI_CODE[10] - 0X30;

	SIM_code[4] = IMSI_CODE[11] - 0X30;
	SIM_code[4] <<= 4;
	SIM_code[4] |= IMSI_CODE[12] - 0X30;

	SIM_code[5] = IMSI_CODE[13] - 0X30;
	SIM_code[5] <<= 4;
	SIM_code[5] |= IMSI_CODE[14] - 0X30;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void GNSS_RawDataTrans_Init( u8 mode )  // 北斗添加
{
	if( mode )
	{
		GNSS_rawdata.WorkEnable = 1;    //初始化使能
	}else
	{
		GNSS_rawdata.WorkEnable = 0;    //初始化不使能
	}
	GNSS_rawdata.first_record	= 1;
	GNSS_rawdata.rd_num			= 0;
	GNSS_rawdata.wr_num			= 0;
	GNSS_rawdata.save_status	= 0;
	GNSS_rawdata.Raw_wr			= 0;
}

/*
     -----------------------------
    2.4  不同协议状态寄存器变化
     -----------------------------
 */

void StatusReg_WARN_Enable( void )
{
	//     紧急报警状态下 寄存器的变化
	Warn_Status[3] |= 0x01;     //BIT( 0 );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void StatusReg_WARN_Clear( void )
{
	//     清除报警寄存器
	Warn_Status[3] &= ~0x01;    //BIT( 0 );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void StatusReg_ACC_ON( void )
{                               //    ACC 开
	Car_Status[3] |= 0x01;      //  Bit(0)     Set  1  表示 ACC开
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void StatusReg_ACC_OFF( void )
{                               //    ACC 关
	Car_Status[3] &= ~0x01;     //  Bit(0)     Set  01  表示 ACC关
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void StatusReg_POWER_CUT( void )
{                               //  主电源断开
	Warn_Status[2]	|= 0x01;    //BIT( 0 );
	ModuleStatus	|= Status_Battery;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void StatusReg_POWER_NORMAL( void )
{                               // 主电源正常
	Warn_Status[2]	&= ~0x01;   //BIT( 0 );
	ModuleStatus	&= ~Status_Battery;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void StatusReg_GPS_A( void )
{                               // GPS 定位
	if( GPS_getfirst == 0 )
	{
#ifdef LCD_5inch
		DwinLCD.Type = LCD_SETTIME;
#endif
		Shoushi = 1;
		rt_kprintf( "\r\n firs A  Set RTC\r\n" );
	}
	GPS_getfirst	= 1;
	Car_Status[3]	|= 0x02;    //Bit(1)
	ModuleStatus	|= Status_GPS;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void StatusReg_GPS_V( void )
{                               //  GPS 不定位
	Car_Status[3]	&= ~0x02;   //Bit(1)
	ModuleStatus	&= ~Status_GPS;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void StatusReg_SPD_WARN( void )
{                               //  超速报警
	Warn_Status[3] |= 0x02;     //BIT( 1 );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void StatusReg_SPD_NORMAL( void )
{                               //  速度正常
	Warn_Status[3] &= ~0x02;    //BIT( 1 );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void StatusReg_Relay_Cut( void )
{                               // 断油断电状态
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void StatusReg_Relay_Normal( void )
{                               //  断油电状态正常
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void StatusReg_Default( void )
{                               //   状态寄存器还原默认设置
	Warn_Status[0]	= 0x00;     //HH
	Warn_Status[1]	= 0x00;     //HL
	Warn_Status[2]	= 0x00;     //LH
	Warn_Status[3]	= 0x00;     //LL
}

//==================================================================================================
// 第三部分 :   以下是GPRS无线传输相关协议
//==================================================================================================
void BD_send_Init(void)
{
  BDSD.Enable_Working=0;
  BDSD.read=0;
  BDSD.SendFlag=0; 
  BDSD.wait__resentTimer=0;
  BDSD.write=0;

