nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
}

void BD_send_Mque_Tx(T_GPS_Info_GPRS Gps_Gprs)
{
  
  u16 counter_mainguffer, i;
  u32 Dis_01km=0;
   
  
	  //----------------------- Save GPS --------------------------------------
	  memset( (u8*)BDsd_tx.body, 0, sizeof(BDsd_tx.body) );
	  BDsd_tx.wr= 0;
	  BDsd_tx.wr++;// 长度
	  //------------------------------- Stuff ----------------------------------------
	  counter_mainguffer = BDsd_tx.wr;
	  // 1. 告警状态   4 Bytes
	  memcpy( ( char* ) BDsd_tx.body+ BDsd_tx.wr, ( char* )Warn_Status, 4 );
	  BDsd_tx.wr += 4;
	  // 2. 车辆状态   4 Bytes
	  memcpy( ( char* )BDsd_tx.body + BDsd_tx.wr, ( char* )Car_Status, 4 );
	  BDsd_tx.wr += 4;
	  // 3.   纬度	   4 Bytes
	  memcpy( ( char* )BDsd_tx.body + BDsd_tx.wr, ( char* )Gps_Gprs.Latitude, 4 );   //纬度   modify by nathan
	  BDsd_tx.wr += 4;
	  // 4.   经度	   4 Bytes
	  memcpy( ( char* )BDsd_tx.body + BDsd_tx.wr, ( char* )Gps_Gprs.Longitude, 4 );  //经度	东经  Bit 7->0	  西经 Bit 7 -> 1
	  BDsd_tx.wr += 4;
	  // 5.  高度	2 Bytes    m
	  BDsd_tx.body[BDsd_tx.wr++] = ( GPS_Hight >> 8 ); 							  // High
	  BDsd_tx.body[BDsd_tx.wr++] = (u8)GPS_Hight;									  // Low
	  // 6.  速度	2 Bytes 	0.1Km/h
	  BDsd_tx.body[BDsd_tx.wr++] = ( Speed_gps >> 8 ); 							  // High
	  BDsd_tx.body[BDsd_tx.wr++] = (u8)Speed_gps;									  // Low
	  // 7.  方向	2 Bytes 	  1度
	  BDsd_tx.body[BDsd_tx.wr++] = ( GPS_direction >> 8 ); 						  //High
	  BDsd_tx.body[BDsd_tx.wr++] = GPS_direction;									  // Low
	  // 8.  日期时间	6 Bytes
	  BDsd_tx.body[BDsd_tx.wr++] = ( ( ( Gps_Gprs.Date[0] ) / 10 ) << 4 ) + ( ( Gps_Gprs.Date[0] ) % 10 );
	  BDsd_tx.body[BDsd_tx.wr++] = ( ( Gps_Gprs.Date[1] / 10 ) << 4 ) + ( Gps_Gprs.Date[1] % 10 );
	  BDsd_tx.body[BDsd_tx.wr++] = ( ( Gps_Gprs.Date[2] / 10 ) << 4 ) + ( Gps_Gprs.Date[2] % 10 );
	  BDsd_tx.body[BDsd_tx.wr++] = ( ( Gps_Gprs.Time[0] / 10 ) << 4 ) + ( Gps_Gprs.Time[0] % 10 );
	  BDsd_tx.body[BDsd_tx.wr++] = ( ( Gps_Gprs.Time[1] / 10 ) << 4 ) + ( Gps_Gprs.Time[1] % 10 );
	  BDsd_tx.body[BDsd_tx.wr++] = ( ( Gps_Gprs.Time[2] / 10 ) << 4 ) + ( Gps_Gprs.Time[2] % 10 );





   #if 1
	  //--------------------------------------------------------------	  
	  //----------- 附加信息  ------------
	  //  附加信息 1  -----------------------------
	  //  附加信息 ID
	  BDsd_tx.body[BDsd_tx.wr++] = 0x03; // 行驶记录仪的速度
	  //  附加信息长度
	  BDsd_tx.body[BDsd_tx.wr++] = 2;
	  //  类型
	  BDsd_tx.body[BDsd_tx.wr++]   = (u8)( Speed_cacu >> 8 );
	  BDsd_tx.body[BDsd_tx.wr++]   = (u8)( Speed_cacu );
	  //rt_kprintf("\r\n GPS速度=%d km/h , 传感器速度=%d km/h\r\n",Speed_gps,Speed_cacu);
	  //  附加信息 2  -----------------------------
	  //  附加信息 ID
	  BDsd_tx.body[BDsd_tx.wr++] = 0x01; // 车上的行驶里程
	  //  附加信息长度
	  BDsd_tx.body[BDsd_tx.wr++] = 4;
	  //  类型
	  Dis_01km							  = JT808Conf_struct.Distance_m_u32 / 100;
	  BDsd_tx.body[BDsd_tx.wr++]   = ( Dis_01km >> 24 );
	  BDsd_tx.body[BDsd_tx.wr++]   = ( Dis_01km >> 16 );
	  BDsd_tx.body[BDsd_tx.wr++]   = ( Dis_01km >> 8 );
	  BDsd_tx.body[BDsd_tx.wr++]   = Dis_01km;
	  
	  //  附加信息 3
	  if( Warn_Status[1] & 0x10 )
	  {
		  //  附加信息 ID
		  BDsd_tx.body[BDsd_tx.wr++] = 0x12; //	进出区域/路线报警
		  //  附加信息长度
		  BDsd_tx.body[BDsd_tx.wr++] = 6;
		  //  类型
		  BDsd_tx.body[BDsd_tx.wr++]   = InOut_Object.TYPE;
		  BDsd_tx.body[BDsd_tx.wr++]   = ( InOut_Object.ID >> 24 );
		  BDsd_tx.body[BDsd_tx.wr++]   = ( InOut_Object.ID >> 16 );
		  BDsd_tx.body[BDsd_tx.wr++]   = ( InOut_Object.ID >> 8 );
		  BDsd_tx.body[BDsd_tx.wr++]   = InOut_Object.ID;
		  BDsd_tx.body[BDsd_tx.wr++]   = InOut_Object.InOutState;
		  rt_kprintf( "\r\n ----- 0x0200 current 附加信息 \r\n" );
	  }
	  
	  //  附件信息4
	  if( Warn_Status[3] & 0x02 )
	  {
		  //  附加信息 ID
		  BDsd_tx.body[BDsd_tx.wr++] = 0x11; 				  //  进出区域/路线报警
		  //  附加信息长度
		  BDsd_tx.body[BDsd_tx.wr++] = 1;
		  //  类型
		  BDsd_tx.body[BDsd_tx.wr++] = 0;					  //  无特定位置
	  }
	  // 5. 附加信息
	  BDsd_tx.body[BDsd_tx.wr++]   = 0x25;					  //ID	扩展车辆信号状态位
	  BDsd_tx.body[BDsd_tx.wr++]   = 4;						  //LEN
	  BDsd_tx.body[BDsd_tx.wr++]   = 0x00;
	  BDsd_tx.body[BDsd_tx.wr++]   = 0x00;
	  BDsd_tx.body[BDsd_tx.wr++]   = 0x00;
	  BDsd_tx.body[BDsd_tx.wr++]   = BD_EXT.Extent_IO_status;
	  //6. 附加信息  :
	  if( SleepState == 1 ) 										  //休眠
	  {
		  BDsd_tx.body[BDsd_tx.wr++]   = 0x2A;				  //ID	 IO状态位【1】	 bit0:深度休眠	 bit1:休眠【0】保留
		  BDsd_tx.body[BDsd_tx.wr++]   = 2;					  //LEN
		  BDsd_tx.body[BDsd_tx.wr++]   = 0x02;
		  BDsd_tx.body[BDsd_tx.wr++]   = 0;
	  }
	  //  附加信息 7  -----------------------------
	  //  附加信息 ID
	  BDsd_tx.body[BDsd_tx.wr++] = 0x2B; 					  //模拟量
	  //  附加信息长度
	  BDsd_tx.body[BDsd_tx.wr++] = 4;
	  //  类型
	  BDsd_tx.body[BDsd_tx.wr++]   = ( AD_2through[1] >> 8 );  // AD1
	  BDsd_tx.body[BDsd_tx.wr++]   = AD_2through[1];
	  BDsd_tx.body[BDsd_tx.wr++]   = ( AD_2through[0] >> 8 );  // AD0
	  BDsd_tx.body[BDsd_tx.wr++]   = AD_2through[0];
	  //  附加信息 8  -----------------------------
	  //  附加信息 ID
	  BDsd_tx.body[BDsd_tx.wr++] = 0x30; 					  //无线通信网络信号强度
	  //  附加信息长度
	  BDsd_tx.body[BDsd_tx.wr++] = 1;
	  //  类型
	  BDsd_tx.body[BDsd_tx.wr++] = ModuleSQ;
	  
	  //  附加信号 9  ---------------------------------
	  BDsd_tx.body[BDsd_tx.wr++]   = 0x31;					  // GNSS 定位卫星颗数
	  BDsd_tx.body[BDsd_tx.wr++]   = 1;						  // len
	  BDsd_tx.body[BDsd_tx.wr++]   = Satelite_num;
	#endif  

		BDsd_tx.body[0]=BDsd_tx.wr;  

		//-------------  Caculate  FCS  -----------------------------------
		FCS_GPS_UDP=0;  
		for ( i = 0; i < BDsd_tx.wr; i++ )  
		{
				FCS_GPS_UDP ^= *( BDsd_tx.body + i ); 
		}			   //求上边数据的异或和
		BDsd_tx.body[BDsd_tx.wr++] = FCS_GPS_UDP;  

	  //-------------------------------- stuff msg_queue------------------------------------------
	  rt_mq_send( &mq_BDsd, (void*)&BDsd_tx, BDsd_tx.wr+2); 
  
	  //OutPrint_HEX("BD-send",BDsd_tx.body,BDsd_tx.wr);

}

u8 BD_send_Mque_Rx(void)
{
    rt_err_t	res;

    memset(BDsd_rx.body,0,sizeof(BDsd_rx.body));
   	res = rt_mq_recv( &mq_BDsd, (void*)&BDsd_rx, 128,5 ); //等待100ms,实际上就是变长的延时,最长100ms
	if( res == RT_EOK )                                                     //收到一包数据
	{

               WatchDog_Feed();
       if( BDSD_SaveCycleGPS(BDSD.write,BDsd_rx.body,BDsd_rx.wr))
	     { //---- updata pointer   -------------		
			BDSD.write++;  	
		       if(BDSD.write>=Max_BDSD_Num)
		  	               BDSD.write=0;  
			DF_Write_RecordAdd(BDSD.write,BDSD.write,TYPE_BDsdAdd);   
			DF_delay_ms(20);  
	      //-------------------------------	
	        if(DispContent) 	
					       rt_kprintf("\r\n    BDsq succed\r\n");
            }  
	    else
	    	{
	    	  if(DispContent) 	
					       rt_kprintf("\r\n    BDsq fail\r\n");

