nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
	    	}
           //  OutPrint_HEX("BD-RX",BDsd_rx.body,BDsd_rx.wr);  
             return true;
	}

}


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void MangQU_true_create(T_GPS_Info_GPRS Gps_Gprs)
{
	
	u16 counter_mainguffer, i;


		//----------------------- Save GPS --------------------------------------
		memset( GPSsaveBuf, 0, 40 );
		GPSsaveBuf_Wr = 0;
		//------------------------------- Stuff ----------------------------------------
		counter_mainguffer = GPSsaveBuf_Wr;
		// 1. 告警状态   4 Bytes
		memcpy( ( char* )GPSsaveBuf + GPSsaveBuf_Wr, ( char* )Warn_Status, 4 );
		GPSsaveBuf_Wr += 4;
		// 2. 车辆状态   4 Bytes
		memcpy( ( char* )GPSsaveBuf + GPSsaveBuf_Wr, ( char* )Car_Status, 4 );
		GPSsaveBuf_Wr += 4;
		// 3.   纬度     4 Bytes
		memcpy( ( char* )GPSsaveBuf + GPSsaveBuf_Wr, ( char* )Gps_Gprs.Latitude, 4 );   //纬度   modify by nathan
		GPSsaveBuf_Wr += 4;
		// 4.   经度     4 Bytes
		memcpy( ( char* )GPSsaveBuf + GPSsaveBuf_Wr, ( char* )Gps_Gprs.Longitude, 4 );  //经度    东经  Bit 7->0	西经 Bit 7 -> 1
		GPSsaveBuf_Wr += 4;
		// 5.  高度	  2 Bytes    m
		GPSsaveBuf[GPSsaveBuf_Wr++] = ( GPS_Hight >> 8 );                               // High
		GPSsaveBuf[GPSsaveBuf_Wr++] = (u8)GPS_Hight;                                    // Low
		// 6.  速度	  2 Bytes     0.1Km/h
		GPSsaveBuf[GPSsaveBuf_Wr++] = ( Speed_gps >> 8 );                               // High
		GPSsaveBuf[GPSsaveBuf_Wr++] = (u8)Speed_gps;                                    // Low
		// 7.  方向	  2 Bytes	    1度
		GPSsaveBuf[GPSsaveBuf_Wr++] = ( GPS_direction >> 8 );                           //High
		GPSsaveBuf[GPSsaveBuf_Wr++] = GPS_direction;                                    // Low
		// 8.  日期时间	  6 Bytes
		GPSsaveBuf[GPSsaveBuf_Wr++] = ( ( ( Gps_Gprs.Date[0] ) / 10 ) << 4 ) + ( ( Gps_Gprs.Date[0] ) % 10 );
		GPSsaveBuf[GPSsaveBuf_Wr++] = ( ( Gps_Gprs.Date[1] / 10 ) << 4 ) + ( Gps_Gprs.Date[1] % 10 );
		GPSsaveBuf[GPSsaveBuf_Wr++] = ( ( Gps_Gprs.Date[2] / 10 ) << 4 ) + ( Gps_Gprs.Date[2] % 10 );
		GPSsaveBuf[GPSsaveBuf_Wr++] = ( ( Gps_Gprs.Time[0] / 10 ) << 4 ) + ( Gps_Gprs.Time[0] % 10 );
		GPSsaveBuf[GPSsaveBuf_Wr++] = ( ( Gps_Gprs.Time[1] / 10 ) << 4 ) + ( Gps_Gprs.Time[1] % 10 );
		GPSsaveBuf[GPSsaveBuf_Wr++] = ( ( Gps_Gprs.Time[2] / 10 ) << 4 ) + ( Gps_Gprs.Time[2] % 10 );
		//-------------  Caculate  FCS  -----------------------------------
		FCS_GPS_UDP = 0;
		for( i = counter_mainguffer; i < 30; i++ )
		{
			FCS_GPS_UDP ^= *( GPSsaveBuf + i );
		}                                                           //求上边数据的异或和
		GPSsaveBuf[30] = FCS_GPS_UDP;

		
		//-------------------------------- stuff msg_queue------------------------------------------
		rt_mq_send( &mq_MQBuBao, (void*)&GPSsaveBuf, 32); 

		//OutPrint_HEX("MQ-Genernate",GPSsaveBuf,32);
		
}

void MangQU_true_Save(void)
{
    rt_err_t	res;
	u8  Rx_MQ[40];

    memset(Rx_MQ,0,40);
   	res = rt_mq_recv( &mq_MQBuBao, (void*)&Rx_MQ, 32,5 ); //等待100ms,实际上就是变长的延时,最长100ms
	if( res == RT_EOK )                                                     //收到一包数据
	{
       	if( Api_cycle_write( GPSsaveBuf, 31 ) ) 
		{
			if( DispContent )
			{
				rt_kprintf( "\r\n    MQ Save succed wr=%d\r\n",cycle_write ); 
			}
		}else
		{
			WatchDog_Feed( );
			if( DispContent )
			{
				rt_kprintf( "\r\n MQ save fail\r\n" );
			}

			if( Api_cycle_write( GPSsaveBuf, 31 ) )
			{
				rt_kprintf( "\r\n MQ save retry ok\r\n" ); 
			}
		}
      // OutPrint_HEX("MQ-save",Rx_MQ,32);  
	}

}


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void MangQU_read( u32 packetnum, u8 *str, u32 length )
{
    u32  i=0,Size_pkt=0, pagein_offset=0;
    u8  latiBuf[8*MQ_PKNUM];  // 16*8
    u8   regstr[4];	
	u8   reg8str[8];
	u8	lati[4], longi[4];
	u32 lati_stuff	= 0, longi_stuff = 0;
	u16 spd_stuff	= 0;
	u8	time_stuff[3];
	u32 timervalue = 0;

	   Size_pkt=8*MQ_PKNUM;	
	memset( latiBuf, 0, sizeof( latiBuf ) );

	for( i = 0; i < Size_pkt; i++ )
	{
		latiBuf[i] = SST25V_ByteRead( ( (u32)( DF_MQ_Page ) * 512 ) + (u32)( packetnum * Size_pkt + i ) ); //512bytes 一个单位
	}
		//OutPrint_HEX("lati",latiBuf,175);
        // value start      18:13:14   18*3600+13*60+14=65594       
		timervalue=65594+packetnum*MQ_PKNUM; 
		for(i=0;i<MQ_PKNUM;i++)
		{
		     //--------- convert latitude ---------------------
			 memcpy(reg8str,latiBuf+8*i,8);
		//OutPrint_HEX("ascii",reg8str,8);
		//------------------------------------
		regstr[0]	= ( HexValue( reg8str[0] ) << 4 ) + HexValue( reg8str[1] );
		regstr[1]	= ( HexValue( reg8str[2] ) << 4 ) + HexValue( reg8str[3] );
		regstr[2]	= ( HexValue( reg8str[4] ) << 4 ) + HexValue( reg8str[5] );
		regstr[3]	= ( HexValue( reg8str[6] ) << 4 ) + HexValue( reg8str[7] );
		//------------------------------------
		// OutPrint_HEX("hex",regstr,4);

		//----------  信息长度 --------------------------
		Original_info[Original_info_Wr++]	= 0;
		Original_info[Original_info_Wr++]	= 32;
		//----------------0200 -----------------------
		// 1. 告警标志  4
		memcpy( ( char* )Original_info + Original_info_Wr, ( char* )Warn_Status, 4 );
		Original_info_Wr += 4;
		// 2. 状态  4
		memcpy( ( char* )Original_info + Original_info_Wr, ( char* )Car_Status, 4 );
		Original_info_Wr += 4;
		// 3.  纬度
		lati_stuff	= ( regstr[0] << 24 ) + ( regstr[1] << 16 ) + ( regstr[2] << 8 ) + ( regstr[3] ) - ( CSQ_counter % 25 ) + ( TIM1_Timer_Counter % 17 );  // need change	a  little
		lati[0]		= ( u8 )( lati_stuff >> 24 );
		lati[1]		= ( u8 )( lati_stuff >> 16 );
		lati[2]		= ( u8 )( lati_stuff >> 8 );
		lati[3]		= ( u8 )lati_stuff;
		memcpy( ( char* )Original_info + Original_info_Wr, ( char* )lati, 4 );                                                                              //纬度	 modify by nathan
		Original_info_Wr += 4;
		// 4.  经度

		longi_stuff = 116 * 1000000 - ( CSQ_counter % 12 ) + ( TIM1_Timer_Counter % 3 );
		longi[0]	= ( u8 )( longi_stuff >> 24 );
		longi[1]	= ( u8 )( longi_stuff >> 16 );
		longi[2]	= ( u8 )( longi_stuff >> 8 );
		longi[3]	= ( u8 )longi_stuff;
		memcpy( ( char* )Original_info + Original_info_Wr, ( char* )longi, 4 );                             //经度	  东经	Bit 7->0   西经 Bit 7 -> 1
		Original_info_Wr += 4;
		// 5.  高程
		GPS_Hight							= 50 + ( CSQ_counter % 8 ) - ( TIM1_Timer_Counter % 6 );
		Original_info[Original_info_Wr++]	= (u8)( GPS_Hight << 8 );
		Original_info[Original_info_Wr++]	= (u8)GPS_Hight;
		// 6.  速度	 0.1 Km/h
		spd_stuff							= 1080 - ( CSQ_counter % 10 ) + ( TIM1_Timer_Counter % 12 );    // need change	a  little  76
		Original_info[Original_info_Wr++]	= (u8)( spd_stuff >> 8 );                                       //(GPS_speed>>8);
		Original_info[Original_info_Wr++]	= (u8)( spd_stuff );                                            //GPS_speed;
		// 7. 方向   单位 1度
		Original_info[Original_info_Wr++]	= ( GPS_direction >> 8 );                                       //High
		Original_info[Original_info_Wr++]	= GPS_direction;                                                // Low
		// 8.  日期时间
		Original_info[Original_info_Wr++]	= 0x13;                                                         //(((Gps_Gprs.Date[0])/10)<<4)+((Gps_Gprs.Date[0])%10);
		Original_info[Original_info_Wr++]	= 0x03;                                                         //((Gps_Gprs.Date[1]/10)<<4)+(Gps_Gprs.Date[1]%10);
		Original_info[Original_info_Wr++]	= 0x05;                                                         // ((Gps_Gprs.Date[2]/10)<<4)+(Gps_Gprs.Date[2]%10);

