nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
			  timervalue=65594+packetnum*MQ_PKNUM+i;
		time_stuff[0]	= timervalue / 3600;
		time_stuff[1]	= ( timervalue % 3600 ) / 60;
		time_stuff[2]	= ( timervalue % 60 );
		// rt_kprintf("\r\n %d stufftime %d:%d:%d ",i,time_stuff[0],time_stuff[1],time_stuff[2]);

		Original_info[Original_info_Wr++]	= ( ( time_stuff[0] / 10 ) << 4 ) + ( time_stuff[0] % 10 ); //((Gps_Gprs.Time[0]/10)<<4)+(Gps_Gprs.Time[0]%10);
		Original_info[Original_info_Wr++]	= ( ( time_stuff[1] / 10 ) << 4 ) + ( time_stuff[1] % 10 );
		Original_info[Original_info_Wr++]	= ( ( time_stuff[2] / 10 ) << 4 ) + ( time_stuff[2] % 10 );

		//----------- 附加信息  ------------
		//  附加信息 1  -----------------------------
		//  附加信息 ID
		Original_info[Original_info_Wr++] = 0x03;                                                       // 行驶记录仪的速度
		//  附加信息长度
		Original_info[Original_info_Wr++] = 2;
		//  类型
		Original_info[Original_info_Wr++]	= (u8)( Speed_cacu >> 8 );
		Original_info[Original_info_Wr++]	= (u8)( Speed_cacu );
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void latrd( u8* instr )
{
	u32 i = 0, Size_pkt = 0, pagein_offset = 0;
	u8	latiBuf[7 * MQ_PKNUM]; // 15*7
	u8	regstr[4];
	u8	reg8str[8];
	u16 packetnum = 0;

	Size_pkt = 7 * MQ_PKNUM;

	sscanf( instr, "%d", (u32*)&packetnum );
	rt_kprintf( "\r\n inputpacket %d \r\n", packetnum );

	memset( latiBuf, 0, sizeof( latiBuf ) );

	for( i = 0; i < Size_pkt; i++ )
	{
		latiBuf[i] = SST25V_ByteRead( ( (u32)( DF_Record_Page + 1 ) * 512 ) + (u32)( packetnum * Size_pkt + i ) ); //512bytes 一个单位
	}
	OutPrint_HEX( "lati", latiBuf, Size_pkt );

	for( i = 0; i < MQ_PKNUM; i++ )
	{
		reg8str[0] = '0';
		memcpy( reg8str + 1, latiBuf + 7 * i, 7 );
		OutPrint_HEX( "ascii", reg8str, 8 );
		//------------------------------------
		regstr[0]	= ( HexValue( reg8str[0] ) << 4 ) + HexValue( reg8str[1] );
		regstr[1]	= ( HexValue( reg8str[2] ) << 4 ) + HexValue( reg8str[3] );
		regstr[2]	= ( HexValue( reg8str[4] ) << 4 ) + HexValue( reg8str[5] );
		regstr[3]	= ( HexValue( reg8str[6] ) << 4 ) + HexValue( reg8str[7] );
		//------------------------------------
		OutPrint_HEX( "hex", regstr, 4 );
	}
}

FINSH_FUNCTION_EXPORT( latrd, latrd );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void  MangquSave_GPS( void )
{
	u16 counter_mainguffer, i;
	u8	readbuf[MANGQsize]; //,regstatus;

	if( Current_UDP_sd && PositionSD_Status( ) )
	{
		PositionSD_Disable( );
		Current_UDP_sd = 0;
		//-------------------------------------------------------
		//1.   时间超前判断
		//  if(Time_FastJudge()==false)
		//		return ;
		//----------------------- Save GPS --------------------------------------
		memset( GPSsaveBuf, 0, 40 );
		GPSsaveBuf_Wr = 0;
		//------------------------------- Stuff ----------------------------------------
		counter_mainguffer = GPSsaveBuf_Wr;
		// 1. 告警状态   4 Bytes
		memcpy( ( char* )GPSsaveBuf + GPSsaveBuf_Wr, ( char* )Warn_Status, 4 );
		GPSsaveBuf_Wr += 4;
		// 2. 车辆状态   4 Bytes
		memcpy( ( char* )GPSsaveBuf + GPSsaveBuf_Wr, ( char* )Car_Status, 4 );
		GPSsaveBuf_Wr += 4;
		// 3.   纬度     4 Bytes
		memcpy( ( char* )GPSsaveBuf + GPSsaveBuf_Wr, ( char* )Gps_Gprs.Latitude, 4 );   //纬度   modify by nathan
		GPSsaveBuf_Wr += 4;
		// 4.   经度     4 Bytes
		memcpy( ( char* )GPSsaveBuf + GPSsaveBuf_Wr, ( char* )Gps_Gprs.Longitude, 4 );  //经度    东经  Bit 7->0	西经 Bit 7 -> 1
		GPSsaveBuf_Wr += 4;
		// 5.  高度	  2 Bytes    m
		GPSsaveBuf[GPSsaveBuf_Wr++] = ( GPS_Hight >> 8 );                               // High
		GPSsaveBuf[GPSsaveBuf_Wr++] = (u8)GPS_Hight;                                    // Low
		// 6.  速度	  2 Bytes     0.1Km/h
		GPSsaveBuf[GPSsaveBuf_Wr++] = ( Speed_gps >> 8 );                               // High
		GPSsaveBuf[GPSsaveBuf_Wr++] = (u8)Speed_gps;                                    // Low
		// 7.  方向	  2 Bytes	    1度
		GPSsaveBuf[GPSsaveBuf_Wr++] = ( GPS_direction >> 8 );                           //High
		GPSsaveBuf[GPSsaveBuf_Wr++] = GPS_direction;                                    // Low
		// 8.  日期时间	  6 Bytes
		GPSsaveBuf[GPSsaveBuf_Wr++] = ( ( ( Gps_Gprs.Date[0] ) / 10 ) << 4 ) + ( ( Gps_Gprs.Date[0] ) % 10 );
		GPSsaveBuf[GPSsaveBuf_Wr++] = ( ( Gps_Gprs.Date[1] / 10 ) << 4 ) + ( Gps_Gprs.Date[1] % 10 );
		GPSsaveBuf[GPSsaveBuf_Wr++] = ( ( Gps_Gprs.Date[2] / 10 ) << 4 ) + ( Gps_Gprs.Date[2] % 10 );
		GPSsaveBuf[GPSsaveBuf_Wr++] = ( ( Gps_Gprs.Time[0] / 10 ) << 4 ) + ( Gps_Gprs.Time[0] % 10 );
		GPSsaveBuf[GPSsaveBuf_Wr++] = ( ( Gps_Gprs.Time[1] / 10 ) << 4 ) + ( Gps_Gprs.Time[1] % 10 );
		GPSsaveBuf[GPSsaveBuf_Wr++] = ( ( Gps_Gprs.Time[2] / 10 ) << 4 ) + ( Gps_Gprs.Time[2] % 10 );
		//----------- 附加信息  ------------
		//  附加信息 1  -----------------------------
		//	附加信息 ID
		GPSsaveBuf[GPSsaveBuf_Wr++] = 0x03; // 行驶记录仪的速度
		//	附加信息长度
		GPSsaveBuf[GPSsaveBuf_Wr++] = 2;
		//	类型
		GPSsaveBuf[GPSsaveBuf_Wr++] = (u8)( Speed_cacu >> 8 );
		GPSsaveBuf[GPSsaveBuf_Wr++] = (u8)( Speed_cacu );

		//	 memcpy(MangQU.Buffer+MangQU.buf_wr,GPSsaveBuf,GPSsaveBuf_Wr);
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u8  Reg_save_gps( u8 *instr )
{
	u8 wr = 0;
	// 1. 告警状态   4 Bytes
	memcpy( ( char* )instr + wr, ( char* )Warn_Status, 4 );
	wr += 4;
	// 2. 车辆状态   4 Bytes
	memcpy( ( char* )instr + wr, ( char* )Car_Status, 4 );
	wr += 4;
	// 3.   纬度     4 Bytes
	memcpy( ( char* )instr + wr, ( char* )Gps_Gprs.Latitude, 4 );   //纬度   modify by nathan
	wr += 4;
	// 4.   经度     4 Bytes
	memcpy( ( char* )instr + wr, ( char* )Gps_Gprs.Longitude, 4 );  //经度    东经  Bit 7->0	西经 Bit 7 -> 1
	wr += 4;
	// 5.  高度	  2 Bytes    m
	instr[wr++] = ( GPS_Hight >> 8 );                               // High
	instr[wr++] = (u8)GPS_Hight;                                    // Low
	// 6.  速度	  2 Bytes     0.1Km/h
	instr[wr++] = ( Speed_gps >> 8 );                               // High
	instr[wr++] = (u8)Speed_gps;                                    // Low
	// 7.  方向	  2 Bytes	    1度
	instr[wr++] = ( GPS_direction >> 8 );                           //High
	instr[wr++] = GPS_direction;                                    // Low
	// 8.  日期时间	  6 Bytes
	instr[wr++] = ( ( ( Gps_Gprs.Date[0] ) / 10 ) << 4 ) + ( ( Gps_Gprs.Date[0] ) % 10 );
	instr[wr++] = ( ( Gps_Gprs.Date[1] / 10 ) << 4 ) + ( Gps_Gprs.Date[1] % 10 );
	instr[wr++] = ( ( Gps_Gprs.Date[2] / 10 ) << 4 ) + ( Gps_Gprs.Date[2] % 10 );
	instr[wr++] = ( ( Gps_Gprs.Time[0] / 10 ) << 4 ) + ( Gps_Gprs.Time[0] % 10 );
	instr[wr++] = ( ( Gps_Gprs.Time[1] / 10 ) << 4 ) + ( Gps_Gprs.Time[1] % 10 );
	instr[wr++] = ( ( Gps_Gprs.Time[2] / 10 ) << 4 ) + ( Gps_Gprs.Time[2] % 10 );

	return wr;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void  App_mq_Read_Process( void )
{
	char		ch;
//-----------------------------------------------------
	rt_err_t	res;

	if( AppQue.sd_enable_flag == 1 )
	{
		Stuff_Normal_Data_0200H( AppQue.read_num );
		AppQue.sd_enable_flag = 2;
		rt_kprintf( "\r\n DWJD     %d  send\r\n", AppQue.read_num );
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void App_mq_NoAck_counter( void )           // Que  方式下 没有新的应答超时判断
{
	if( ( AppQue.sd_enable_flag == 2 ) && ( app_que_enable == 1 ) )
	{
		AppQue.abnormal_counter++;
		if( AppQue.abnormal_counter >= 4 )  // 2s
		{
			AppQue.abnormal_counter = 0;
			AppQue.sd_enable_flag	= 1;
		}
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void App_mq_SendTimer( void )
{
	if( ( app_que_enable == 1 ) && ( AppQue.sd_enable_flag == 0 ) )
	{
		AppQue.send_timer++;
		if( AppQue.send_timer >= 10 ) // 100ms
		{
			AppQue.send_timer		= 0;
			AppQue.abnormal_counter = 0;
			AppQue.sd_enable_flag	= 1;
		}
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u8  App_mq_Resend( void )           // 启动Queue 重发
{
	if( AppQue.re_send_flag == 1 )
	{
		rt_kprintf( "\r\n + msg_resend ->app msg  wr=%d  rd=%d \r\n", AppQue.write_num, AppQue.read_num );
		Stuff_AppMq_Data_0200H( Rx_reg.body );
		AppQue.re_send_flag = 2;    // enable   wait for  Ack
		return true;
	}else
	{
		return false;
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void MangQu_Timer( void )
{
	//------------------------------------------------------------
	if( ( JT808Conf_struct.Close_CommunicateFlag == 0 ))
	{
		//   存储方式盲区
		if( MangQU.Enable_SD_state == 1 )
		{
		               // ----- normal -----
						if( MangQU.Sd_flag == 0 )
						{
							MangQU.Sd_timer++;
								  if(MangQU.Sd_timer>=2) 
							{
								MangQU.Sd_timer = 0;
										 MangQU.NoAck_timer=0;
								MangQU.Sd_flag	= 1;
							}
						}
		              //------- no  ack  process -----
		              if(MangQU.Sd_flag==2)
		              	{
		              	  MangQU.NoAck_timer++;
						  if( MangQU.NoAck_timer>=5)  
						  {
						      MangQU.NoAck_timer=0;
							  MangQU.Sd_timer=0;
		                      MangQU.Sd_flag=1;		
							  rt_kprintf("\r\n MQ Noack rensend! \r\n");
						  }

