nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
		              	}
		 } 
	  // 真正盲区补报从发定时器
	  	if( MQ_TrueUse.Enable_SD_state == 1 )
		{
		               // ----- normal -----
						if( MQ_TrueUse.Sd_flag == 0 )
						{
							MQ_TrueUse.Sd_timer++;
								  if(MQ_TrueUse.Sd_timer>=2) 
							{
								MQ_TrueUse.Sd_timer = 0;
										 MQ_TrueUse.NoAck_timer=0;
								MQ_TrueUse.Sd_flag	= 1;
							}
						}
		              //------- no  ack  process -----
		              if(MQ_TrueUse.Sd_flag==2)
		              	{
		              	  MQ_TrueUse.NoAck_timer++;
						  if( MQ_TrueUse.NoAck_timer>=2)  
						  {
						      MQ_TrueUse.NoAck_timer=0;
							  MQ_TrueUse.Sd_timer=0;
							  cycle_read=mangQu_read_reg;   //   还原read重新发送
				              MQ_TrueUse.Sd_flag=1; //enable发送
							  rt_kprintf("\r\n MQ_true Noack rensend! \r\n");
						  }

		              	}
		 } 
				
	}
}

//----------------------------------------------------------------------
u8  Protocol_Head( u16 MSG_ID, u8 Packet_Type )
{
    u16  CurrentID=0; 
	//----  clear --------------
	Original_info_Wr = 0;
	//	1. Head

	//  original info
	Original_info[Original_info_Wr++]	= ( MSG_ID >> 8 );                                              // 消息ID
	Original_info[Original_info_Wr++]	= (u8)MSG_ID;

	Original_info[Original_info_Wr++]	= 0x00;                                                         // 分包、加密方式、状态位
	Original_info[Original_info_Wr++]	= 28;                                                           // 消息体长度   位置信息长度为28个字节

	memcpy( Original_info + Original_info_Wr, SIM_code, 6 );                                            // 终端手机号 ，设备标识ID	BCD
	Original_info_Wr += 6;


    switch(Recode_Obj.CMD)
    {
        case 0x08:CurrentID=0x8000+Recode_Obj.Current_pkt_num;
			      Original_info[Original_info_Wr++]   = ( CurrentID>> 8 ); 					  //消息流水号
				  Original_info[Original_info_Wr++]   =CurrentID;
			       break;
		case 0x09:CurrentID=0x9000+Recode_Obj.Current_pkt_num;
					Original_info[Original_info_Wr++]	= ( CurrentID>> 8 );					//消息流水号
					Original_info[Original_info_Wr++]	=CurrentID;

                   break;
		case 0x10:
			       CurrentID=0xA000+Recode_Obj.Current_pkt_num;
				   Original_info[Original_info_Wr++]   = ( CurrentID>> 8 ); 				   //消息流水号
				   Original_info[Original_info_Wr++]   =CurrentID;

			       break;
		case 0x11:
			       CurrentID=0xB000+Recode_Obj.Current_pkt_num;
				   Original_info[Original_info_Wr++]   = ( CurrentID>> 8 ); 				   //消息流水号
				   Original_info[Original_info_Wr++]   =CurrentID;
			       break;
		case 0x12:
			       CurrentID=0xC000+Recode_Obj.Current_pkt_num;
				   Original_info[Original_info_Wr++]   = ( CurrentID>> 8 ); 				   //消息流水号
				   Original_info[Original_info_Wr++]   =CurrentID;
			       break;
		case  0x15:
			      CurrentID=0xD000+Recode_Obj.Current_pkt_num;
			      Original_info[Original_info_Wr++]   = ( CurrentID>> 8 ); 					  //消息流水号
				  Original_info[Original_info_Wr++]   =CurrentID;
 
				   break;  
		default:
			     if(MSG_ID==MSG_0x0704)
			     	{                      
					  CurrentID=0x5000+MQ_TrueUse.PacketNum;
					  Original_info[Original_info_Wr++]   = ( CurrentID>> 8 );					  //消息流水号
					  Original_info[Original_info_Wr++]   =CurrentID;

			     	}
				 else
			     if(MediaObj.Media_Type<3) // 不是  图片和音频
			     {
				    Original_info[Original_info_Wr++]   = ( JT808Conf_struct.Msg_Float_ID >> 8 ); 					  //消息流水号
				    Original_info[Original_info_Wr++]   = JT808Conf_struct.Msg_Float_ID;
			     }
				  break;

    } 


	if( Packet_Type == Packet_Divide )
	{
		switch( MediaObj.Media_Type )
		{
			case 0:                                                                                     // 图像
				MediaObj.Media_totalPacketNum	= Photo_sdState.Total_packetNum;                        // 图片总包数
				MediaObj.Media_currentPacketNum = Photo_sdState.SD_packetNum;                           // 图片当前报数
				MediaObj.Media_ID				= 1;                                                    //  多媒体ID
				MediaObj.Media_Channel			= Camera_Number;                                        // 图片摄像头通道号
                
				
			    CurrentID=0xF000+Camera_Number*0x0100+Photo_sdState.SD_packetNum;
				Original_info[Original_info_Wr++]=( CurrentID>>8); //消息流水号
				Original_info[Original_info_Wr++]=	CurrentID; 			   

				break;
			case 1:                                                                                     // 音频
				MediaObj.Media_totalPacketNum	= Sound_sdState.Total_packetNum;                        // 音频总包数
				MediaObj.Media_currentPacketNum = Sound_sdState.SD_packetNum;                           // 音频当前报数
				MediaObj.Media_ID				= 1;                                                    //  多媒体ID
				MediaObj.Media_Channel			= 1;                                                    // 音频通道号
                CurrentID=0xE000+Sound_sdState.SD_packetNum;
			    Original_info[Original_info_Wr++]=( CurrentID>>8); //消息流水号
	            Original_info[Original_info_Wr++]=  CurrentID; 
				break;
			case 2:                                                                                     // 视频
				MediaObj.Media_totalPacketNum	= Video_sdState.Total_packetNum;                        // 视频总包数
				MediaObj.Media_currentPacketNum = Video_sdState.SD_packetNum;                           // 视频当前报数
				MediaObj.Media_ID				= 1;                                                    //  多媒体ID
				MediaObj.Media_Channel			= 1;                                                    // 视频通道号
				break;
			case  3:                                                                                    //行车记录仪
				MediaObj.Media_totalPacketNum	= Recode_Obj.Total_pkt_num;                             // 记录仪总包数
				MediaObj.Media_currentPacketNum = Recode_Obj.Current_pkt_num;                           // 记录仪当前报数

				break;
			case  4:                                                                                    // 盲区补报
				MediaObj.Media_totalPacketNum	= BlindZone_sdState.Total_packetNum;                    // 盲区总包数
				MediaObj.Media_currentPacketNum = BlindZone_sdState.SD_packetNum;                       // 盲区当前报数

				break;
			default:
				return false;
		}

		Original_info[Original_info_Wr++]	= ( MediaObj.Media_totalPacketNum & 0xff00 ) >> 8;          //总block
		Original_info[Original_info_Wr++]	= (u8)MediaObj.Media_totalPacketNum;                        //总block

		Original_info[Original_info_Wr++]	= ( ( MediaObj.Media_currentPacketNum ) & 0xff00 ) >> 8;    //当前block
		Original_info[Original_info_Wr++]	= (u8)( ( MediaObj.Media_currentPacketNum ) & 0x00ff );     //当前block
	}
	return true;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void Protocol_End( u8 Packet_Type, u8 LinkNum )
{
	u16 packet_len	= 0;
	u16 i			= 0;    //要发送的UDP 数据内容的长度
	u8	Gfcs		= 0;
	u16 Msg_bodyLen = 0;    //  协议里的消息只表示消息体     不包含消息头 消息头默认长度是12 , 分包消息头长度 20

	Gfcs = 0;               //  计算从消息头开始到校验前数据的异或和  808协议校验  1Byte
	//---  填写信息长度 ---
	if( Packet_Normal == Packet_Type )
	{
		Msg_bodyLen			= Original_info_Wr - 12;
		Original_info[2]	= ( Msg_bodyLen >> 8 ); 
		Original_info[3]	= Msg_bodyLen;
	}else
	if( Packet_Divide == Packet_Type )
	{
		Msg_bodyLen = Original_info_Wr - 16;
		// rt_kprintf("\r\n Divide Infolen=%d  \r\n",Msg_bodyLen);
		Original_info[2]	= ( Msg_bodyLen >> 8 ) | 0x20; // Bit 13  0x20 就是Bit 13
		Original_info[3]	= Msg_bodyLen;
	}
	//---- 计算校验  -----
/*行车记录仪多包传输时，只在最后才加校验*/

	for( i = 0; i < Original_info_Wr; i++ )
	{
		Gfcs ^= Original_info[i];
	}
	Original_info[Original_info_Wr++] = Gfcs;   // 填写G校验位

