nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
	// 1.stuff start
	GPRS_infoWr_Tx				= 0;
	GPRS_info[GPRS_infoWr_Tx++] = 0x7e;         // Start 标识位
	if( Packet_Divide == Packet_Type )
	{
		//rt_kprintf("\r\n Tx=%d  Divide Infolen=%d  \r\n",GPRS_infoWr_Tx,Original_info_Wr);


		/* rt_kprintf("\r\n PacketContent: ");
		    for(i=0;i<Original_info_Wr;i++)
		                    rt_kprintf(" %X",Original_info[i]);
		    rt_kprintf("\r\n");
		 */
	}
	// 2.  convert
	packet_len		= Protocol_808_Encode( GPRS_info + GPRS_infoWr_Tx, Original_info, Original_info_Wr );
	GPRS_infoWr_Tx	+= packet_len;
	if( Packet_Divide == Packet_Type )
	{
		//rt_kprintf("\r\n Divide  Send Infolen=%d  \r\n",packet_len);


		/* rt_kprintf("\r\n EncodeContent: ");
		   for(i=0;i<packet_len;i++)
		                      rt_kprintf(" %X",GPRS_info[i+1]);
		   rt_kprintf("\r\n");
		 */
		//rt_kprintf("\r\n GPRStx  Send Infolen=%d  \r\n",GPRS_infoWr_Tx+1);
	}
	GPRS_info[GPRS_infoWr_Tx++] = 0x7e; //  End  标识
	//  4. Send

	// 4.1 发送信息内容1
	// 4.2   MsgQueue
	WatchDog_Feed( );

#ifdef BITTER
	rt_kprintf( "\r\n App to GSM info:" );
	for( i = 0; i < GPRS_infoWr_Tx; i++ )
	{
		rt_kprintf( " %02X", GPRS_info[i] );
	}
	rt_kprintf( "\r\n" );
#endif

	Gsm_rxAppData_SemRelease( GPRS_info, GPRS_infoWr_Tx, LinkNum );
	//--------消息序号 递增 --------
	JT808Conf_struct.Msg_Float_ID++;
	//------------------------------
}

u8  Stuff_BDSD_0200H(void)  
{
  u8 spd_sensorReg[2];
  u8  rd_infolen=0;
 //  1. Head  
   if(!Protocol_Head(MSG_0x0200,Packet_Normal)) 
 	  return false;  
 // 2. content 
 WatchDog_Feed();
 if( BDSD_ReadCycleGPS( BDSD.read,Original_info+Original_info_Wr, 128)==false)              
  {
     rt_kprintf("\r\n  读取 false\r\n "); 
    return false;
  }
 // 获取信息长度
 rd_infolen=Original_info[Original_info_Wr];
 //OutPrint_HEX("read -1",Original_info+Original_info_Wr,rd_infolen+1);
 memcpy(Original_info+Original_info_Wr,Original_info+Original_info_Wr+1,rd_infolen);
 //OutPrint_HEX("read -2",Original_info+Original_info_Wr,rd_infolen+1); 
 Original_info_Wr+=rd_infolen-1;   // 内容长度 剔除第一个长度字节 

 
 //  3. Send 
 Protocol_End(Packet_Normal ,0);
   	
 return true; 

}


//------------------------------------------------------------------------------------
u8  Stuff_MangQu_Packet_Send_0704H( void )
{
	u16 Qsize = 0;

	// 1. Head
	if( !Protocol_Head( MSG_0x0704, Packet_Normal ) )
	{
		return false;                           //定位数据批量上传
	}
	//  2.  Content
	//-----  判断填充-------
	//  2.1    数据项个数
	Original_info[Original_info_Wr++]	= 0x00; //  10000=0x2710
	Original_info[Original_info_Wr++]	= MQ_PKNUM;

	//  2.2    数据类型     1  盲区补报    0:   正常位置批量汇报
	Original_info[Original_info_Wr++] = 1;
	//  3.   数据包
	//  3.1   数据汇报体长度+ 内容

	// 3.2   数据内容

	MangQU_read( MangQU.PacketNum, Original_info + Original_info_Wr, Qsize );
	//  Original_info_Wr += Qsize;

	//   4 .  end
	Protocol_End( Packet_Normal, 0 );

	rt_kprintf( "\r\n	0704H  current=%d  total=%d  \r\n", MangQU.PacketNum, BLIND_NUM / MQ_PKNUM );
}


u8  Stuff_MangQu_Packet_Send_0704H_True( void )
{
    /*  Note:
                      读取存储时有可能存在读取校验不正确的可能，
                      这种情况下rd_error 要记录错误次数
                      同时填充的记录数也要递减
      */
    u8   Rd_error_Counter=0;  // 读取错误计数器
    u8   i=0;
	u8   rd_infolen=0;
	u8	 reg_128[128];  // 0704 寄存器
   
	u16 Qsize = 0;
    u32   Area_ID=0;

       //0 .  congifrm   batch  num
        if(cycle_read<cycle_write)
        {
            delta_0704_rd=cycle_write-cycle_read;
			// 判断偏差记录条数是否大于最大记录数
            if(delta_0704_rd>=MQ_PKNUM)
				 delta_0704_rd=MQ_PKNUM;   

        }
		else   // write 小于 read
		{	    
			delta_0704_rd=Max_CycleNum-cycle_read; 
		}

		 rt_kprintf("\r\n	 delat_0704=%d\r\n",delta_0704_rd); 

	// 1. Head
	 if(!Protocol_Head(MSG_0x0704,Packet_Normal)) 
		  return false; 
	  // 2. content   
	  //  2.1	 数据项个数
	  Original_info[Original_info_Wr++]   = 0x00; //  10000=0x2710
	  Original_info[Original_info_Wr++]   = delta_0704_rd;
	  
	  //  2.2	 数据类型	  1  盲区补报	 0:   正常位置批量汇报
	  Original_info[Original_info_Wr++] = 1;
      
	  rd_infolen=Original_info_Wr;
	  //	2.3  数据项目
		mangQu_read_reg=cycle_read;   //   存储当前的记录
		 for(i=0;i<delta_0704_rd;i++)
		 {
			//	 读取信息
		   memset(reg_128,0,sizeof(reg_128)); 
		   if( ReadCycleGPS(cycle_read,reg_128, 32)==false)	 // 实际内容只有28个字节
		   {  
			  Rd_error_Counter++;
			  continue; 
		   } 
		   cycle_read++; 
			//----------  子项信息长度 --------------------------		   
			Original_info[Original_info_Wr++]	= 0;
			Original_info[Original_info_Wr++]	= 40; // 28+ 附件信息长度
	
			memcpy(Original_info+Original_info_Wr,reg_128,28);
			Original_info_Wr+=28; 	// 内容长度 剔除第一个长度字节	

			//----------- 附加信息	------------
			//	附加信息 1	-----------------------------
			//	附加信息 ID
			Original_info[Original_info_Wr++] = 0x03;														// 行驶记录仪的速度
			//	附加信息长度
			Original_info[Original_info_Wr++] = 2;
			//	类型
			Original_info[Original_info_Wr++]	= (u8)( Speed_cacu >> 8 );
			Original_info[Original_info_Wr++]	= (u8)( Speed_cacu );


		//  附加信息 ID
		Original_info[Original_info_Wr++] = 0x12; //  进出区域/路线报警
		//  附加信息长度
		Original_info[Original_info_Wr++] = 6;
		//  类型
		Area_ID=1;
		Original_info[Original_info_Wr++]	= 2; //矩形围栏
		Original_info[Original_info_Wr++]	= ( Area_ID >> 24 );
		Original_info[Original_info_Wr++]	= (Area_ID>> 16 );
		Original_info[Original_info_Wr++]	= ( Area_ID>> 8 );
		Original_info[Original_info_Wr++]	= Area_ID;
		Original_info[Original_info_Wr++]	= 0;  // 进围栏


			
			//OutPrint_HEX("read -1"reg_128,rd_infolen+1);
			
			//OutPrint_HEX("read -2",reg_128+1,rd_infolen); 
	//==================================================	
		}
		// rt_kprintf("\r\n   rd_infolen=%d   delta=%d\r\n",rd_infolen,Original_info_Wr-rd_infolen); 

	//   3 .  end
	Protocol_End( Packet_Normal, 0 );

    
	if(DispContent)
			rt_kprintf("\r\n  定位数据批量上传	delta=%d   read=%d  write=%d current=%d  ConstTotal=%d   CurrentTotal=%d\r\n",delta_0704_rd,cycle_read,cycle_write,MQ_TrueUse.PacketNum, Mq_total_pkg,CurrentTotal);  
	if(MQ_TrueUse.PacketNum==Mq_total_pkg)
		    rt_kprintf("\r\n  盲区True存储部分已经完成\r\n");
	if(cycle_read==cycle_write) 
		{ 
           MQ_TrueUse.PacketNum=0;
		   MQ_TrueUse.Enable_SD_state=0; 
		   // 每次应答存储相关记录数目
		   DF_Write_RecordAdd(cycle_write,cycle_read,TYPE_CycleAdd);  
		   rt_kprintf("\r\nTrue Return Normal_place2\r\n");
		}

