nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
}

//--------------------------------------------------------------------------------------
u8  Stuff_DevCommmonACK_0001H( void )
{
	// 1. Head
	if( !Protocol_Head( MSG_0x0001, Packet_Normal ) )
	{
		return false; //终端通用应答
	}
	// 2. content  is null
	//   float ID
	Original_info[Original_info_Wr++]	= (u8)( Centre_FloatID >> 8 );
	Original_info[Original_info_Wr++]	= (u8)Centre_FloatID;
	//  cmd  ID
	Original_info[Original_info_Wr++]	= (u8)( Centre_CmdID >> 8 );
	Original_info[Original_info_Wr++]	= (u8)Centre_CmdID;
	//   resualt
	Original_info[Original_info_Wr++] = SD_ACKflag.f_CentreCMDack_resualt;
	//  3. Send
	Protocol_End( Packet_Normal, 0 );
	if( DispContent )
	{
		rt_kprintf( "\r\n	Common CMD ACK! \r\n");
	}
	return true;
}

//-------------------------------------------------------------------------
u8  Stuff_RegisterPacket_0100H( u8 LinkNum )
{
	u8 i = 0;
// 1. Head
	if( !Protocol_Head( MSG_0x0100, Packet_Normal ) )
	{
		return false;
	}

	// 2. content
	//  province ID
	//  Original_info[Original_info_Wr++]=(u8)(JT808Conf_struct.Vechicle_Info.Dev_ProvinceID>>8);
	// Original_info[Original_info_Wr++]=(u8)JT808Conf_struct.Vechicle_Info.Dev_ProvinceID;
	Original_info[Original_info_Wr++]	= 0x00;
	Original_info[Original_info_Wr++]	= 12;               // 天津市
	//  county  ID
	// Original_info[Original_info_Wr++]=(u8)(JT808Conf_struct.Vechicle_Info.Dev_CityID>>8);
	//Original_info[Original_info_Wr++]=(u8)JT808Conf_struct.Vechicle_Info.Dev_CityID;
	Original_info[Original_info_Wr++]	= 0x00;
	Original_info[Original_info_Wr++]	= 107;              // 塘沽区
	//  厂商ID
	memcpy( Original_info + Original_info_Wr, "70420", 5 ); //TW705
	Original_info_Wr += 5;
	//  终端型号 20 Bytes      -- 补充协议里做更改
	//memcpy(Original_info+Original_info_Wr,"Tianjin TCB TW701-BD",20);
	// Original_info_Wr+=20;
	memcpy( Original_info + Original_info_Wr, "TW705", 5 ); //  正式  ----
	// memcpy(Original_info+Original_info_Wr,"SW703",5);      // 调试
	Original_info_Wr += 5;
	for( i = 0; i < 15; i++ )
	{
		Original_info[Original_info_Wr++] = 0x00;
	}

	//  终端ID   7 Bytes    ,
	memcpy( Original_info + Original_info_Wr, IMSI_CODE + 8, 7 );                   //000013601300001
	Original_info_Wr += 7;
	//   Original_info_Wr+=3;
	// Original_info[Original_info_Wr++]='0';
	// memcpy(Original_info+Original_info_Wr,IMSI_CODE+12,3);
	// Original_info_Wr+=3;
	//  车牌颜色
	Original_info[Original_info_Wr++] = JT808Conf_struct.Vechicle_Info.Dev_Color;   // 车辆颜色
	//  车牌
	/*
	memcpy( Original_info + Original_info_Wr, "TST000", 6 ); 
	Original_info_Wr					+= 6;
	Original_info[Original_info_Wr++]	= IMSI_CODE[14];
	Original_info[Original_info_Wr++]	= 0;
	Original_info[Original_info_Wr++]	= 0;
	Original_info[Original_info_Wr++]	= 0;
	Original_info[Original_info_Wr++]	= 0;
	Original_info[Original_info_Wr++]	= 0;
	Original_info[Original_info_Wr++]	= 0;
	*/
	memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Vechicle_Info.Vech_Num,8);
	Original_info_Wr+=8;

	//  3. Send
	Protocol_End( Packet_Normal, LinkNum );
	if( DispContent )
	{
		rt_kprintf( "\r\n	SEND Reigster Packet! \r\n");
	}
	return true;
}

//--------------------------------------------------------------------------------------
u8  Stuff_DeviceHeartPacket_0002H( void )
{
	// 1. Head
	if( !Protocol_Head( MSG_0x0002, Packet_Normal ) )
	{
		return false;
	}
	// 2. content  is null

	//  3. Send
	Protocol_End( Packet_Normal, 0 );
	if( DispContent )
	{
		rt_kprintf( "\r\n	Send Dev Heart! \r\n");
	}
	return true;
}

//--------------------------------------------------------------------------------------
u8  Stuff_DeviceDeregister_0101H( void )
{
	// 1. Head
	if( !Protocol_Head( MSG_0x0003, Packet_Normal ) )
	{
		return false; //终端注销
	}
	// 2. content  is null
	//  3. Send
	Protocol_End( Packet_Normal, 0 );
	if( DispContent )
	{
		rt_kprintf( "\r\n	Deregister  注销! \r\n");
	}
	return true;
}

//------------------------------------------------------------------------------------
u8  Stuff_DevLogin_0102H( void )
{
	// 1. Head
	if( !Protocol_Head( MSG_0x0102, Packet_Normal ) )
	{
		return false;                                                                                                               //终端鉴权
	}
	// 2. content

	memcpy( Original_info + Original_info_Wr, JT808Conf_struct.ConfirmCode, strlen( (const char*)JT808Conf_struct.ConfirmCode ) );  // 鉴权码  string Type
	Original_info_Wr += strlen( (const char*)JT808Conf_struct.ConfirmCode );
	//  3. Send
	Protocol_End( Packet_Normal, 0 );
	if( DispContent )
	{
		rt_kprintf( "\r\n	 发送鉴权! \r\n");
	}
	return true;
}

//--------------------------------------------------------------------------------------
u8  Stuff_Normal_Data_0200H( u16 InNUM )
{
	u8	status = 0, U8_STUFF = 0;
	u8	spd_sensorReg[2];
	u32 Dis_01km = 0;
	// ---- add  new  --------
	u8	lati[4], longi[4];
	u32 lati_stuff	= 0, longi_stuff = 0;
	u16 spd_stuff	= 0;
	u8	time_stuff[2];

	//  1. Head
	if( !Protocol_Head( MSG_0x0200, Packet_Normal ) )
	{
		return false;
	}
	// 2. content
	//------------------------------- Stuff ----------------------------------------
	// 1. 告警标志  4
	memcpy( ( char* )Original_info + Original_info_Wr, ( char* )Warn_Status, 4 );
	Original_info_Wr += 4;
	// 2. 状态  4
	memcpy( ( char* )Original_info + Original_info_Wr, ( char* )Car_Status, 4 );
	Original_info_Wr += 4;
	// 3.	纬度
	lati_stuff	= Latiude_hex[InNUM] - ( CSQ_counter % 7 ) + ( TIM1_Timer_Counter % 2 );    // need change  a  little
	lati[0]		= ( u8 )( lati_stuff >> 24 );
	lati[1]		= ( u8 )( lati_stuff >> 16 );
	lati[2]		= ( u8 )( lati_stuff >> 8 );
	lati[3]		= ( u8 )lati_stuff;
	memcpy( ( char* )Original_info + Original_info_Wr, ( char* )lati, 4 );                  //纬度	modify by nathan
	Original_info_Wr += 4;
	// 4.	经度

	longi_stuff = 116 * 1000000 - ( CSQ_counter % 8 ) + ( TIM1_Timer_Counter % 3 );
	longi[0]	= ( u8 )( longi_stuff >> 24 );
	longi[1]	= ( u8 )( longi_stuff >> 16 );
	longi[2]	= ( u8 )( longi_stuff >> 8 );
	longi[3]	= ( u8 )longi_stuff;
	memcpy( ( char* )Original_info + Original_info_Wr, ( char* )longi, 4 ); //经度	 东经  Bit 7->0   西经 Bit 7 -> 1
	Original_info_Wr += 4;
	// 5.	高程
	GPS_Hight							= 50 + ( CSQ_counter % 5 ) - ( Satelite_num % 4 );
	Original_info[Original_info_Wr++]	= (u8)( GPS_Hight << 8 );
	Original_info[Original_info_Wr++]	= (u8)GPS_Hight;
	// 6.	速度	0.1 Km/h
	if( spd_dex[InNUM] > 11 )
	{
		spd_stuff = spd_dex[InNUM] - ( CSQ_counter % 10 ) + ( TIM1_Timer_Counter % 3 ); // need change  a  little  76
	}else
	{
		spd_stuff = spd_dex[InNUM];
	}
	Original_info[Original_info_Wr++]	= (u8)( spd_stuff >> 8 );                       //(GPS_speed>>8);
	Original_info[Original_info_Wr++]	= (u8)( spd_stuff );                            //GPS_speed;
	// 7. 方向   单位 1度
	Original_info[Original_info_Wr++]	= ( GPS_direction >> 8 );                       //High
	Original_info[Original_info_Wr++]	= GPS_direction;                                // Low
	// 8.	日期时间
	Original_info[Original_info_Wr++]	= 0x13;                                         //(((Gps_Gprs.Date[0])/10)<<4)+((Gps_Gprs.Date[0])%10);
	Original_info[Original_info_Wr++]	= 0x03;                                         //((Gps_Gprs.Date[1]/10)<<4)+(Gps_Gprs.Date[1]%10);
	Original_info[Original_info_Wr++]	= 0x05;                                         // ((Gps_Gprs.Date[2]/10)<<4)+(Gps_Gprs.Date[2]%10);
	Original_info[Original_info_Wr++]	= 0x18;                                         //((Gps_Gprs.Time[0]/10)<<4)+(Gps_Gprs.Time[0]%10);
	time_stuff[0]						= 12 + ( 30 + InNUM ) / 60;
	Original_info[Original_info_Wr++]	= ( ( time_stuff[0] / 10 ) << 4 ) + ( time_stuff[0] % 10 );
	time_stuff[1]						= ( 30 + InNUM ) % 60;
	Original_info[Original_info_Wr++]	= ( ( time_stuff[1] / 10 ) << 4 ) + ( time_stuff[1] % 10 );

	//----------- 附加信息  ------------
	//  附加信息 1  -----------------------------
	//	附加信息 ID
	Original_info[Original_info_Wr++] = 0x03; // 行驶记录仪的速度
	//	附加信息长度
	Original_info[Original_info_Wr++] = 2;
	//	类型
	Original_info[Original_info_Wr++]	= (u8)( Speed_cacu >> 8 );
	Original_info[Original_info_Wr++]	= (u8)( Speed_cacu );
	//rt_kprintf("\r\n GPS速度=%d km/h , 传感器速度=%d km/h\r\n",Speed_gps,Speed_cacu);
	//  附加信息 2  -----------------------------
	//  附加信息 ID
	Original_info[Original_info_Wr++] = 0x01; // 车上的行驶里程
	//  附加信息长度
	Original_info[Original_info_Wr++] = 4;
	//  类型
	Dis_01km							= JT808Conf_struct.Distance_m_u32 / 100;
	Original_info[Original_info_Wr++]	= ( Dis_01km >> 24 );
	Original_info[Original_info_Wr++]	= ( Dis_01km >> 16 );
	Original_info[Original_info_Wr++]	= ( Dis_01km >> 8 );
	Original_info[Original_info_Wr++]	= Dis_01km;

