nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
	return true;
}

//------------------------------------------------------------------------------------
u8  Stuff_Current_Data_0200H( void )   //  发送即时数据不存储到存储器中
{
	u8	status		= 0, U8_STUFF = 0;
	u32 Dis_01km	= 0;

	if( GPS_speed <= ( JT808Conf_struct.Speed_warn_MAX * 10 ) )
	{
		StatusReg_SPD_NORMAL( );
	}

	//  1. Head
	if( !Protocol_Head( MSG_0x0200, Packet_Normal ) )
	{
		return false;
	}
	// 2. content
	//------------------------------- Stuff ----------------------------------------
	// 1. 告警标志  4
	memcpy( ( char* )Original_info + Original_info_Wr, ( char* )Warn_Status, 4 );
	Original_info_Wr += 4;
	// 2. 状态  4
	memcpy( ( char* )Original_info + Original_info_Wr, ( char* )Car_Status, 4 );
	Original_info_Wr += 4;
	// 3.  纬度
	memcpy( ( char* )Original_info + Original_info_Wr, ( char* )Gps_Gprs.Latitude, 4 );     //纬度   modify by nathan
	Original_info_Wr += 4;
	// 4.  经度
	memcpy( ( char* )Original_info + Original_info_Wr, ( char* )Gps_Gprs.Longitude, 4 );    //经度    东经  Bit 7->0   西经 Bit 7 -> 1
	Original_info_Wr += 4;
	// 5.  高程
	Original_info[Original_info_Wr++]	= (u8)( GPS_Hight << 8 );
	Original_info[Original_info_Wr++]	= (u8)GPS_Hight;
	// 6.  速度    0.1 Km/h
	Original_info[Original_info_Wr++]	= (u8)( Speed_gps >> 8 );                           //(GPS_speed>>8);
	Original_info[Original_info_Wr++]	= (u8)( Speed_gps );                                //GPS_speed;
	// 7. 方向   单位 1度
	Original_info[Original_info_Wr++]	= ( GPS_direction >> 8 );                           //High
	Original_info[Original_info_Wr++]	= GPS_direction;                                    // Low
	// 8.  日期时间
	Original_info[Original_info_Wr++]	= ( ( ( Gps_Gprs.Date[0] ) / 10 ) << 4 ) + ( ( Gps_Gprs.Date[0] ) % 10 );
	Original_info[Original_info_Wr++]	= ( ( Gps_Gprs.Date[1] / 10 ) << 4 ) + ( Gps_Gprs.Date[1] % 10 );
	Original_info[Original_info_Wr++]	= ( ( Gps_Gprs.Date[2] / 10 ) << 4 ) + ( Gps_Gprs.Date[2] % 10 );
	Original_info[Original_info_Wr++]	= ( ( Gps_Gprs.Time[0] / 10 ) << 4 ) + ( Gps_Gprs.Time[0] % 10 );
	Original_info[Original_info_Wr++]	= ( ( Gps_Gprs.Time[1] / 10 ) << 4 ) + ( Gps_Gprs.Time[1] % 10 );
	Original_info[Original_info_Wr++]	= ( ( Gps_Gprs.Time[2] / 10 ) << 4 ) + ( Gps_Gprs.Time[2] % 10 );

	//----------- 附加信息  ------------
	//  附加信息 1  -----------------------------
	//	附加信息 ID
	Original_info[Original_info_Wr++] = 0x03; // 行驶记录仪的速度
	//	附加信息长度
	Original_info[Original_info_Wr++] = 2;
	//	类型
	Original_info[Original_info_Wr++]	= (u8)( Speed_cacu >> 8 );
	Original_info[Original_info_Wr++]	= (u8)( Speed_cacu );
	//rt_kprintf("\r\n GPS速度=%d km/h , 传感器速度=%d km/h\r\n",Speed_gps,Speed_cacu);
	//  附加信息 2  -----------------------------
	//  附加信息 ID
	Original_info[Original_info_Wr++] = 0x01; // 车上的行驶里程
	//  附加信息长度
	Original_info[Original_info_Wr++] = 4;
	//  类型
	Dis_01km							= JT808Conf_struct.Distance_m_u32 / 100;
	Original_info[Original_info_Wr++]	= ( Dis_01km >> 24 );
	Original_info[Original_info_Wr++]	= ( Dis_01km >> 16 );
	Original_info[Original_info_Wr++]	= ( Dis_01km >> 8 );
	Original_info[Original_info_Wr++]	= Dis_01km;

	//  附加信息 3
	if( Warn_Status[1] & 0x10 )
	{
		//  附加信息 ID
		Original_info[Original_info_Wr++] = 0x12; //  进出区域/路线报警
		//  附加信息长度
		Original_info[Original_info_Wr++] = 6;
		//  类型
		Original_info[Original_info_Wr++]	= InOut_Object.TYPE;
		Original_info[Original_info_Wr++]	= ( InOut_Object.ID >> 24 );
		Original_info[Original_info_Wr++]	= ( InOut_Object.ID >> 16 );
		Original_info[Original_info_Wr++]	= ( InOut_Object.ID >> 8 );
		Original_info[Original_info_Wr++]	= InOut_Object.ID;
		Original_info[Original_info_Wr++]	= InOut_Object.InOutState;
		rt_kprintf( "\r\n ----- 0x0200 current 附加信息 \r\n" );
	}

	if( Warn_Status[1] & 0x80 )                     // 出 路线报警
	{
		//  附加信息 ID
		Original_info[Original_info_Wr++] = 0x12;   //  进出区域/路线报警
		//  附加信息长度
		Original_info[Original_info_Wr++] = 6;
		//  类型
		InOut_Object.ID						= 100;  // 下的是100
		Original_info[Original_info_Wr++]	= 4;
		Original_info[Original_info_Wr++]	= ( InOut_Object.ID >> 24 );
		Original_info[Original_info_Wr++]	= ( InOut_Object.ID >> 16 );
		Original_info[Original_info_Wr++]	= ( InOut_Object.ID >> 8 );
		Original_info[Original_info_Wr++]	= InOut_Object.ID;
		Original_info[Original_info_Wr++]	= 1;
		rt_kprintf( "\r\n ----- 0x0200 线路报警 附加信息 \r\n" );
	}

	//  附件信息4
	if( Warn_Status[3] & 0x02 )
	{
		//  附加信息 ID
		Original_info[Original_info_Wr++] = 0x11;                   //  进出区域/路线报警
		//  附加信息长度
		Original_info[Original_info_Wr++] = 1;
		//  类型
		Original_info[Original_info_Wr++] = 0;                      //  无特定位置
	}
	// 5. 附加信息
	Original_info[Original_info_Wr++]	= 0x25;                     //ID  扩展车辆信号状态位
	Original_info[Original_info_Wr++]	= 4;                        //LEN
	Original_info[Original_info_Wr++]	= 0x00;
	Original_info[Original_info_Wr++]	= 0x00;
	Original_info[Original_info_Wr++]	= 0x00;
	Original_info[Original_info_Wr++]	= BD_EXT.Extent_IO_status;
	//6. 附加信息  :
	if( SleepState == 1 )                                           //休眠
	{
		Original_info[Original_info_Wr++]	= 0x2A;                 //ID   IO状态位【1】   bit0:深度休眠   bit1:休眠【0】保留
		Original_info[Original_info_Wr++]	= 2;                    //LEN
		Original_info[Original_info_Wr++]	= 0x02;
		Original_info[Original_info_Wr++]	= 0;
	}
	//  附加信息 7  -----------------------------
	//  附加信息 ID
	Original_info[Original_info_Wr++] = 0x2B;                       //模拟量
	//  附加信息长度
	Original_info[Original_info_Wr++] = 4;
	//  类型
	Original_info[Original_info_Wr++]	= ( AD_2through[1] >> 8 );  // AD1
	Original_info[Original_info_Wr++]	= AD_2through[1];
	Original_info[Original_info_Wr++]	= ( AD_2through[0] >> 8 );  // AD0
	Original_info[Original_info_Wr++]	= AD_2through[0];
	//  附加信息 8  -----------------------------
	//  附加信息 ID
	Original_info[Original_info_Wr++] = 0x30;                       //无线通信网络信号强度
	//  附加信息长度
	Original_info[Original_info_Wr++] = 1;
	//  类型
	Original_info[Original_info_Wr++] = ModuleSQ;

	//  附加信号 9  ---------------------------------
	Original_info[Original_info_Wr++]	= 0x31;                     // GNSS 定位卫星颗数
	Original_info[Original_info_Wr++]	= 1;                        // len
	Original_info[Original_info_Wr++]	= Satelite_num;

	//  3. Send
	Protocol_End( Packet_Normal, 0 );
	return true;
}

//-----------------------------------------------------------------------
u8  Stuff_Current_Data_0201H( void )   //   位置信息查询回应
{
	u8	status		= 0, U8_STUFF = 0;
	u32 Dis_01km	= 0;
	//  1. Head
	if( !Protocol_Head( MSG_0x0201, Packet_Normal ) )
	{
		return false;
	}
	// 2. content
	//------------------------------- Stuff ----------------------------------------
	//   float ID                                                // 对应中心应答消息的流水号
	Original_info[Original_info_Wr++]	= (u8)( Centre_FloatID >> 8 );
	Original_info[Original_info_Wr++]	= (u8)Centre_FloatID;

	// 1. 告警标志  4
	memcpy( ( char* )Original_info + Original_info_Wr, ( char* )Warn_Status, 4 );
	Original_info_Wr += 4;
	// 2. 状态  4
	memcpy( ( char* )Original_info + Original_info_Wr, ( char* )Car_Status, 4 );
	Original_info_Wr += 4;
	// 3.  纬度
	memcpy( ( char* )Original_info + Original_info_Wr, ( char* )Gps_Gprs.Latitude, 4 );     //纬度   modify by nathan
	Original_info_Wr += 4;
	// 4.  经度
	memcpy( ( char* )Original_info + Original_info_Wr, ( char* )Gps_Gprs.Longitude, 4 );    //经度    东经  Bit 7->0   西经 Bit 7 -> 1
	Original_info_Wr += 4;
	// 5.  高程
	Original_info[Original_info_Wr++]	= (u8)( GPS_Hight << 8 );
	Original_info[Original_info_Wr++]	= (u8)GPS_Hight;
	// 6.  速度    0.1 Km/h
	Original_info[Original_info_Wr++]	= (u8)( Speed_gps >> 8 );
	Original_info[Original_info_Wr++]	= (u8)Speed_gps;
	// 7. 方向   单位 1度
	Original_info[Original_info_Wr++]	= ( GPS_direction >> 8 );   //High
	Original_info[Original_info_Wr++]	= GPS_direction;            // Low
	// 8.  日期时间
	Original_info[Original_info_Wr++]	= ( ( ( Gps_Gprs.Date[0] ) / 10 ) << 4 ) + ( ( Gps_Gprs.Date[0] ) % 10 );
	Original_info[Original_info_Wr++]	= ( ( Gps_Gprs.Date[1] / 10 ) << 4 ) + ( Gps_Gprs.Date[1] % 10 );
	Original_info[Original_info_Wr++]	= ( ( Gps_Gprs.Date[2] / 10 ) << 4 ) + ( Gps_Gprs.Date[2] % 10 );
	Original_info[Original_info_Wr++]	= ( ( Gps_Gprs.Time[0] / 10 ) << 4 ) + ( Gps_Gprs.Time[0] % 10 );
	Original_info[Original_info_Wr++]	= ( ( Gps_Gprs.Time[1] / 10 ) << 4 ) + ( Gps_Gprs.Time[1] % 10 );
	Original_info[Original_info_Wr++]	= ( ( Gps_Gprs.Time[2] / 10 ) << 4 ) + ( Gps_Gprs.Time[2] % 10 );

	//----------- 附加信息  ------------
	//  附加信息 1  -----------------------------
	//	附加信息 ID
	Original_info[Original_info_Wr++] = 0x03; // 行驶记录仪的速度
	//	附加信息长度
	Original_info[Original_info_Wr++] = 2;
	//	类型
	Original_info[Original_info_Wr++]	= (u8)( Speed_cacu >> 8 );
	Original_info[Original_info_Wr++]	= (u8)( Speed_cacu );
	//rt_kprintf("\r\n GPS速度=%d km/h , 传感器速度=%d km/h\r\n",Speed_gps,Speed_cacu);
	//  附加信息 2  -----------------------------
	//  附加信息 ID
	Original_info[Original_info_Wr++] = 0x01; // 车上的行驶里程
	//  附加信息长度
	Original_info[Original_info_Wr++] = 4;
	//  类型
	Dis_01km							= JT808Conf_struct.Distance_m_u32 / 100;
	Original_info[Original_info_Wr++]	= ( Dis_01km >> 24 );
	Original_info[Original_info_Wr++]	= ( Dis_01km >> 16 );
	Original_info[Original_info_Wr++]	= ( Dis_01km >> 8 );
	Original_info[Original_info_Wr++]	= Dis_01km;

