nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
	//  附加信息 3
	if( Warn_Status[1] & 0x10 )
	{
		//  附加信息 ID
		Original_info[Original_info_Wr++] = 0x12; //  进出区域/路线报警
		//  附加信息长度
		Original_info[Original_info_Wr++] = 6;
		//  类型
		Original_info[Original_info_Wr++]	= InOut_Object.TYPE;
		Original_info[Original_info_Wr++]	= ( InOut_Object.ID >> 24 );
		Original_info[Original_info_Wr++]	= ( InOut_Object.ID >> 16 );
		Original_info[Original_info_Wr++]	= ( InOut_Object.ID >> 8 );
		Original_info[Original_info_Wr++]	= InOut_Object.ID;
		Original_info[Original_info_Wr++]	= InOut_Object.InOutState;
		rt_kprintf( "\r\n ----- 0x0200 current 附加信息 \r\n" );
	}

	//  附件信息4
	if( Warn_Status[3] & 0x02 )
	{
		//  附加信息 ID
		Original_info[Original_info_Wr++] = 0x11;                   //  进出区域/路线报警
		//  附加信息长度
		Original_info[Original_info_Wr++] = 1;
		//  类型
		Original_info[Original_info_Wr++] = 0;                      //  无特定位置
	}
	// 5. 附加信息       扩展车辆信号线
	Original_info[Original_info_Wr++]	= 0x25;                     //ID  扩展车辆信号状态位
	Original_info[Original_info_Wr++]	= 4;                        //LEN
	Original_info[Original_info_Wr++]	= 0x00;
	Original_info[Original_info_Wr++]	= 0x00;
	Original_info[Original_info_Wr++]	= 0x00;
	Original_info[Original_info_Wr++]	= BD_EXT.Extent_IO_status;
	//6. 附加信息  :
	if( SleepState == 1 )                                           //休眠
	{
		Original_info[Original_info_Wr++]	= 0x2A;                 //ID   IO状态位【1】   bit0:深度休眠   bit1:休眠【0】保留
		Original_info[Original_info_Wr++]	= 2;                    //LEN
		Original_info[Original_info_Wr++]	= 0x02;
		Original_info[Original_info_Wr++]	= 0;
	}
	//  附加信息 7  -----------------------------
	//  附加信息 ID
	Original_info[Original_info_Wr++] = 0x2B;                       //模拟量
	//  附加信息长度
	Original_info[Original_info_Wr++] = 4;
	//  类型
	Original_info[Original_info_Wr++]	= ( AD_2through[1] >> 8 );  // AD1
	Original_info[Original_info_Wr++]	= AD_2through[1];
	Original_info[Original_info_Wr++]	= ( AD_2through[0] >> 8 );  // AD0
	Original_info[Original_info_Wr++]	= AD_2through[0];
	//  附加信息 8  -----------------------------
	//  附加信息 ID
	Original_info[Original_info_Wr++] = 0x30;                       //无线通信网络信号强度
	//  附加信息长度
	Original_info[Original_info_Wr++] = 1;
	//  类型
	Original_info[Original_info_Wr++] = ModuleSQ;

	//  附加信号 9  ---------------------------------
	Original_info[Original_info_Wr++]	= 0x31;                     // GNSS 定位卫星颗数
	Original_info[Original_info_Wr++]	= 1;                        // len
	Original_info[Original_info_Wr++]	= Satelite_num;

	//  3. Send
	Protocol_End( Packet_Normal, 0 );
	if( DispContent )
	{
		rt_kprintf( "\r\n	SEND GPS CMD=81H ! \r\n");
	}

	return true;
}

//-----------------------------------------------------------------------
u8  Sub_stuff_AppointedPram_0104( void )
{
	//   参数个数
	Original_info[Original_info_Wr++] = Setting_Qry.Num_pram;
	//   参数列表
}

//-----------------------------------------------------------------------
u8  Stuff_SettingPram_0104H( u8 in )
{
	u8 reg_str[30];

	//  1. Head
	if( !Protocol_Head( MSG_0x0104, Packet_Normal ) )
	{
		return false; // 终端参数上传
	}
	//  2. content
	//   float ID
	Original_info[Original_info_Wr++]	= (u8)( Centre_FloatID >> 8 );
	Original_info[Original_info_Wr++]	= (u8)Centre_FloatID;
//if(in==1)
	{
		//   参数个数
		Original_info[Original_info_Wr++] = 4;
		//   参数列表

		//   2.1   车牌号


		/* Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
		   Original_info[Original_info_Wr++]=0x00;
		   Original_info[Original_info_Wr++]=0x00;
		   Original_info[Original_info_Wr++]=0x83;
		   Original_info[Original_info_Wr++]=strlen((const char*)JT808Conf_struct.Vechicle_Info.Vech_Num); // 参数长度
		   memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )JT808Conf_struct.Vechicle_Info.Vech_Num,strlen((const char*)JT808Conf_struct.Vechicle_Info.Vech_Num) ); // 参数值
		   Original_info_Wr+=strlen((const char*)JT808Conf_struct.Vechicle_Info.Vech_Num);
		 */
		//   2.2  主服务器IP
		Original_info[Original_info_Wr++]	= 0x00; // 参数ID 4Bytes
		Original_info[Original_info_Wr++]	= 0x00;
		Original_info[Original_info_Wr++]	= 0x00;
		Original_info[Original_info_Wr++]	= 0x13;
		// 参数长度
		memset( reg_str, 0, sizeof( reg_str ) );
		IP_Str( (char*)reg_str, *( u32* )RemoteIP_aux );
		Original_info[Original_info_Wr++] = strlen( (const char*)reg_str );
		memcpy( ( char* )Original_info + Original_info_Wr, ( char* )reg_str, strlen( (const char*)reg_str ) );          // 参数值
		Original_info_Wr += strlen( (const char*)reg_str );

		//   2.3   主服务TCP端口
		Original_info[Original_info_Wr++]	= 0x00;                                                                     // 参数ID 4Bytes
		Original_info[Original_info_Wr++]	= 0x00;
		Original_info[Original_info_Wr++]	= 0x00;
		Original_info[Original_info_Wr++]	= 0x18;
		Original_info[Original_info_Wr++]	= 4;                                                                        // 参数长度
		Original_info[Original_info_Wr++]	= 0x00;                                                                     // 参数值
		Original_info[Original_info_Wr++]	= 0x00;
		Original_info[Original_info_Wr++]	= ( RemotePort_main >> 8 );
		Original_info[Original_info_Wr++]	= RemotePort_main;

		//   2.4  APN 字符串
		Original_info[Original_info_Wr++]	= 0x00;                                                                     // 参数ID 4Bytes
		Original_info[Original_info_Wr++]	= 0x00;
		Original_info[Original_info_Wr++]	= 0x00;
		Original_info[Original_info_Wr++]	= 0x10;
		Original_info[Original_info_Wr++]	= strlen( (const char*)APN_String );                                        // 参数长度
		memcpy( ( char* )Original_info + Original_info_Wr, ( char* )APN_String, strlen( (const char*)APN_String ) );    // 参数值
		Original_info_Wr += strlen( (const char*)APN_String );

		//  2.5   备用IP
		Original_info[Original_info_Wr++]	= 0x00;                                                                     // 参数ID 4Bytes
		Original_info[Original_info_Wr++]	= 0x00;
		Original_info[Original_info_Wr++]	= 0x00;
		Original_info[Original_info_Wr++]	= 0x17;
		// 参数长度
		memset( reg_str, 0, sizeof( reg_str ) );
		IP_Str( (char*)reg_str, *( u32* )RemoteIP_aux );
		Original_info[Original_info_Wr++] = strlen( (const char*)reg_str );
		memcpy( ( char* )Original_info + Original_info_Wr, ( char* )reg_str, strlen( (const char*)reg_str ) ); // 参数值
		Original_info_Wr += strlen( (const char*)reg_str );


