nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
		/*
		   //   2.4   缺省时间上报间隔
		   Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
		   Original_info[Original_info_Wr++]=0x00;
		   Original_info[Original_info_Wr++]=0x00;
		   Original_info[Original_info_Wr++]=0x29;
		   Original_info[Original_info_Wr++]=4  ; // 参数长度
		   Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Default_Dur>>24);   // 参数值
		   Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Default_Dur>>16);
		   Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Default_Dur>>8);
		   Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Default_Dur);

		   //   2.5   中心监控号码
		   Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
		   Original_info[Original_info_Wr++]=0x00;
		   Original_info[Original_info_Wr++]=0x00;
		   Original_info[Original_info_Wr++]=0x40;
		   Original_info[Original_info_Wr++]=strlen((const char*)JT808Conf_struct.LISTEN_Num); // 参数长度
		   memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )JT808Conf_struct.LISTEN_Num,strlen((const char*)JT808Conf_struct.LISTEN_Num)); // 参数值
		   Original_info_Wr+=strlen((const char*)JT808Conf_struct.LISTEN_Num);
		   //   2.6   最大速度门限
		   Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
		   Original_info[Original_info_Wr++]=0x00;
		   Original_info[Original_info_Wr++]=0x00;
		   Original_info[Original_info_Wr++]=0x55;
		   Original_info[Original_info_Wr++]=4  ; // 参数长度
		   Original_info[Original_info_Wr++]=( JT808Conf_struct.Speed_warn_MAX>>24);   // 参数值
		   Original_info[Original_info_Wr++]=( JT808Conf_struct.Speed_warn_MAX>>16);
		   Original_info[Original_info_Wr++]=( JT808Conf_struct.Speed_warn_MAX>>8);
		   Original_info[Original_info_Wr++]=( JT808Conf_struct.Speed_warn_MAX);
		   //   2.7   连续驾驶门限
		   Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
		   Original_info[Original_info_Wr++]=0x00;
		   Original_info[Original_info_Wr++]=0x00;
		   Original_info[Original_info_Wr++]=0x57;
		   Original_info[Original_info_Wr++]=4  ; // 参数长度
		   Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_DrvKeepingSec>>24);   // 参数值
		   Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_DrvKeepingSec>>16);
		   Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_DrvKeepingSec>>8);
		   Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_DrvKeepingSec);
		   //   2.8   最小休息时间
		   Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
		   Original_info[Original_info_Wr++]=0x00;
		   Original_info[Original_info_Wr++]=0x00;
		   Original_info[Original_info_Wr++]=0x59;
		   Original_info[Original_info_Wr++]=4  ; // 参数长度
		   Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MinSleepSec>>24);	 // 参数值
		   Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MinSleepSec>>16);
		   Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MinSleepSec>>8);
		   Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MinSleepSec);
		 */
	}


/*else
   if(in==2)
   {
   Sub_stuff_AppointedPram_0104();
   }*/
	//  3. Send
	Protocol_End( Packet_Normal, 0 );
	if( DispContent )
	{
		rt_kprintf( "\r\n	发送参数查询信息! \r\n");
	}

	return true;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u8  Stuff_DeviceAttribute_BD_0107H( void )
{
	u16 infoLen = 0;
	// 1. Head
	if( !Protocol_Head( MSG_0x0107, Packet_Normal ) )
	{
		return false;
	}
	// 2. content
	Original_info[Original_info_Wr++] = ProductAttribute._1_DevType;
	memcpy( ( char* )Original_info + Original_info_Wr, (u8*)ProductAttribute._2_ProducterID, 5 );
	Original_info_Wr += 5;
	memcpy( ( char* )Original_info + Original_info_Wr, (u8*)ProductAttribute._3_Dev_TYPENUM, 20 );
	Original_info_Wr += 20;
	memcpy( ( char* )Original_info + Original_info_Wr, (u8*)ProductAttribute._4_Dev_ID, 7 );
	Original_info_Wr += 7;
	memcpy( ( char* )Original_info + Original_info_Wr, (u8*)ProductAttribute._5_Sim_ICCID, 10 );
	Original_info_Wr += 10;

	Original_info[Original_info_Wr++] = ProductAttribute._6_HardwareVer_Len;
	memcpy( ( char* )Original_info + Original_info_Wr, (u8*)ProductAttribute._7_HardwareVer, ProductAttribute._6_HardwareVer_Len );
	Original_info_Wr += ProductAttribute._6_HardwareVer_Len;

	Original_info[Original_info_Wr++] = ProductAttribute._8_SoftwareVer_len;
	memcpy( ( char* )Original_info + Original_info_Wr, (u8*)ProductAttribute._9_SoftwareVer, ProductAttribute._8_SoftwareVer_len );
	Original_info_Wr += ProductAttribute._8_SoftwareVer_len;

	Original_info[Original_info_Wr++] = ProductAttribute._10_FirmWareVer_len;
	memcpy( ( char* )Original_info + Original_info_Wr, (u8*)ProductAttribute._11_FirmWare, ProductAttribute._10_FirmWareVer_len );
	Original_info_Wr += ProductAttribute._10_FirmWareVer_len;

	Original_info[Original_info_Wr++]	= ProductAttribute._12_GNSSAttribute;
	Original_info[Original_info_Wr++]	= ProductAttribute._13_ComModuleAttribute;


	/*
	   infoLen=sizeof(ProductAttribute);
	   memcpy( ( char * ) Original_info+ Original_info_Wr,(u8*)&ProductAttribute,infoLen);
	   Original_info_Wr+=infoLen;
	 */

	//  3. Send
	Protocol_End( Packet_Normal, 0 );
	if( DispContent )
	{
		rt_kprintf( "\r\n	发送终端属性 \r\n");
	}

	return true;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u8  Stuff_ISP_Resualt_BD_0108H( void )
{
	// 1. Head
	if( !Protocol_Head( MSG_0x0108, Packet_Normal ) )
	{
		return false;
	}
	// 2. content
	BD_ISP.ISP_running = 0;                                     // clear
	//----------------------------------------------------
	Original_info[Original_info_Wr++]	= BD_ISP.Update_Type;   // 升级类型
	Original_info[Original_info_Wr++]	= 0;                    //BD_ISP.Update_Type;  // 升级结果

	//  3. Send
	Protocol_End( Packet_Normal, 0 );
	if( DispContent )
	{
		rt_kprintf( "\r\n	远程升级结果上报 \r\n");
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u8  Stuff_BatchDataTrans_BD_0704H( void )
{
	// 1. Head
	if( !Protocol_Head( MSG_0x0704, Packet_Normal ) ) 
	{
		return false;
	}
	// 2. content
	// 2.1   数据项个数
	Original_info[Original_info_Wr++] = 1;
	// 2.2   位置数据类型
	Original_info[Original_info_Wr++] = 0; //  0: 正常上报  1: 盲区补报
	// 2.3   位置汇报数据项
	// 1. 告警标志  4
	memcpy( ( char* )Original_info + Original_info_Wr, ( char* )Warn_Status, 4 );
	Original_info_Wr += 4;
	// 2. 状态  4
	memcpy( ( char* )Original_info + Original_info_Wr, ( char* )Car_Status, 4 );
	Original_info_Wr += 4;
	// 3.  纬度
	memcpy( ( char* )Original_info + Original_info_Wr, ( char* )Gps_Gprs.Latitude, 4 );     //纬度   modify by nathan
	Original_info_Wr += 4;
	// 4.  经度
	memcpy( ( char* )Original_info + Original_info_Wr, ( char* )Gps_Gprs.Longitude, 4 );    //经度    东经  Bit 7->0   西经 Bit 7 -> 1
	Original_info_Wr += 4;
	// 5.  高程
	Original_info[Original_info_Wr++]	= (u8)( GPS_Hight << 8 );
	Original_info[Original_info_Wr++]	= (u8)GPS_Hight;
	// 6.  速度    0.1 Km/h
	Original_info[Original_info_Wr++]	= (u8)( Speed_gps >> 8 );                           //(GPS_speed>>8);
	Original_info[Original_info_Wr++]	= (u8)( Speed_gps );                                //GPS_speed;
	// 7. 方向   单位 1度
	Original_info[Original_info_Wr++]	= ( GPS_direction >> 8 );                           //High
	Original_info[Original_info_Wr++]	= GPS_direction;                                    // Low
	// 8.  日期时间
	Original_info[Original_info_Wr++]	= ( ( ( Gps_Gprs.Date[0] ) / 10 ) << 4 ) + ( ( Gps_Gprs.Date[0] ) % 10 );
	Original_info[Original_info_Wr++]	= ( ( Gps_Gprs.Date[1] / 10 ) << 4 ) + ( Gps_Gprs.Date[1] % 10 );
	Original_info[Original_info_Wr++]	= ( ( Gps_Gprs.Date[2] / 10 ) << 4 ) + ( Gps_Gprs.Date[2] % 10 );
	Original_info[Original_info_Wr++]	= ( ( Gps_Gprs.Time[0] / 10 ) << 4 ) + ( Gps_Gprs.Time[0] % 10 );
	Original_info[Original_info_Wr++]	= ( ( Gps_Gprs.Time[1] / 10 ) << 4 ) + ( Gps_Gprs.Time[1] % 10 );
	Original_info[Original_info_Wr++]	= ( ( Gps_Gprs.Time[2] / 10 ) << 4 ) + ( Gps_Gprs.Time[2] % 10 );

	//  3. Send
	Protocol_End( Packet_Normal, 0 );
	if( DispContent )
	{
		rt_kprintf( "\r\n	定位数据批量上传\r\n");
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u8  Stuff_CANDataTrans_BD_0705H( void )
{
	u16 DataNum = 0, i = 0;
	u32 read_rd = 0;
	// 1. Head
	if( !Protocol_Head( MSG_0x0705, Packet_Normal ) )
	{
		return false;
	}
	// 2. content
	// 数据项个数
	DataNum								= ( CAN_trans.canid_1_SdWr >> 3 ); // 除以8
	Original_info[Original_info_Wr++]	= ( DataNum >> 8 );
	Original_info[Original_info_Wr++]	= DataNum;
	Can_sdnum							+= DataNum;
	//接收时间
	Original_info[Original_info_Wr++]	= ( ( time_now.hour / 10 ) << 4 ) + ( time_now.hour % 10 );
	Original_info[Original_info_Wr++]	= ( ( time_now.min / 10 ) << 4 ) + ( time_now.min % 10 );
	Original_info[Original_info_Wr++]	= ( ( time_now.sec / 10 ) << 4 ) + ( time_now.sec % 10 );
	Original_info[Original_info_Wr++]	= ( Can_same % 10 ); //0x00;  // ms 毫秒
	Original_info[Original_info_Wr++]	= 0x00;
	//  CAN 总线数据项
	read_rd = 0;
	for( i = 0; i < DataNum; i++ )
	{
		/*
		   Original_info[Original_info_Wr++]= (CAN_trans.canid_1_Filter_ID>>24)|0x40;// 返回透传数据的类型
		   Original_info[Original_info_Wr++]=(CAN_trans.canid_1_Filter_ID>>16);
		   Original_info[Original_info_Wr++]=(CAN_trans.canid_1_Filter_ID>>8);
		   Original_info[Original_info_Wr++]=CAN_trans.canid_1_Filter_ID;
		 */

		Original_info[Original_info_Wr++]	= ( CAN_trans.canid_1_ID_SdBUF[i] >> 24 ) | 0x40; // 返回透传数据的类型
		Original_info[Original_info_Wr++]	= ( CAN_trans.canid_1_ID_SdBUF[i] >> 16 );
		Original_info[Original_info_Wr++]	= ( CAN_trans.canid_1_ID_SdBUF[i] >> 8 );
		Original_info[Original_info_Wr++]	= CAN_trans.canid_1_ID_SdBUF[i];

