nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
		//--------------------------------------------------------------------------
		memcpy( Original_info + Original_info_Wr, CAN_trans.canid_1_Sdbuf + read_rd, 8 );
		Original_info_Wr	+= 8;
		read_rd				+= 8;
	}
	CAN_trans.canid_1_SdWr = 0;
	//  3. Send
	Protocol_End( Packet_Normal, 0 );
	if( DispContent )
	{
		rt_kprintf( "\r\n	CAN 总线数据上传 数据项=%d   Rxnum=%d  Sd_num=%d  Can_loudiao=%d  Can_notsame=%d Same=%d\r\n", DataNum, Can_RXnum, Can_sdnum, Can_loudiao, Can_same, Can_notsame );
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u8  Stuff_CentreTakeACK_BD_0805H( void )
{
	// 1. Head
	if( !Protocol_Head( MSG_0x0805, Packet_Normal ) )
	{
		return false;
	}
	// 2. content
	//   float ID
	Original_info[Original_info_Wr++]	= (u8)( Centre_FloatID >> 8 );      //  应答流水号
	Original_info[Original_info_Wr++]	= (u8)Centre_FloatID;
	Original_info[Original_info_Wr++]	= (u8)SingleCamra_TakeResualt_BD;   // 中心应答结果
	Original_info[Original_info_Wr++]	= 0x00;                             //  成功拍照多媒体个数    1
	Original_info[Original_info_Wr++]	= 1;
	Original_info[Original_info_Wr++]	= 0;                                // 多媒体ID 列表
	Original_info[Original_info_Wr++]	= 0;
	Original_info[Original_info_Wr++]	= 0;
	Original_info[Original_info_Wr++]	= 1;
	//  3. Send
	Protocol_End( Packet_Normal, 0 );
	if( DispContent )
	{
		rt_kprintf( "\r\n	摄像头立即拍照应答 \r\n");
	}
}

//--------------------------------------------------------------------------
u8  Stuff_EventACK_0301H( void )
{
	// 1. Head
	if( !Protocol_Head( MSG_0x0301, Packet_Normal ) )
	{
		return false;
	}
	// 2. content
	Original_info[Original_info_Wr++] = EventObj.Event_ID; // 返回事件ID

	//  3. Send
	Protocol_End( Packet_Normal, 0 );
	if( DispContent )
	{
		rt_kprintf( "\r\n	 事件结果返回  \r\n");
	}
	return true;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u8  Stuff_ASKACK_0302H( void )
{
	// 1. Head
	if( !Protocol_Head( MSG_0x0302, Packet_Normal ) )
	{
		return false;
	}
	// 2. content
	//  应答流水号
	Original_info[Original_info_Wr++]	= ( ASK_Centre.ASK_floatID >> 8 ); // 返回事件ID
	Original_info[Original_info_Wr++]	= ASK_Centre.ASK_floatID;
	Original_info[Original_info_Wr++]	= ASK_Centre.ASK_answerID;
	//  3. Send
	Protocol_End( Packet_Normal, 0 );
	if( DispContent )
	{
		rt_kprintf( "\r\n	发送提问选择结果 \r\n");
	}
	return true;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u8  Stuff_MSGACK_0303H( void )
{
	// 1. Head
	if( !Protocol_Head( MSG_0x0303, Packet_Normal ) )
	{
		return false;
	}
	// 2. content
	//  应答流水号
	Original_info[Original_info_Wr++]	= MSG_BroadCast_Obj.INFO_TYPE;
	Original_info[Original_info_Wr++]	= MSG_BroadCast_Obj.INFO_PlyCancel; //  0  取消  1 点播
	//  3. Send
	Protocol_End( Packet_Normal, 0 );
	if( DispContent )
	{
		rt_kprintf( "\r\n	点播取消回复  \r\n");
	}
	return true;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u8  Stuff_ControlACK_0500H( void )   //   车辆控制应答
{
	//  1. Head
	if( !Protocol_Head( MSG_0x0500, Packet_Normal ) )
	{
		return false;
	}
	// 2. content
	//------------------------------- Stuff ----------------------------------------
	//   float ID                                                // 对应中心应答消息的流水号
	Original_info[Original_info_Wr++]	= (u8)( Vech_Control.CMD_FloatID >> 8 );
	Original_info[Original_info_Wr++]	= (u8)Vech_Control.CMD_FloatID;

	// 1. 告警标志  4
	memcpy( ( char* )Original_info + Original_info_Wr, ( char* )Warn_Status, 4 );
	Original_info_Wr += 4;
	// 2. 状态  4
	memcpy( ( char* )Original_info + Original_info_Wr, ( char* )Car_Status, 4 );
	Original_info_Wr += 4;
	// 3.  纬度
	memcpy( ( char* )Original_info + Original_info_Wr, ( char* )Gps_Gprs.Latitude, 4 );     //纬度   modify by nathan
	Original_info_Wr += 4;
	// 4.  经度
	memcpy( ( char* )Original_info + Original_info_Wr, ( char* )Gps_Gprs.Longitude, 4 );    //经度    东经  Bit 7->0   西经 Bit 7 -> 1
	Original_info_Wr += 4;
	// 5.  高程
	Original_info[Original_info_Wr++]	= (u8)( GPS_Hight << 8 );
	Original_info[Original_info_Wr++]	= (u8)GPS_Hight;
	// 6.  速度    0.1 Km/h
	Original_info[Original_info_Wr++]	= (u8)( Speed_gps >> 8 );
	Original_info[Original_info_Wr++]	= (u8)Speed_gps;
	// 7. 方向   单位 1度
	Original_info[Original_info_Wr++]	= ( GPS_direction >> 8 );   //High
	Original_info[Original_info_Wr++]	= GPS_direction;            // Low
	// 8.  日期时间
	Original_info[Original_info_Wr++]	= ( ( ( Gps_Gprs.Date[0] ) / 10 ) << 4 ) + ( ( Gps_Gprs.Date[0] ) % 10 );
	Original_info[Original_info_Wr++]	= ( ( Gps_Gprs.Date[1] / 10 ) << 4 ) + ( Gps_Gprs.Date[1] % 10 );
	Original_info[Original_info_Wr++]	= ( ( Gps_Gprs.Date[2] / 10 ) << 4 ) + ( Gps_Gprs.Date[2] % 10 );
	Original_info[Original_info_Wr++]	= ( ( Gps_Gprs.Time[0] / 10 ) << 4 ) + ( Gps_Gprs.Time[0] % 10 );
	Original_info[Original_info_Wr++]	= ( ( Gps_Gprs.Time[1] / 10 ) << 4 ) + ( Gps_Gprs.Time[1] % 10 );
	Original_info[Original_info_Wr++]	= ( ( Gps_Gprs.Time[2] / 10 ) << 4 ) + ( Gps_Gprs.Time[2] % 10 );

	//  3. Send
	Protocol_End( Packet_Normal, 0 );
	if( DispContent )
	{
		rt_kprintf( "\r\n	SEND  Vech  Control  ! \r\n");
	}

	return true;
}

//  行车记录仪 :采集指定的位置信息记录
u8  REC_09H_Stuff( void )
{
	u8 i = 0;
#if 0
	// 1.  最近1 小时的的位置信息记录
	// 1.1   开始时间
	Time2BCD( Original_info + Original_info_Wr ); // 记录仪实时时间
	Original_info_Wr += 6;
	for( i = 0; i < 60; i++ )
	{
		//  1.2  开始后第一分钟的位置
		//  longitude    3905.292651,N,11733.124913,E        long: 043438B1  lat: 0165DCFE
		Original_info[Original_info_Wr++]	= 0x04;
		Original_info[Original_info_Wr++]	= 0x34;
		Original_info[Original_info_Wr++]	= 0x38;
		Original_info[Original_info_Wr++]	= 0xB1;
		// lat
		Original_info[Original_info_Wr++]	= 0x01;
		Original_info[Original_info_Wr++]	= 0x65;
		Original_info[Original_info_Wr++]	= 0xDC;
		Original_info[Original_info_Wr++]	= 0xFE;
		// high
		Original_info[Original_info_Wr++]	= 0x00;
		Original_info[Original_info_Wr++]	= 0x65;
		// spd
		Original_info[Original_info_Wr++] = 0x00;
	}
#endif
}



/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:  wwww
***********************************************************/
u8  Stuff_RecoderACK_0700H( u8 PaketType )  //   行车记录仪数据上传
{
	u16 SregLen				= 0, Swr = 0;   //,Gwr=0; // S:serial  G: GPRS
	u16 Reg_len_position	= 0;
	u8	Sfcs				= 0;
	u16 i					= 0;
	u32 regdis				= 0, reg2 = 0;
	u8	Reg[70];
	u8	QueryRecNum = 0;                    // 查询记录数目

	//  1. Head
	if( !Protocol_Head( MSG_0x0700, PaketType ) )
	{
		return false;
	}

	switch( Recode_Obj.CMD )
	{
		case   0x00:                                                //  执行标准版本年号
			Original_info[Original_info_Wr++]	= (u8)( Recode_Obj.Float_ID >> 8 );
			Original_info[Original_info_Wr++]	= (u8)Recode_Obj.Float_ID;
			Original_info[Original_info_Wr++]	= Recode_Obj.CMD;   // 命令字
			Swr									= Original_info_Wr;

			Original_info[Original_info_Wr++]	= 0x55;             // 起始头
			Original_info[Original_info_Wr++]	= 0x7A;
			Original_info[Original_info_Wr++]	= 0x00;             //命令字
			SregLen								= 0x02;             // 信息长度
			Original_info[Original_info_Wr++]	= 0x00;             // Hi
			Original_info[Original_info_Wr++]	= 2;                // Lo

			Original_info[Original_info_Wr++]	= 0x00;             // 保留字
			Original_info[Original_info_Wr++]	= 0x12;             //  12  年标准 
			Original_info[Original_info_Wr++]	= 0x00;

			break;
		//---------------- 上传数类型  -------------------------------------
		case 0x01:
			//  01  当前驾驶员代码及对应的机动车驾驶证号
			Original_info[Original_info_Wr++]	= (u8)( Recode_Obj.Float_ID >> 8 );
			Original_info[Original_info_Wr++]	= (u8)Recode_Obj.Float_ID;
			Original_info[Original_info_Wr++]	= Recode_Obj.CMD;               // 命令字
			Swr									= Original_info_Wr;

			Original_info[Original_info_Wr++]	= 0x55;                         // 起始头
			Original_info[Original_info_Wr++]	= 0x7A;
			Original_info[Original_info_Wr++]	= 0x01;                         //命令字

