nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
			SregLen								= 87;                   // 信息长度
			Original_info[Original_info_Wr++]	= (u8)( SregLen >> 8 ); // Hi
			Original_info[Original_info_Wr++]	= (u8)SregLen;          // Lo

			Original_info[Original_info_Wr++] = 0x00;                   // 保留字

			Original_info[Original_info_Wr++]	= ( ( ( Gps_Gprs.Date[0] ) / 10 ) << 4 ) + ( ( Gps_Gprs.Date[0] ) % 10 );
			Original_info[Original_info_Wr++]	= ( ( Gps_Gprs.Date[1] / 10 ) << 4 ) + ( Gps_Gprs.Date[1] % 10 );
			Original_info[Original_info_Wr++]	= ( ( Gps_Gprs.Date[2] / 10 ) << 4 ) + ( Gps_Gprs.Date[2] % 10 );
			Original_info[Original_info_Wr++]	= t_hour;
			Original_info[Original_info_Wr++]	= t_min;
			Original_info[Original_info_Wr++]	= t_second;
			/*
			Time2BCD( Original_info + Original_info_Wr );               //记录仪实时时间
			Original_info_Wr += 6;
			*/
			//-------  状态字个数----------------------
			Original_info[Original_info_Wr++] = 0;// 8//修改为0
			//---------- 状态字内容-------------------


			/*
			   -------------------------------------------------------------
			          F4  行车记录仪 TW705   管脚定义
			   -------------------------------------------------------------
			   遵循  GB10956 (2012)  Page26  表A.12  规定
			   -------------------------------------------------------------
			 | Bit  |      Note       |  必备|   MCUpin  |   PCB pin  |   Colour | ADC
			   ------------------------------------------------------------
			    D7      刹车           *            PE11             9                棕
			    D6      左转灯     *             PE10            10               红
			    D5      右转灯     *             PC2              8                白
			    D4      远光灯     *             PC0              4                黑
			    D3      近光灯     *             PC1              5                黄
			    D2      雾灯          add          PC3              7                绿      *
			    D1      车门          add          PA1              6                灰      *
			    D0      预留
			 */
			memcpy( Original_info + Original_info_Wr, "预留      ", 10 );       // D0
			Original_info_Wr += 10;
			memcpy( Original_info + Original_info_Wr, "预留      ", 10 );       // D1
			Original_info_Wr += 10;
			memcpy( Original_info + Original_info_Wr, "预留      ", 10 );       // D2
			Original_info_Wr += 10;
			memcpy( Original_info + Original_info_Wr, "近光灯    ", 10 );       // D3
			Original_info_Wr += 10;
			memcpy( Original_info + Original_info_Wr, "远光灯    ", 10 );       // D4
			Original_info_Wr += 10;
			memcpy( Original_info + Original_info_Wr, "右转灯    ", 10 );       // D5
			Original_info_Wr += 10;
			memcpy( Original_info + Original_info_Wr, "左转灯    ", 10 );       // D6
			Original_info_Wr += 10;
			memcpy( Original_info + Original_info_Wr, "刹车      ", 10 );       // D7
			Original_info_Wr += 10;
			break;

		case 0x07:                                                              //07  记录仪唯一编号
			Original_info[Original_info_Wr++]	= (u8)( Recode_Obj.Float_ID >> 8 );
			Original_info[Original_info_Wr++]	= (u8)Recode_Obj.Float_ID;
			Original_info[Original_info_Wr++]	= Recode_Obj.CMD;               // 命令字
			Swr									= Original_info_Wr;

			Original_info[Original_info_Wr++]	= 0x55;                         // 起始头
			Original_info[Original_info_Wr++]	= 0x7A;

			Original_info[Original_info_Wr++] = 0x07;                           //命令字

			SregLen								= 30;                           //206;		 // 信息长度
			Original_info[Original_info_Wr++]	= (u8)( SregLen >> 8 );         // Hi
			Original_info[Original_info_Wr++]	= (u8)SregLen;                  // Lo

			Original_info[Original_info_Wr++] = 0x00;                           // 保留字
			//------- 信息内容 ------
			memcpy( Original_info + Original_info_Wr, "7654321", 7 );           // 3C 认证代码
			Original_info_Wr += 7;
			memcpy( Original_info + Original_info_Wr, "TW705   TW705   ", 16 ); // 产品型号
			Original_info_Wr					+= 16;
			Original_info[Original_info_Wr++]	= 0x13;                         // 生产日期
			Original_info[Original_info_Wr++]	= 0x03;
			Original_info[Original_info_Wr++]	= 0x01;
			Original_info[Original_info_Wr++]	= 0x00;                         // 生产流水号
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= IMSI_CODE[14] - 0x30;
			break;

		case 0x08:                                                              //  08   采集指定的行驶速度记录
			if( ( PaketType == Packet_Divide ) && ( Recode_Obj.Current_pkt_num == 1 ) )
			{
				Original_info[Original_info_Wr++]	= (u8)( Recode_Obj.Float_ID >> 8 );
				Original_info[Original_info_Wr++]	= (u8)Recode_Obj.Float_ID;
				Original_info[Original_info_Wr++]	= Recode_Obj.CMD;           // 命令字
		    }
				
				Swr									= Original_info_Wr;

				Original_info[Original_info_Wr++]	= 0x55;                     // 起始头
				Original_info[Original_info_Wr++]	= 0x7A;
				Original_info[Original_info_Wr++]	= 0x08;                     //命令字

				SregLen								= 504;//504;//630;                      // 信息长度       630
				Original_info[Original_info_Wr++]	= SregLen >> 8;             // Hi
				Original_info[Original_info_Wr++]	= SregLen;                  // Lo

				Original_info[Original_info_Wr++] = 0x00;                       // 保留字
			//	信息内容
			//WatchDog_Feed( );
			get_08h( Original_info + Original_info_Wr,Recode_Obj.Current_pkt_num);                        //126*5=630        num=576  packet

			Original_info_Wr += 504; //630;
			//  后续需要分包处理  -----nate
			break;
		case   0x09:                                                            // 09   指定的位置信息记录
			if( ( PaketType == Packet_Divide ) && ( Recode_Obj.Current_pkt_num == 1 ) )
			{
				Original_info[Original_info_Wr++]	= (u8)( Recode_Obj.Float_ID >> 8 );
				Original_info[Original_info_Wr++]	= (u8)Recode_Obj.Float_ID;
				Original_info[Original_info_Wr++]	= Recode_Obj.CMD;           // 命令字
			}
				Swr									= Original_info_Wr;
				Original_info[Original_info_Wr++]	= 0x55;                     // 起始头
				Original_info[Original_info_Wr++]	= 0x7A;

				Original_info[Original_info_Wr++] = 0x09;                       //命令字

