nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
			if( ( ( Photo_sdState.photo_sending ) == enable ) && ( ( Photo_sdState.SD_flag ) == enable ) )
			{
				Photo_sdState.SD_flag = disable;    // clear
			}else
			{
				return false;
			}
			//  ---------------  填写内容  ---------------
			//			read		Photo_sdState.SD_packetNum从1开始计数
			//			content_startoffset     picpage_offset				 contentpage_offset
			if( TF_Card_Status( ) == 0 )
			{
				if( Camera_Number == 1 )
				{
					Api_DFdirectory_Read( camera_1, Original_info + Original_info_Wr, 512, 1, MediaObj.Media_currentPacketNum );
				} else
				if( Camera_Number == 2 )
				{
					Api_DFdirectory_Read( camera_2, Original_info + Original_info_Wr, 512, 1, MediaObj.Media_currentPacketNum );
				} else
				if( Camera_Number == 3 )
				{
					Api_DFdirectory_Read( camera_3, Original_info + Original_info_Wr, 512, 1, MediaObj.Media_currentPacketNum );
				} else
				if( Camera_Number == 4 )
				{
					Api_DFdirectory_Read( camera_4, Original_info + Original_info_Wr, 512, 1, MediaObj.Media_currentPacketNum );
				}

				inadd = ( Photo_sdState.SD_packetNum - 1 ) << 9; //乘以512
				if( PicFileSize > inadd )
				{
					if( ( PicFileSize - inadd ) > 512 )
					{
						readsize = 512;
					} else
					{
						readsize = PicFileSize - inadd; // 最后一包
						rt_kprintf( "\r\n   最后一包 readsize =%d \r\n", readsize );
					}
				}else
				{
					return false;
				}
			}else
			if( TF_Card_Status( ) == 1 )
			{
				;


				/* inadd=(Photo_sdState.SD_packetNum-1)<<9; //乘以512
				   if(PicFileSize>inadd)
				   {
				                   if((PicFileSize-inadd)>512)
				                        readsize=512;
				   else
				   {
				   readsize=PicFileSize-inadd; // 最后一包
				   rt_kprintf("\r\n   最后一包 readsize =%d \r\n",readsize);
				   }
				   }
				   else
				   return false;
				             i=read_file(PictureName,inadd,readsize,Original_info + Original_info_Wr);
				   if(i==false)
				   {
				                 rt_kprintf("\r\n 图片文件: %s   读取失败\r\n",PictureName);
				                 return false;
				   } */
			}
			Original_info_Wr += readsize;           //
			break;
		case 1:                                     // 音频
			if( ( ( Sound_sdState.photo_sending ) == enable ) && ( ( Sound_sdState.SD_flag ) == enable ) )
			{
				Sound_sdState.SD_flag = disable;    // clear
			}else
			{
				return false;
			}
			//------------------------------------------------------------------------
			//  ---------------  填写内容  ---------------
			//			read		Photo_sdState.SD_packetNum从1开始计数
			//			content_startoffset     picpage_offset				 contentpage_offset
			if( TF_Card_Status( ) == 0 )
			{
				Api_DFdirectory_Read( voice, Original_info + Original_info_Wr, 512, 1, MediaObj.Media_currentPacketNum );
				inadd = ( Sound_sdState.SD_packetNum - 1 ) << 9; //乘以512
				if( SrcFileSize > inadd )
				{
					if( ( SrcFileSize - inadd ) > 512 )
					{
						readsize = 512;
					} else
					{
						readsize = SrcFileSize - inadd; // 最后一包
						rt_kprintf( "\r\n   最后一包 readsize =%d \r\n", readsize );
					}
				}else
				{
					return false;
				}
			}
			rt_kprintf( "\r\n Sound_sdState.SD_packetNum= %d   filesize=%d  readsize=%d  \r\n", Sound_sdState.SD_packetNum, SrcFileSize, SrcFileSize - inadd );
			Original_info_Wr += readsize;

			//-------------------------------------------------------------------------


			/*
			   //  ---------------	填写内容  ---------------
			   if(TF_Card_Status()==1)
			   {
			   if(mp3_sendstate==0)
			   {
			   if(Sound_sdState.SD_packetNum==1)
			   {  // wav tou

			   inadd=WaveFile_EncodeHeader(SrcFileSize ,Original_info + Original_info_Wr);
			   Original_info_Wr+=inadd;
			   rt_kprintf("\r\n 写入文件头大小为 wav fileheadersize=%d  \r\n",inadd);

			   }
			   //---------------------------------------------------------
			   soundpage=(Sound_sdState.SD_packetNum-1)/5;// 得到page
			   sounddelta=((Sound_sdState.SD_packetNum-1)%5)*SpxGet_Size; // 得到页内偏移
			              rt_kprintf("\r\n inadd=%d  soundpage =%d  inpageoffset=%d \r\n",inadd,soundpage,sounddelta);
			   //  i=read_file(SpxSrcName,(soundpage<<9),512,SpxBuf);
			   //  if(i==false)
			   // {
			   // rt_kprintf("\r\n spx文件: %s   读取失败--2\r\n",SpxSrcName);
			   //return false;
			   //}
			   Api_Config_read(voice, Sound_sdState.SD_packetNum, SpxBuf,500);
			   memcpy(instr,SpxBuf+sounddelta,SpxGet_Size);
			            //---------  spx Decode  5  包 ---------
			   speachDecode(instr, Original_info + Original_info_Wr);
			   Original_info_Wr+=160;
			   speachDecode(instr+20, Original_info + Original_info_Wr);
			   Original_info_Wr+=160;
			   speachDecode(instr+40, Original_info + Original_info_Wr);
			   Original_info_Wr+=160;
			   speachDecode(instr+60, Original_info + Original_info_Wr);
			   Original_info_Wr+=160;
			   speachDecode(instr+80, Original_info + Original_info_Wr);
			   Original_info_Wr+=160;
			   }
			   else
			   if(mp3_sendstate==1)
			   {
			   inadd=(Sound_sdState.SD_packetNum-1)<<9; //乘以512
			   if(mp3_fsize>inadd)
			   {
			   if((mp3_fsize-inadd)>512)
			    readsize=512;
			   else
			   {
			   readsize=mp3_fsize-inadd; // 最后一包
			   rt_kprintf("\r\n	 最后一包 mp3size =%d \r\n",readsize);
			   }
			   }
			   else
			   return false;
			   //rt_kprintf("\r\n 读取文件\r\n");
			   i=read_file(SpxSrcName,inadd,readsize,Original_info + Original_info_Wr);
			   //rt_kprintf("\r\n 读取文件完毕\r\n");
			   if(i==false)
			   {
			   rt_kprintf("\r\n mp3文件: %s	读取失败\r\n",SpxSrcName);
			   return false;
			   }
			   Original_info_Wr+=readsize;//


			   }
			   }
			       else
			   return false;
			 */
			break;
		case 2: // 视频
			if( TF_Card_Status( ) == 1 )
			{
				;


				/*	inadd=(Video_sdState.SD_packetNum-1)<<9; //乘以512
				   if(wmv_fsize>inadd)
				   {
				   if((wmv_fsize-inadd)>512)
				     readsize=512;
				   else
				    {
				    readsize=wmv_fsize-inadd; // 最后一包
				    rt_kprintf("\r\n	 最后一包 wmvsize =%d \r\n",readsize);
				    }
				   }
				   else
				   return false;
				   i=read_file(SpxSrcName,inadd,readsize,Original_info + Original_info_Wr);
				   if(i==false)
				   {
				   rt_kprintf("\r\n mp3文件: %s	读取失败\r\n",SpxSrcName);
				   return false;
				   }
				   Original_info_Wr+=readsize;
				 */
			}else
			{
				return false;
			}

			break;
		default:
			return false;
	}

