nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
	if( MediaObj.Media_currentPacketNum > MediaObj.Media_totalPacketNum )
	{
		return false;
	}
	//  5. Send
	Protocol_End( Packet_Divide, 0 );
	WatchDog_Feed( );
	if( DispContent )
	{
		rt_kprintf( "\r\n	Send Media Data \r\n");
	}
	//  else
	{
		rt_kprintf( "\r\n pic_total_num:  %d   current_num:  %d   \r\n ", MediaObj.Media_totalPacketNum, MediaObj.Media_currentPacketNum );
		if( MediaObj.Media_currentPacketNum >= MediaObj.Media_totalPacketNum )
		{
			rt_kprintf( "\r\n Media 最后一个block\r\n" );

			if( 0 == MediaObj.RSD_State ) // 如果在顺序传输模式下，则改为停止状态,等待中心下重传
			{
				MediaObj.RSD_State	= 2;
				MediaObj.RSD_Timer	= 0;
			}
		}
	}
	//----------  累加发送报数 --------------------
	if( 0 == MediaObj.RSD_State )
	{
		if( MediaObj.Media_currentPacketNum < MediaObj.Media_totalPacketNum )
		{
			//  图片
			if( Photo_sdState.photo_sending == enable )
			{
				Photo_sdState.SD_packetNum++;
			}
			//  音频
			if( Sound_sdState.photo_sending == enable )
			{
				Sound_sdState.SD_packetNum++;
			}
			//视频
			if( Video_sdState.photo_sending == enable )
			{
				Video_sdState.SD_packetNum++;
			}
		}
	}


/*	 else
   if(1==MediaObj.RSD_State)
   {
    MediaObj.RSD_Reader++;
     rt_kprintf("\r\n	  MediaObj.RSD_Reader++  =%d\r\n",MediaObj.RSD_Reader);
    if(MediaObj.RSD_Reader==MediaObj.RSD_total)
         MediaObj.RSD_State=2; //  置位等待状态，等待着中心再发重传指令
   }
 */
	//----------  返回  -------------------
	return true;
}

//----------------------------------------------------------------------
u8  Stuff_MultiMedia_IndexAck_0802H( void )
{
	u16 totalNum	= 0, lenregwr = 0;
	u16 i			= 0;

	// 1. Head
	if( !Protocol_Head( MSG_0x0802, Packet_Normal ) )
	{
		return false;
	}
	// 2. content
	//   float ID  应答流水号
	Original_info[Original_info_Wr++]	= (u8)( Centre_FloatID >> 8 );
	Original_info[Original_info_Wr++]	= (u8)Centre_FloatID;

	//------- 多媒体总项数 ----
	lenregwr							= Original_info_Wr;
	Original_info[Original_info_Wr++]	= (u8)( totalNum >> 8 );                    // 临时占上位置
	Original_info[Original_info_Wr++]	= (u8)totalNum;

	//----- 查找有效效位置 ----
	totalNum = 0;
	for( i = 0; i < 8; i++ )
	{
		if( SD_ACKflag.f_MediaIndexACK_0802H == 1 )                                 // 图像
		{
			Api_RecordNum_Read( pic_index, i, (u8*)&MediaIndex, sizeof( MediaIndex ) );
		}else
		if( SD_ACKflag.f_MediaIndexACK_0802H == 2 )                                 // 音频
		{
			Api_RecordNum_Read( voice_index, i, (u8*)&MediaIndex, sizeof( MediaIndex ) );
		}
		// rt_kprintf("\r\n Effective_Flag %d  f_QueryEventCode %d  EventCode %d  \r\n",MediaIndex.Effective_Flag,SD_ACKflag.f_QueryEventCode,MediaIndex.EventCode);
		if( ( MediaIndex.Effective_Flag == 1 ) && ( SD_ACKflag.f_QueryEventCode == MediaIndex.EventCode ) )
		{                                                                           //  查找有效的索引和相对应类型的索引
			Original_info[Original_info_Wr++]	= (u8)( MediaIndex.MediaID >> 24 ); //  多媒体ID dworrd
			Original_info[Original_info_Wr++]	= (u8)( MediaIndex.MediaID >> 16 );
			Original_info[Original_info_Wr++]	= (u8)( MediaIndex.MediaID >> 8 );
			Original_info[Original_info_Wr++]	= (u8)( MediaIndex.MediaID );
			Original_info[Original_info_Wr++]	= MediaIndex.Type;                  //  多媒体类型
			Original_info[Original_info_Wr++]	= MediaIndex.ID;                    //  通道
			Original_info[Original_info_Wr++]	= MediaIndex.EventCode;
			memcpy( Original_info + Original_info_Wr, MediaIndex.PosInfo, 28 );
			Original_info_Wr += 28;
			totalNum++;
		}
	}

	//---------   补上总项数  --------
	Original_info[lenregwr]		= (u8)( totalNum >> 8 );
	Original_info[lenregwr + 1] = totalNum;

	//  3. Send
	Protocol_End( Packet_Normal, 0 );
	if( DispContent )
	{
		rt_kprintf( "\r\n	Send Media Index \r\n");
	}
	return true;
}

//--------------------------------------------------------------------------------------
u8  Stuff_DriverInfoSD_0702H( void )
{
	u8 i = 0;
	// 1. Head
	if( !Protocol_Head( MSG_0x0702, Packet_Normal ) )
	{
		return false;
	}

	// 2. content

#if  0                                                                                              // old  not   right


	/*Original_info[Original_info_Wr++]=JT808Conf_struct.Driver_Info.BD_IC_status;
	   memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Driver_Info.BD_IC_inoutTime,6);
	   Original_info_Wr+=6;
	   Original_info[Original_info_Wr++]=JT808Conf_struct.Driver_Info.BD_IC_rd_res;   //卡片被拔出
	 */Original_info[Original_info_Wr++] = JT808Conf_struct.Driver_Info.BD_DriveName_Len; //  姓名长度
	memcpy( Original_info + Original_info_Wr, JT808Conf_struct.Driver_Info.BD_DriveName, JT808Conf_struct.Driver_Info.BD_DriveName_Len );
	Original_info_Wr += JT808Conf_struct.Driver_Info.BD_DriveName_Len;
	memcpy( Original_info + Original_info_Wr, JT808Conf_struct.Driver_Info.BD_Drv_CareerID, 20 );   //  从业资格证编码
	Original_info_Wr					+= 20;
	Original_info[Original_info_Wr++]	= JT808Conf_struct.Driver_Info.BD_Confirm_agentID_Len;
	memcpy( Original_info + Original_info_Wr, JT808Conf_struct.Driver_Info.BD_Confirm_agentID, JT808Conf_struct.Driver_Info.BD_Confirm_agentID_Len );
	Original_info_Wr += JT808Conf_struct.Driver_Info.BD_Confirm_agentID_Len;


	/* memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Driver_Info.BD_ExpireDate,4);  //YYYYMMDD		Original_info_Wr+=i;
	   Original_info_Wr+=4;	*/
#endif

#if   1            //  new  BD format
	//  状态
	if( IC_MOD.IC_Status == 1 )
	{
		JT808Conf_struct.Driver_Info.BD_IC_status	= 0x01;
		Original_info[Original_info_Wr++]			= JT808Conf_struct.Driver_Info.BD_IC_status;
		memcpy( Original_info + Original_info_Wr, JT808Conf_struct.Driver_Info.BD_IC_inoutTime, 6 );
		Original_info_Wr					+= 6;
		Original_info[Original_info_Wr++]	= JT808Conf_struct.Driver_Info.BD_IC_rd_res;                    //卡片被拔出
		if( JT808Conf_struct.Driver_Info.BD_IC_rd_res == 0 )
		{
			Original_info[Original_info_Wr++] = JT808Conf_struct.Driver_Info.BD_DriveName_Len;              //	姓名长度
			memcpy( Original_info + Original_info_Wr, JT808Conf_struct.Driver_Info.BD_DriveName, JT808Conf_struct.Driver_Info.BD_DriveName_Len );
			Original_info_Wr += JT808Conf_struct.Driver_Info.BD_DriveName_Len;
			memcpy( Original_info + Original_info_Wr, JT808Conf_struct.Driver_Info.BD_Drv_CareerID, 20 );   //	从业资格证编码
			Original_info_Wr					+= 20;
			Original_info[Original_info_Wr++]	= JT808Conf_struct.Driver_Info.BD_Confirm_agentID_Len;
			memcpy( Original_info + Original_info_Wr, JT808Conf_struct.Driver_Info.BD_Confirm_agentID, JT808Conf_struct.Driver_Info.BD_Confirm_agentID_Len );
			Original_info_Wr += JT808Conf_struct.Driver_Info.BD_Confirm_agentID_Len;
			memcpy( Original_info + Original_info_Wr, JT808Conf_struct.Driver_Info.BD_ExpireDate, 4 );      //YYYYMMDD		Original_info_Wr+=i;
			Original_info_Wr += 4;
		}
	} else
	{
		JT808Conf_struct.Driver_Info.BD_IC_status	= 0x02;
		Original_info[Original_info_Wr++]			= JT808Conf_struct.Driver_Info.BD_IC_status;
		memcpy( Original_info + Original_info_Wr, JT808Conf_struct.Driver_Info.BD_IC_inoutTime, 6 );
		Original_info_Wr += 6;
	}
#endif

	// 3. Send
	Protocol_End( Packet_Normal, 0 );
	if( DispContent )
	{
		rt_kprintf( "\r\n	Send Driver Info \r\n");
	}
	return true;
}

//---------------------------------------------------------------------------------
u8  Stuff_Worklist_0701H( void )
{
	u32 listlen = 215;
	// 1. Head
	if( !Protocol_Head( MSG_0x0701, Packet_Normal ) )
	{
		return false;
	}

	// 2. content
	//   信息长度
	listlen								= 207;
	Original_info[Original_info_Wr++]	= ( listlen >> 24 ); // 返回事件ID
	Original_info[Original_info_Wr++]	= ( listlen >> 16 );
	Original_info[Original_info_Wr++]	= ( listlen >> 8 );
	Original_info[Original_info_Wr++]	= listlen;

	memcpy( Original_info + Original_info_Wr, "托运单位:天津七一二通信广播有限公司 电话:022-26237216  ", 55 );
	Original_info_Wr += 55;
	memcpy( Original_info + Original_info_Wr, "承运单位:天津物流运输公司 电话:022-86692666  ", 45 );
	Original_info_Wr += 45;
	memcpy( Original_info + Original_info_Wr, "物品名称:GPS车载终端  包装方式:  箱式   每箱数量: 20   总量: 30箱  ", 67 );
	Original_info_Wr += 67;
	memcpy( Original_info + Original_info_Wr, "车型:箱式小货车 运达日期 :  2012-1-11   ", 40 );
	Original_info_Wr += 40;

	// 3. Send
	Protocol_End( Packet_Normal, 0 );
	if( DispContent )
	{
		rt_kprintf( "\r\n	Send Worklist  \r\n");
	}
	return true;
}

//------------------------------------------------------------------------------------
u8 Stuff_DataTrans_0900_BD_GNSSData( void )
{
	u16 TX_NUM	= 0, Rec_Num = 0, i = 0;
	u8	Gfcs	= 0;
	//---------------------------------------------
	// 1. Head
	if( !Protocol_Head( MSG_0x0900, Packet_Normal ) )
	{
		return false;
	}
	// 2. content
	//	应答流水号
	Original_info[Original_info_Wr++] = 0x00; // 返回透传数据的类型 1	表示远程下载
	// 3. 内容
	// GNSS 信息
	//	4. Send
	Protocol_End( Packet_Normal, 1 );
	if( DispContent )
	{
		rt_kprintf( "\r\n	 发送透传 GNSS Data\r\n");
	}
	return true;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u8 Stuff_DataTrans_0900_BD_ICinfo( void )
{
	u16 TX_NUM	= 0, Rec_Num = 0, i = 0;
	u8	Gfcs	= 0;
	//---------------------------------------------
	// 1. Head
	if( !Protocol_Head( MSG_0x0900, Packet_Normal ) )
	{
		return false;
	}
	// 2. content
	//	应答流水号
	Original_info[Original_info_Wr++] = 0x0B;                           //IC 卡信息
	// 3. 内容
	// IC 信息
	memcpy( Original_info + Original_info_Wr, IC_MOD.IC_Tx40H, 64 );    //IC 64 字节信息
	Original_info_Wr += 64;
	//	4. Send
	Protocol_End( Packet_Normal, 1 );
	if( DispContent )
	{
		rt_kprintf( "\r\n	 发送透传IC 卡信息\r\n");
	}
	return true;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u8 Stuff_DataTrans_0900_BD_Serial1( void )
{
	u16 TX_NUM	= 0, Rec_Num = 0, i = 0;
	u8	Gfcs	= 0;
	//---------------------------------------------
	// 1. Head
	if( !Protocol_Head( MSG_0x0900, Packet_Normal ) )
	{
		return false;
	}
	// 2. content
	//	应答流水号
	Original_info[Original_info_Wr++] = 0x41; // 串口1 透传消息
	// 3. 内容
	// 串口1 信息
	//	4. Send
	Protocol_End( Packet_Normal, 1 );
	if( DispContent )
	{
		rt_kprintf( "\r\n	 发送透传串口1信息\r\n");
	}
	return true;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u8 Stuff_DataTrans_0900_BD_Serial2( void )
{
	u16 TX_NUM	= 0, Rec_Num = 0, i = 0;
	u8	Gfcs	= 0;
	//---------------------------------------------
	// 1. Head
	if( !Protocol_Head( MSG_0x0900, Packet_Normal ) )
	{
		return false;
	}
	// 2. content
	//	应答流水号
	Original_info[Original_info_Wr++] = 0x42; // 串口2 透传消息
	// 3. 内容
	// 串口1 信息
	//	4. Send
	Protocol_End( Packet_Normal, 1 );
	if( DispContent )
	{
		rt_kprintf( "\r\n	 发送透传串口2 信息\r\n");
	}
	return true;
}

//----------------------------------------------
u8  Update_HardSoft_Version_Judge( u8 * instr )
{
	//   读取第50 页信息
	Device_type		= ( (u32)instr[1] << 24 ) + ( (u32)instr[2] << 16 ) + ( (u32)instr[3] << 8 ) + (u32)instr[4];
	Firmware_ver	= ( (u32)instr[5] << 24 ) + ( (u32)instr[6] << 16 ) + ( (u32)instr[7] << 8 ) + (u32)instr[8];
	rt_kprintf( "	\r\n 设备类型: %x  软件版本:%x \r\n", Device_type, Firmware_ver );

