nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
			//CallState=CallState_rdytoDialLis;  // 准备开始拨打监听号码
			rt_kprintf( "\r\n 设置监控平台号码: %s \r\n", JT808Conf_struct.LISTEN_Num );

			break;
		case 0x0041: //   复位电话号码，可采用此电话号码拨打终端电话让终端复位
			if( infolen == 0 )
			{
				break;
			}
			memset( reg_str, 0, sizeof( reg_str ) );
			memcpy( reg_str, Content, infolen );
			rt_kprintf( "\r\n 复位电话号码 %s \r\n", reg_str );
			break;
		case 0x0042:    //   恢复出厂设置电话，可采用该电话号码是终端恢复出厂设置

			break;
		case 0x0045:    //  终端电话接听策略 0 自动接听  1 ACC ON自动接听 OFF时手动接听

			break;
		case 0x0046:    //  每次通话最长时间 ，单位  秒

			break;
		case 0x0047:    //  当月最长通话时间，单位  秒

			break;
		case 0x0048:    //  监听电话号码
			if( infolen == 0 )
			{
				break;
			}
			memset( JT808Conf_struct.LISTEN_Num, 0, sizeof( JT808Conf_struct.LISTEN_Num ) );
			memcpy( JT808Conf_struct.LISTEN_Num, Content, infolen );
			Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
			CallState = CallState_rdytoDialLis; // 准备开始拨打监听号码
			rt_kprintf( "\r\n 立即拨打监听号码: %s \r\n", JT808Conf_struct.LISTEN_Num );
			break;

		//----------
		case 0x0050:                            //  报警屏蔽字， 与位置信息中报警标志相对应。相应位为1时报警被屏蔽---

			if( infolen != 4 )
			{
				break;
			}
			resualtu32 = ( Content[0] << 24 ) + ( Content[1] << 16 ) + ( Content[2] << 8 ) + Content[3];
			rt_kprintf( "\r\n 报警屏蔽字: %x \r\n", resualtu32 );
			break;
		case 0x0052:    //  报警拍照开关， 与报警标志对应的位1时，拍照

			break;
		case 0x0053:    //  报警拍照存储    与报警标志对应的位1时，拍照存储 否则实时上传

			break;
		case 0x0054:    //  关键标志        与报警标志对应的位1  为关键报警

			break;
		//---------

		case 0x0055:    //  最高速度   单位   千米每小时
			if( infolen != 4 )
			{
				break;
			}
			JT808Conf_struct.Speed_warn_MAX = ( Content[0] << 24 ) + ( Content[1] << 16 ) + ( Content[2] << 8 ) + Content[3];
			memset( reg_str, 0, sizeof( reg_str ) );
			memcpy( reg_str, &JT808Conf_struct.Speed_warn_MAX, 4 );
			memcpy( reg_str + 4, &JT808Conf_struct.Spd_Exd_LimitSeconds, 4 );
			Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
			rt_kprintf( "\r\n 最高速度: %d km/h \r\n", JT808Conf_struct.Speed_warn_MAX );
			Spd_ExpInit( );
			break;
		case 0x0056: //  超速持续时间    单位 s
			if( infolen != 4 )
			{
				break;
			}
			JT808Conf_struct.Spd_Exd_LimitSeconds = ( Content[0] << 24 ) + ( Content[1] << 16 ) + ( Content[2] << 8 ) + Content[3];
			memset( reg_str, 0, sizeof( reg_str ) );
			memcpy( reg_str, &JT808Conf_struct.Speed_warn_MAX, 4 );
			memcpy( reg_str + 4, &JT808Conf_struct.Spd_Exd_LimitSeconds, 4 );
			Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
			rt_kprintf( "\r\n 超时持续时间: %d s \r\n", JT808Conf_struct.Spd_Exd_LimitSeconds );
			Spd_ExpInit( );
			break;
		case 0x0057:                    //  连续驾驶时间门限 单位  s
			if( infolen != 4 )
			{
				break;
			}
			TiredConf_struct.TiredDoor.Door_DrvKeepingSec = ( Content[0] << 24 ) + ( Content[1] << 16 ) + ( Content[2] << 8 ) + Content[3];
			Api_Config_write( tired_config, 0, (u8*)&TiredConf_struct, sizeof( TiredConf_struct ) );
			Warn_Status[3] &= ~0x04;    //BIT(2)	接触疲劳驾驶报警
			TIRED_Drive_Init( );        // 清除疲劳驾驶状态
			rt_kprintf( "\r\n 连续驾驶时间门限: %d s \r\n", TiredConf_struct.TiredDoor.Door_DrvKeepingSec );
			break;
		case 0x0058:                    //  当天累计驾驶时间门限  单位  s
			if( infolen != 4 )
			{
				break;
			}
			TiredConf_struct.TiredDoor.Door_DayAccumlateDrvSec = ( Content[0] << 24 ) + ( Content[1] << 16 ) + ( Content[2] << 8 ) + Content[3];
			Api_Config_write( tired_config, 0, (u8*)&TiredConf_struct, sizeof( TiredConf_struct ) );
			TiredConf_struct.Tired_drive.ACC_ONstate_counter	= 0;
			TiredConf_struct.Tired_drive.ACC_Offstate_counter	= 0;
			Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
			rt_kprintf( "\r\n 当天累计驾驶时间: %d s \r\n", TiredConf_struct.TiredDoor.Door_DayAccumlateDrvSec );
			break;
		case 0x0059: //  最小休息时间  单位 s
			if( infolen != 4 )
			{
				break;
			}
			TiredConf_struct.TiredDoor.Door_MinSleepSec = ( Content[0] << 24 ) + ( Content[1] << 16 ) + ( Content[2] << 8 ) + Content[3];
			Api_Config_write( tired_config, 0, (u8*)&TiredConf_struct, sizeof( TiredConf_struct ) );
			rt_kprintf( "\r\n 最小休息时间: %d s \r\n", TiredConf_struct.TiredDoor.Door_MinSleepSec );
			break;
		case 0x005A: //  最长停车时间   单位 s
			if( infolen != 4 )
			{
				break;
			}
			TiredConf_struct.TiredDoor.Door_MaxParkingSec = ( Content[0] << 24 ) + ( Content[1] << 16 ) + ( Content[2] << 8 ) + Content[3];
			Api_Config_write( tired_config, 0, (u8*)&TiredConf_struct, sizeof( TiredConf_struct ) );
			TiredConf_struct.TiredDoor.Parking_currentcnt	= 0;
			Warn_Status[1]									&= ~0x08;   // 清除超时触发
			rt_kprintf( "\r\n 最长停车时间: %d s \r\n", TiredConf_struct.TiredDoor.Door_MaxParkingSec );
			break;
		//---------
		case  0x0070:                                                   //  图像/视频质量  1-10  1 最好

			break;
		case  0x0071:                                                   //  亮度  0-255

			break;
		case  0x0072:                                                   //  对比度  0-127

			break;
		case  0x0073:                                                   // 饱和度  0-127

			break;
		case  0x0074:                                                   // 色度   0-255

			break;
		//---------
		case  0x0080:                                                   // 车辆里程表读数   1/10 km

			break;
		case  0x0081:                                                   // 车辆所在的省域ID
			if( infolen != 2 )
			{
				break;
			}
			JT808Conf_struct.Vechicle_Info.Dev_ProvinceID = ( Content[0] << 8 ) + Content[1];
			Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
			rt_kprintf( "\r\n 车辆所在省域ID: 0x%X \r\n", JT808Conf_struct.Vechicle_Info.Dev_ProvinceID );
			break;
		case  0x0082: // 车辆所在市域ID
			if( infolen != 2 )
			{
				break;
			}
			JT808Conf_struct.Vechicle_Info.Dev_ProvinceID = ( Content[0] << 8 ) + Content[1];
			Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
			rt_kprintf( "\r\n 车辆所在市域ID: 0x%X \r\n", JT808Conf_struct.Vechicle_Info.Dev_ProvinceID );
			break;
		case  0x0083: // 公安交通管理部门颁发的机动车号牌
			if( infolen < 4 )
			{
				break;
			}
			memset( JT808Conf_struct.Vechicle_Info.Vech_Num, 0, sizeof( JT808Conf_struct.Vechicle_Info.Vech_Num ) );
			memcpy( JT808Conf_struct.Vechicle_Info.Vech_Num, Content, infolen );
			Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
			rt_kprintf( "\r\n 机动车驾驶证号: %s  \r\n", JT808Conf_struct.Vechicle_Info.Vech_Num );
			break;
		case  0x0084: // 车牌颜色  按照国家规定
			if( infolen != 1 )
			{
				break;
			}
			JT808Conf_struct.Vechicle_Info.Dev_Color = Content[0];
			Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
			rt_kprintf( "\r\n 车辆颜色: %d  \r\n", JT808Conf_struct.Vechicle_Info.Dev_Color );
			break;
		//--------------- BD  新增----------------------------------
		case  0x001A: //  IC卡 主服务器或域名
			memset( reg_in, 0, sizeof( reg_in ) );
			memcpy( reg_in, Content, infolen );
			//----------------------------

			i = str2ip( (char*)reg_in, SysConf_struct.BD_IC_main_IP );
			if( i <= 3 )
			{
				rt_kprintf( "\r\n IC  主 域名: %s \r\n", reg_in );

				memset( SysConf_struct.BD_IC_DNSR, 0, sizeof( SysConf_struct.BD_IC_DNSR ) );
				memcpy( SysConf_struct.BD_IC_DNSR, (char*)Content, infolen );
				Api_Config_write( config, ID_CONF_SYS, (u8*)&SysConf_struct, sizeof( SysConf_struct ) );
				break;
			}
			memset( reg_str, 0, sizeof( reg_str ) );
			IP_Str( (char*)reg_str, *( u32* )SysConf_struct.BD_IC_main_IP );
			Api_Config_write( config, ID_CONF_SYS, (u8*)&SysConf_struct, sizeof( SysConf_struct ) );
			rt_kprintf( "\r\n IC  主IP: %d.%d.%d.%d \r\n", SysConf_struct.BD_IC_main_IP[0], SysConf_struct.BD_IC_main_IP[1], SysConf_struct.BD_IC_main_IP[2], SysConf_struct.BD_IC_main_IP[3] );
			break;
		case  0x001B:   // IC 卡  主TCP端口
			SysConf_struct.BD_IC_TCP_port = ( Content[0] << 24 ) + ( Content[1] << 16 ) + ( Content[2] << 8 ) + Content[3];
			Api_Config_write( config, ID_CONF_SYS, (u8*)&SysConf_struct, sizeof( SysConf_struct ) );
			rt_kprintf( "\r\n IC  TCP Port: %d \r\n", SysConf_struct.BD_IC_TCP_port );
			//  IC 卡中心
			DataLink_IC_Socket_set( SysConf_struct.BD_IC_main_IP, SysConf_struct.BD_IC_TCP_port, 0 );
			break;
		case  0x001C:   // IC卡   主UDP 端口
			SysConf_struct.BD_IC_UDP_port = ( Content[0] << 24 ) + ( Content[1] << 16 ) + ( Content[2] << 8 ) + Content[3];
			Api_Config_write( config, ID_CONF_SYS, (u8*)&SysConf_struct, sizeof( SysConf_struct ) );
			rt_kprintf( "\r\n IC  UDP Port : %d \r\n", SysConf_struct.BD_IC_UDP_port );
			break;
		case  0x001D:   // IC 卡备用服务器和端口
			memset( reg_in, 0, sizeof( reg_in ) );
			memcpy( reg_in, Content, infolen );
			//----------------------------
			i = str2ip( (char*)reg_in, SysConf_struct.BD_IC_Aux_IP );
			if( i <= 3 )
			{
				rt_kprintf( "\r\n IC  主 域名: %s \r\n", reg_in );

				memset( SysConf_struct.BD_IC_DNSR_Aux, 0, sizeof( SysConf_struct.BD_IC_DNSR_Aux ) );
				memcpy( SysConf_struct.BD_IC_DNSR_Aux, (char*)Content, infolen );
				Api_Config_write( config, ID_CONF_SYS, (u8*)&SysConf_struct, sizeof( SysConf_struct ) );
				break;
			}
			memset( reg_str, 0, sizeof( reg_str ) );
			IP_Str( (char*)reg_str, *( u32* )SysConf_struct.BD_IC_Aux_IP );
			Api_Config_write( config, ID_CONF_SYS, (u8*)&SysConf_struct, sizeof( SysConf_struct ) );
			rt_kprintf( "\r\n IC  备用IP: %d.%d.%d.%d \r\n", SysConf_struct.BD_IC_Aux_IP[0], SysConf_struct.BD_IC_Aux_IP[1], SysConf_struct.BD_IC_Aux_IP[2], SysConf_struct.BD_IC_Aux_IP[3] );

			break;
		case   0x0031: //  电子围栏半径(非法位移阈值)
			if( infolen != 2 )
			{
				break;
			}
			JT808Conf_struct.BD_CycleRadius_DoorValue = ( Content[0] << 8 ) + Content[1];
			Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
			rt_kprintf( "\r\n 电子围栏半径(非法移动阈值): %d m\r\n", JT808Conf_struct.BD_CycleRadius_DoorValue );
			break;
		case   0x005B: // 超速报警预警差值   1/10 KM/h
			if( infolen != 2 )
			{
				break;
			}
			JT808Conf_struct.BD_MaxSpd_preWarnValue = ( Content[0] << 8 ) + Content[1];
			Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
			rt_kprintf( "\r\n 超速报警预警差值: %d x 0.1km/h\r\n", JT808Conf_struct.BD_MaxSpd_preWarnValue );

			break;
		case   0x005C: // 疲劳驾驶阈值  单位:s
			if( infolen != 2 )
			{
				break;
			}
			JT808Conf_struct.BD_TiredDrv_preWarnValue = ( Content[0] << 8 ) + Content[1];
			Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
			rt_kprintf( "\r\n 疲劳驾驶阈值: %d s\r\n", JT808Conf_struct.BD_TiredDrv_preWarnValue );
			break;
		case   0x005D: // 碰撞报警参数设置
			if( infolen != 2 )
			{
				break;
			}
			JT808Conf_struct.BD_Collision_Setting = ( Content[0] << 8 ) + Content[1];
			Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
			rt_kprintf( "\r\n 碰撞报警参数设置 : %x \r\n", JT808Conf_struct.BD_MaxSpd_preWarnValue );
			break;
		case   0x005E: // 侧翻报警参数设置   默认30度
			if( infolen != 2 )
			{
				break;
			}
			JT808Conf_struct.BD_Laydown_Setting = ( Content[0] << 8 ) + Content[1];
			Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
			rt_kprintf( "\r\n侧翻报警参数设置: %x r\n", JT808Conf_struct.BD_Laydown_Setting );
			break;
		//---  CAMERA
		case   0x0064: //  定时拍照控制
			if( infolen != 4 )
			{
				break;
			}
			JT808Conf_struct.BD_CameraTakeByTime_Settings = ( Content[0] << 24 ) + ( Content[1] << 16 ) + ( Content[2] << 8 ) + Content[3];
			Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
			rt_kprintf( "\r\n 定时拍照控制: %X\r\n", JT808Conf_struct.BD_CameraTakeByTime_Settings );
			break;
		case   0x0065: //  定距离拍照控制
			if( infolen != 4 )
			{
				break;
			}
			JT808Conf_struct.BD_CameraTakeByDistance_Settings = ( Content[0] << 24 ) + ( Content[1] << 16 ) + ( Content[2] << 8 ) + Content[3];
			Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
			rt_kprintf( "\r\n  定距离拍照控制: %X\r\n", JT808Conf_struct.BD_CameraTakeByDistance_Settings );
			break;
		//--- GNSS
		case    0x0090:                         // GNSS 定位模式

