nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
			JT808Conf_struct.BD_EXT.GNSS_Mode = Content[0];
			rt_kprintf( "\r\n  GNSS Value= 0x%2X	\r\n", Content[0] );
			switch( JT808Conf_struct.BD_EXT.GNSS_Mode )
			{
				case 0x01:                      // 单 GPS 定位模式
					gps_mode( "2" );
					Car_Status[1]	&= ~0x0C;   // clear bit3 bit2      1100
					Car_Status[1]	|= 0x04;    // Gps mode   0100
					break;
				case  0x02:                     //  单BD2 定位模式
					gps_mode( "1" );
					Car_Status[1]	&= ~0x0C;   // clear bit3 bit2
					Car_Status[1]	|= 0x08;    // BD mode	1000
					break;
				case  0x03:                     //  BD2+GPS 定位模式
					gps_mode( "3" );
					Car_Status[1]	&= ~0x0C;   // clear bit3 bit2
					Car_Status[1]	|= 0x0C;    // BD+GPS  mode	1100
					break;
			}
			Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
			break;
		case    0x0091:                         // GNSS 波特率
			JT808Conf_struct.BD_EXT.GNSS_Baud = Content[0];
			switch( JT808Conf_struct.BD_EXT.GNSS_Baud )
			{
				case 0x00:                      //  4800
					JT808Conf_struct.BD_EXT.GNSS_Baud_Value = 4800;
					//rt_thread_delay(5);
					//gps_write("$PCAS01,0*1C\r\n",14);
					//rt_thread_delay(5);
					// gps_baud( 4800 );
					break;
				case 0x01:                      //9600   --default
					JT808Conf_struct.BD_EXT.GNSS_Baud_Value = 9600;
					//rt_thread_delay(5);
					//gps_write("$PCAS01,1*1D\r\n",14);
					//rt_thread_delay(5);
					//gps_baud( 9600 );
					break;
				case  0x02:                     // 19200
					JT808Conf_struct.BD_EXT.GNSS_Baud_Value = 19200;
					//rt_thread_delay(5);
					//gps_write("$PCAS01,2*1E\r\n",14);
					//rt_thread_delay(5);
					//gps_baud( 19200 );
					break;
				case  0x03:                     //  38400
					JT808Conf_struct.BD_EXT.GNSS_Baud_Value = 38400;
					//rt_thread_delay(5);
					//gps_write("$PCAS01,3*1F\r\n",14);
					//rt_thread_delay(5);
					//gps_baud( 38400 );
					break;
				case  0x04:                     // 57600
					JT808Conf_struct.BD_EXT.GNSS_Baud_Value = 57600;
					//rt_thread_delay(5);
					//gps_write("$PCAS01,4*18\r\n",14);
					//rt_thread_delay(5);
					//gps_baud( 57600 );
					break;
				case   0x05:                    // 115200
					JT808Conf_struct.BD_EXT.GNSS_Baud_Value = 115200;
					//rt_thread_delay(5);
					// gps_write("$PCAS01,5*19\r\n",14);
					//rt_thread_delay(5);
					// gps_baud( 115200 );
					break;
			}
			//---UART_GPS_Init(baud);  //   修改串口波特率
			rt_thread_delay( 20 );
			// BD_EXT_Write();
			rt_kprintf( "\r\n 中心设置GNSS 波特率:  %d s\r\n", JT808Conf_struct.BD_EXT.GNSS_Baud_Value );

			break;
		case    0x0092:     // GNSS 模块详细定位数据输出频率

			break;
		case    0x0093:     //  GNSS 模块详细定位数据采集频率  1

			break;
		case    0x0094:     // GNSS 模块详细定位数据上传方式

			break;
		case    0x0095:     //  GNSS 模块详细上传设置

			break;
		//----CAN--
		case      0x0100:   //  CAN  总线通道 1  采集间隔              0   : 表示不采集
			if( infolen != 4 )
			{
				break;
			}
			CAN_trans.can1_sample_dur	= ( Content[0] << 24 ) + ( Content[1] << 16 ) + ( Content[2] << 8 ) + Content[3];
			Can_RXnum					= 0;
			Can_sdnum					= 0;
			Can_same					= 0;
			break;
		case    0x0101: //  CAN  总线通道 1 上传时间间隔    0 :  表示不上传
			if( infolen != 2 )
			{
				break;
			}
			CAN_trans.can1_trans_dur = ( Content[0] << 8 ) + Content[1];

			break;
		case    0x0102: //  CAN  总线通道 2  采集间隔              0   : 表示不采集
			if( infolen != 4 )
			{
				break;
			}
			CAN_trans.can2_sample_dur = ( Content[0] << 24 ) + ( Content[1] << 16 ) + ( Content[2] << 8 ) + Content[3];
			break;
		case    0x0103: //  CAN  总线通道 2 上传时间间隔    0 :  表示不上传
			if( infolen != 2 )
			{
				break;
			}
			CAN_trans.can2_trans_dur = ( Content[0] << 8 ) + Content[1];
			break;
		case    0x0110: //  CAN 总线ID 单独采集设置
			CAN_trans.canid_2_NotGetID = ( ( Content[4] & 0x1F ) << 24 ) + ( Content[5] << 16 ) + ( Content[6] << 8 ) + Content[7];
			rt_kprintf( "\r\n不采集ID  0x0110= %08X\r\n", CAN_trans.canid_2_NotGetID );

			break;
		case    0x0111: //  CAN 总线ID 单独采集设置 其他
			if( infolen != 8 )
			{
				break;
			}
			OutPrint_HEX( "0x0111", Content, 8 );
			memcpy( CAN_trans.canid_1, Content, 8 );
			memset( CAN_trans.canid_1_Rxbuf, 0, sizeof( CAN_trans.canid_1_Rxbuf ) );
			CAN_trans.canid_1_RxWr		= 0;    // clear  write
			CAN_trans.canid_timer		= 0;
			CAN_trans.canid_0705_sdFlag = 0;

			//------ 解析赋值 --------
			CAN_trans.canid_1_sample_dur = ( Content[0] << 24 ) + ( Content[1] << 16 ) + ( Content[2] << 8 ) + Content[3];
			if( Content[4] & 0x40 )             // bit 30
			{
				CAN_trans.canid_1_ext_state = 1;
			} else
			{
				CAN_trans.canid_1_ext_state = 0;
			}
			CAN_trans.canid_1_Filter_ID = ( ( Content[4] & 0x1F ) << 24 ) + ( Content[5] << 16 ) + ( Content[6] << 8 ) + Content[7];

			rt_kprintf( "\r\n FilterID=%08X, EXTstate: %d   can1_samle=%d ms   canid_1_sample_dur=%dms    Trans_dur=%d s\r\n", CAN_trans.canid_1_Filter_ID, CAN_trans.canid_1_ext_state, CAN_trans.can1_sample_dur, CAN_trans.canid_1_sample_dur, CAN_trans.can1_trans_dur );

			break;
		default:
			return false;
	}

	return true;
}

//--------------------------------------------------------------------
u8  CentreSet_subService_8105H( u32 Control_ID, u8 infolen, u8 *Content )
{
	switch( Control_ID )
	{
		case 1:                                         //  无线升级参数  参数之间采用分号分隔   指令格式如下:


			/*
			   URL 地址；拨号名称；拨号用户名；拨号密码；地址；TCP端口；UDP端口；制造商ID; 硬件版本；固件版本；连接到指定服务器指定是服务器时限；
			   若某个参数无数值，则放空
			 */
			rt_kprintf( "\r\n 无线升级 \r\n" );
			rt_kprintf( "\r\n 内容: %s\r\n", Content );
			break;
		case 2:                                         // 控制终端连接指定服务器


			/*
			   连接控制；监管平台鉴权码；拨号点名称； 拨号用户名；拨号密码；地址；TCP端口；UDP端口；连接到指定服务器时限
			   若每个参数无数值，则放空
			 */
			rt_kprintf( "\r\n 终端控制连接指定服务器\r\n" );
			rt_kprintf( "\r\n 内容: %s\r\n", Content );
			break;
		case 3:                                         //  终端关机
			SD_ACKflag.f_CentreCMDack_0001H = 5;
			rt_kprintf( "\r\n 终端关机 \r\n" );
			break;
		case 4:                                         //  终端复位
			SD_ACKflag.f_CentreCMDack_0001H = 3;
			rt_kprintf( "\r\n 终端复位 \r\n" );
			break;
		case 5:                                         //   终端恢复出厂设置

			if( SysConf_struct.Version_ID == SYSID )    //  check  wether need  update  or not
			{
				SysConf_struct.Version_ID = SYSID + 1;
				Api_Config_write( config, ID_CONF_SYS, (u8*)&SysConf_struct, sizeof( SysConf_struct ) );
				Systerm_Reset_counter	= Max_SystemCounter;
				ISP_resetFlag			= 2;            //   借助远程下载重启机制复位系统
			}
			rt_kprintf( "\r\n 恢复出厂设置 \r\n" );
			break;
		case 6:                                         //   关闭数据通信
			SD_ACKflag.f_CentreCMDack_0001H = 5;
			rt_kprintf( "\r\n 关闭数据通信 \r\n" );
			break;
		case 7:                                         //   关闭所有无线通信
			SD_ACKflag.f_CentreCMDack_0001H = 5;
			rt_kprintf( "\r\n 关闭所有通信 \r\n" );
			break;
		default:
			return false;
	}
	return true;
}

//-------------------------------------------------------------------
void CenterSet_subService_8701H( u8 cmd, u8*Instr )
{
	switch( cmd )
	{
		case 0x81:                                                                  //	  中心设置 驾驶员代码  驾驶证号码
			memset( JT808Conf_struct.Driver_Info.DriverCard_ID, 0, 18 );
			//  驾驶员代码没有处理 3个字节
			memcpy( JT808Conf_struct.Driver_Info.DriveCode, Instr, 3 );
			memcpy( JT808Conf_struct.Driver_Info.DriverCard_ID, Instr + 3, 18 );    //只要驾驶证号码
			Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
			break;

		case 0x82:                                                                  //	  中心设置车牌号
			memset( (u8*)&JT808Conf_struct.Vechicle_Info, 0, sizeof( JT808Conf_struct.Vechicle_Info ) );

			memcpy( JT808Conf_struct.Vechicle_Info.Vech_VIN, Instr, 17 );
			memcpy( JT808Conf_struct.Vechicle_Info.Vech_Num, Instr + 17, 12 );
			memcpy( JT808Conf_struct.Vechicle_Info.Vech_Type, Instr + 29, 12 );

			Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
			break;
		case 0xC2:                                                                                                      //设置记录仪时钟
			// 没啥用，给个回复就行，俺有GPS校准就够了

			break;

		case 0xC3:                                                                                                      //车辆速度脉冲系数（特征系数）
			JT808Conf_struct.Vech_Character_Value = (u32)( Instr[0] << 16 ) + (u32)( Instr[1] << 8 ) + (u32)Instr[2];   // 特征系数  速度脉冲系数

			JT808Conf_struct.DF_K_adjustState	= 0;
			ModuleStatus						&= ~Status_Pcheck;
			Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
			break;
		default:
			break;
	}
}

//-----------------------------------------------
u8  CentreSet_subService_FF01H( u32 SubID, u8 infolen, u8 *Content )
{
	u32 baud = 0;
	u8	u3_Txstr[40];
	u8	Destu3_Txstr[40];
	u8	len = 0;
	u8	i	= 0;

	rt_kprintf( "\r\n    收到扩展终端设置命令 SubID=%X \r\n", SubID );

	switch( SubID )
	{
		case 0x0003: //  BNSS NMEA 输出更新率
			if( infolen != 4 )
			{
				break;
			}
			BD_EXT.BD_OutputFreq = ( Content[0] << 24 ) + ( Content[1] << 16 ) + ( Content[2] << 8 ) + Content[3];
			switch( BD_EXT.BD_OutputFreq )
			{
				case 0x00:
					baud = 500;
					gps_write( "$PCAS02,500*1A\r\n", 16 );
					rt_thread_delay( 5 );
					break;
				case 0x01:
					baud = 1000;
					gps_write( "$PCAS02,1000*2E\r\n", 16 );
					rt_thread_delay( 5 );
					break;
				case 0x02:
					baud = 2000;
					gps_write( "$PCAS02,2000*2D\r\n", 16 );
					rt_thread_delay( 5 );
					break;
				case  0x03:
					baud = 3000;
					gps_write( "$PCAS02,3000*2C\r\n", 16 );
					rt_thread_delay( 5 );
					break;
				case  0x04:
					baud = 4000;
					gps_write( "$PCAS02,4000*2B\r\n", 16 );
					rt_thread_delay( 5 );
					break;
			}
			// BD_EXT_Write();
			rt_kprintf( "\r\n  GNSS 输出更新: %dms\r\n", baud );
			break;
		case 0x0004: // GNSS 采集NMEA 数据频率
			if( infolen != 4 )
			{
				break;
			}
			BD_EXT.BD_SampleFrea = ( Content[0] << 24 ) + ( Content[1] << 16 ) + ( Content[2] << 8 ) + Content[3];
			rt_kprintf( "\r\n GNSS 采集频率: %d s\r\n", BD_EXT.BD_SampleFrea );
			break;
		case 0x0005: //  CAN 1  参数设置
			if( infolen != 4 )
			{
				break;
			}
			BD_EXT.CAN_1_Mode = ( Content[0] << 24 ) + ( Content[1] << 16 ) + ( Content[2] << 8 ) + Content[3];
			CAN_App_Init( );
			//BD_EXT_Write();
			rt_kprintf( "\r\n 中心设置CAN1 : 0x%08X\r\n", BD_EXT.CAN_1_Mode );
			break;
		case 0x0006: //  CAN2   参数设置    ----- 要和小板通信
			if( infolen != 4 )
			{
				break;
			}
			BD_EXT.CAN_2_Mode = ( Content[0] << 24 ) + ( Content[1] << 16 ) + ( Content[2] << 8 ) + Content[3];
			// BD_EXT_Write();
			memset( u3_Txstr, 0, sizeof( u3_Txstr ) );
			memset( Destu3_Txstr, 0, sizeof( Destu3_Txstr ) );
			u3_Txstr[0] = 0x7E; // 头
			u3_Txstr[1] = 0x33; //  CAN 相关
			u3_Txstr[2] = 0x01; //  参数设置
			u3_Txstr[3] = ( BD_EXT.CAN_2_Mode >> 24 );
			u3_Txstr[4] = ( BD_EXT.CAN_2_Mode >> 16 );
			u3_Txstr[5] = ( BD_EXT.CAN_2_Mode >> 8 );
			u3_Txstr[6] = ( BD_EXT.CAN_2_Mode );
			u3_Txstr[7] = 0x7E;

			Destu3_Txstr[0]			= 0x7E;
			len						= Protocol_808_Encode( Destu3_Txstr + 1, u3_Txstr + 1, 6 );
			Destu3_Txstr[len + 1]	= 0x7E;

			rt_kprintf( "\r\n U3_orginal:" );
			for( i = 0; i < 8; i++ )
			{
				rt_kprintf( "% 02X", u3_Txstr[i] );
			}
			rt_kprintf( "\r\nU3_len=%d \r\n", len );
			for( i = 0; i < len + 2; i++ )
			{
				rt_kprintf( "% 02X", Destu3_Txstr[i] );
			}
			// U3_PutData(Destu3_Txstr,len+2);  //  发送给串口
			rt_device_write( &Device_CAN2, 0, Destu3_Txstr, len + 2 );
			rt_kprintf( "\r\n 中心设置CAN2 : 0x%08X\r\n", BD_EXT.CAN_2_Mode );
			break;
		case 0x0007: //  碰撞参数设置
			if( infolen != 4 )
			{
				break;
			}
			BD_EXT.Collision_Check = ( Content[0] << 24 ) + ( Content[1] << 16 ) + ( Content[2] << 8 ) + Content[3];
			//BD_EXT_Write();
			memset( u3_Txstr, 0, sizeof( u3_Txstr ) );
			memset( Destu3_Txstr, 0, sizeof( Destu3_Txstr ) );
			u3_Txstr[0] = 0x7E; // 头
			u3_Txstr[1] = 0x32; //  CAN 相关
			u3_Txstr[2] = 0x01; //  参数设置
			u3_Txstr[3] = ( BD_EXT.Collision_Check >> 24 );
			u3_Txstr[4] = ( BD_EXT.Collision_Check >> 16 );
			u3_Txstr[5] = ( BD_EXT.Collision_Check >> 8 );
			u3_Txstr[6] = BD_EXT.Collision_Check;
			u3_Txstr[7] = 0x7E;

			Destu3_Txstr[0]			= 0x7E;
			len						= Protocol_808_Encode( Destu3_Txstr + 1, u3_Txstr + 1, 6 );
			Destu3_Txstr[len + 1]	= 0x7E;

			//   设置配置碰撞参数
			mma8451_config( (uint16_t)( BD_EXT.Collision_Check >> 16 ), (uint16_t)( BD_EXT.Collision_Check ) );
			rt_kprintf( "\r\n 中心设置碰撞参数: 0x%08X\r\n", BD_EXT.Collision_Check );;
			break;

		default:
			return false;
	}
	rt_thread_delay( 20 );
	return true;
}

//--------------------------------------------------
u8  CentreSet_subService_FF03H( u32 SubID, u8 infolen, u8 *Content )
{
	u8	i = 0;
	u8	u3_Txstr[40];
	u8	Destu3_Txstr[40];
	u8	len = 0;

	rt_kprintf( "\r\n    收到扩展终端参数设置1 命令 SubID=%X \r\n", SubID );

	switch( SubID )
	{
		case 0x0001: // CAN ID 设置
			if( infolen < 4 )
			{
				break;
			}
			// Content[0];  //  设置属性
			//Content[1] ;//本消息中包含CAN ID 的数量
			//------------------------------------
			//Content[2];  //  CAN ID 的ID
			if( Content[3] & 0x80 )                                                                                 //  CAN ID   的属性
			{
				BD_EXT.CAN_2_ID = ( Content[4] << 24 ) + ( Content[5] << 16 ) + ( Content[6] << 8 ) + Content[7];   //
				if( Content[3] & 0x40 )
				{
					BD_EXT.CAN_2_Type = 1;                                                                          // 标准帧
				}else
				{
					BD_EXT.CAN_2_Type = 0;
				}
				BD_EXT.CAN_2_TransDuration = ( Content[9] << 8 ) + Content[10];                                     // 0   表示停止

				//     得有个和小板通信的处理
				memset( Destu3_Txstr, 0, sizeof( Destu3_Txstr ) );
				u3_Txstr[0]		= 0x7E;                                                                             // 头
				u3_Txstr[1]		= 0x33;                                                                             //  CAN 相关
				u3_Txstr[2]		= 0x02;                                                                             //  参数设置
				u3_Txstr[3]		= Content[3];                                                                       // 属性
				u3_Txstr[4]		= Content[4];                                                                       //  ID
				u3_Txstr[5]		= Content[5];
				u3_Txstr[6]		= Content[6];
				u3_Txstr[7]		= Content[7];
				u3_Txstr[8]		= Content[8];                                                                       // ID
				u3_Txstr[9]		= Content[9];                                                                       //
				u3_Txstr[10]	= Content[10];
				u3_Txstr[11]	= 0x7E;

				Destu3_Txstr[0]			= 0x7E;
				len						= Protocol_808_Encode( Destu3_Txstr + 1, u3_Txstr + 1, 10 );
				Destu3_Txstr[len + 1]	= 0x7E;

				rt_kprintf( "\r\nU3_len=%d   :\r\n", len );
				for( i = 0; i < len + 2; i++ )
				{
					rt_kprintf( "% 02X", Destu3_Txstr[i] );
				}

				// U3_PutData(Destu3_Txstr,len+2);  //  发送给串口
				rt_device_write( &Device_CAN2, 0, Destu3_Txstr, len + 2 );
				rt_kprintf( "\r\n 中心设置CAN2 : 0x%08X   Dur: %d s\r\n", BD_EXT.CAN_2_ID, BD_EXT.CAN_2_TransDuration );
				//----------------------------------
			}else
			{
				BD_EXT.CAN_1_ID = ( Content[4] << 24 ) + ( Content[5] << 16 ) + ( Content[6] << 8 ) + Content[7];   //
				if( Content[3] & 0x40 )
				{
					BD_EXT.CAN_1_Type = 1;                                                                          // 标准帧
				}else
				{
					BD_EXT.CAN_1_Type = 0;
				}
				BD_EXT.CAN_1_TransDuration = ( Content[9] << 8 ) + Content[10];                                     // 0   表示停止

				rt_kprintf( "\r\n 中心设置CAN1 : 0x%08X   Dur: %d s\r\n", BD_EXT.CAN_1_ID, BD_EXT.CAN_1_TransDuration );
			}
			BD_EXT_Write( );
			break;
		case 0x0002:                                                                                                // 文本信息标志含义
			                                                                                                        // Content[0]; // 没用
			                                                                                                        //if((Content[1]==0)||(Content[1]==1))  //  部分类型都给显示屏
		{
			memset( TextInfo.TEXT_Content, 0, sizeof( TextInfo.TEXT_Content ) );
			DwinLCD.TxInfolen = AsciiToGb( TextInfo.TEXT_Content, infolen - 2, Content + 2 );
			//memcpy(TextInfo.TEXT_Content,Content+2,infolen-2);
			TextInfo.TEXT_SD_FLAG = 1;                                                                              // 置发送给显示屏标志位  // ||||||||||||||||||||||||||||||||||
			rt_kprintf( "\r\n  CAN 文本:  " );
			for( i = 0; i < DwinLCD.TxInfolen; i++ )
			{
				rt_kprintf( "%c", TextInfo.TEXT_Content[i] );
			}
			rt_kprintf( "\r\n " );
		}

