nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
#ifdef LCD_5inch
			//======  信息都在屏幕上显示
			memset( DwinLCD.TXT_content, 0, sizeof( DwinLCD.TXT_content ) );
			DwinLCD.TXT_contentLen	= AsciiToGb( DwinLCD.TXT_content, infolen - 2, Content + 2 );
			DwinLCD.Type			= LCD_SDTXT;

#endif

			break;
		default:
			return false;
	}
	return true;
}

//-------------------------------------------
void  Media_Start_Init( u8 MdType, u8 MdCodeType )
{
	MediaObj.Media_Type				= MdType;       //	指定当前传输多媒体的类型   0  表示图片
	MediaObj.Media_CodeType			= MdCodeType;   //  多媒体编码格式   0  表示JPEG	格式
	MediaObj.SD_media_Flag			= 1;            //  置多媒体事件信息发送标志位  ，开始图片传输
	MediaObj.SD_Eventstate			= 1;            //  开始处于发送状态
	MediaObj.RSD_State				= 0;
	MediaObj.RSD_Timer				= 0;
	MediaObj.RSD_total				= 0;
	MediaObj.RSD_Reader				= 0;
	MediaObj.SD_Data_Flag			= 0;
	MediaObj.Media_transmittingFlag = 0;
	//------------  add  for debuging   --------------
	// Media_Clear_State();  //  clear


	/*  if(0==MediaObj.Media_Type)
	   {
	   Photo_sdState.photo_sending=enable;
	   Photo_sdState.SD_packetNum=1; // 第一包开始
	   rt_kprintf("\r\n 开始上传照片! ....\r\n");
	   }
	 */
	//----------------------------------------------------
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void Media_Clear_State( void )
{
	// 不清楚Meia Type
	MediaObj.MaxSd_counter			= 0;
	MediaObj.SD_Eventstate			= 0;
	MediaObj.SD_timer				= 0;
	MediaObj.SD_media_Flag			= 0;
	MediaObj.SD_Data_Flag			= 0;
	MediaObj.RSD_State				= 0;
	MediaObj.RSD_Timer				= 0;
	MediaObj.RSD_total				= 0;
	MediaObj.RSD_Reader				= 0;
	MediaObj.Media_transmittingFlag = 0;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void  Media_Timer( void )
{
	if( 1 == MediaObj.SD_Eventstate )
	{
		MediaObj.SD_timer++;
		if( MediaObj.SD_timer > 6 )
		{
			MediaObj.SD_timer		= 0;
			MediaObj.SD_media_Flag	= 1;
			MediaObj.MaxSd_counter++;
			if( MediaObj.MaxSd_counter > 5 )
			{
				Media_Clear_State( );
			}
		}
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void Media_RSdMode_Timer( void )
{
    //   多媒体列表重传 
	if( ( 1 == MediaObj.RSD_State ) )
	{
		MediaObj.RSD_Timer++;
		if( MediaObj.RSD_Timer > 35 )
		{
			MediaObj.RSD_Timer		= 0;
			MediaObj.SD_Data_Flag	= 1;    // 置重传发送多媒体信息标志位
			switch( MediaObj.Media_Type )   //   图片重传包数
			{
				case 0:                     //  图像
					Photo_sdState.SD_packetNum	= MediaObj.Media_ReSdList[MediaObj.RSD_Reader]; 
					Photo_sdState.SD_flag		= 1;
					break;
				case 1:                     // 音频
					Sound_sdState.SD_packetNum	= MediaObj.Media_ReSdList[MediaObj.RSD_Reader];
					Sound_sdState.SD_flag		= 1;
					break;
				case 2:                     // 视频
					Video_sdState.SD_packetNum	= MediaObj.Media_ReSdList[MediaObj.RSD_Reader];
					Video_sdState.SD_flag		= 1;
					break;
				default:
					break;
			}
			//-----  重传列表 递增 -----------
			MediaObj.RSD_Reader++;
			// rt_kprintf("\r\n	  MediaObj.RSD_Reader++  =%d\r\n",MediaObj.RSD_Reader);
			if( MediaObj.RSD_Reader == MediaObj.RSD_total )
			{
				MediaObj.RSD_State = 2; //  置位等待状态，等待着中心再发重传指令
			}
		}
	}else
	if( 2 == MediaObj.RSD_State )
	{
		MediaObj.RSD_Timer++;
		if( MediaObj.RSD_Timer > 140 )  //   如果状态一直在等待且超过30s择清除状态
		{
			switch( MediaObj.Media_Type )
			{
				case 0:                 // 图像
					Photo_send_end( );  // 拍照上传结束

					break;
				case 1:                 // 音频
					Sound_send_end( );
					break;
				case 2:                 // 视频
					Video_send_end( );
					break;
				default:
					break;
			}
			Media_Clear_State( );
			rt_kprintf( "\r\n 信息重传超时结束! \r\n" );

			//Check_MultiTakeResult_b4Trans();  // 多路摄像头拍照状态检测
		}
	}

    //     记录仪列表重传 定时处理
    
	if( ( 1 == Recode_Obj.RSD_State ) )
	{
		Recode_Obj.RSD_Timer++;
		if( Recode_Obj.RSD_Timer > 35 )
		{
			Recode_Obj.RSD_Timer		= 0;
            Recode_Obj.SD_Data_Flag	= 1; 

            Recode_Obj.Current_pkt_num	= Recode_Obj.Media_ReSdList[Recode_Obj.RSD_Reader];
			//  如果重传列表第一包为1  那么不传第1 包，直接跳过
			if(Recode_Obj.Current_pkt_num==1)
			 {
			    Recode_Obj.RSD_Reader++;
				rt_kprintf( "\r\n --- 重传列表第一项为第1 包 ，jump 不处理 \r\n" );
			 }
			//-----  重传列表 递增 -----------
			Recode_Obj.RSD_Reader++;
			// rt_kprintf("\r\n	  MediaObj.RSD_Reader++  =%d\r\n",MediaObj.RSD_Reader);
			if( Recode_Obj.RSD_Reader > Recode_Obj.RSD_total )
			{
				Recode_Obj.RSD_State = 2; //  置位等待状态，等待着中心再发重传指令
			}
		}
	}	    
	if( 2 == Recode_Obj.RSD_State )
	{
		Recode_Obj.RSD_Timer++;
		if( Recode_Obj.RSD_Timer > 140 )  //   如果状态一直在等待且超过30s择清除状态
		{
		   Recorder_init(0);
           rt_kprintf( "\r\n 记录仪信息重传超时结束! \r\n" );
	       if(Recode_Obj.Transmit_running==1)
        	{
        	  Rcorder_Recover(); 
              rt_kprintf( "\r\n 顺序执行尚未完成  current=%d  total=%d\r\n",Recode_Obj.Current_pkt_num,Recode_Obj.Total_pkt_num);
        	}
		}
	}

	
}

#ifdef   MEDIA
//-------- photo send -------------------------------------
void Photo_send_start( u16 Numpic )
{
//  UINT ByteRead;
	// FIL FileCurrent;

	rt_kprintf( "   \r\n  Photo_send_start =%d \r\n", Numpic );
	Photo_sdState.photo_sending		= disable;
	Photo_sdState.SD_flag			= 0;
	Photo_sdState.SD_packetNum		= 1; // 从1 开始
	Photo_sdState.Exeption_timer	= 0;

	if( Camera_Number == 1 )
	{
		PicFileSize = Api_DFdirectory_Query( camera_1, 1 );
	} else
	if( Camera_Number == 2 )
	{
		PicFileSize = Api_DFdirectory_Query( camera_2, 1 );
	} else
	if( Camera_Number == 3 )
	{
		PicFileSize = Api_DFdirectory_Query( camera_3, 1 );
	} else
	if( Camera_Number == 4 )
	{
		PicFileSize = Api_DFdirectory_Query( camera_4, 1 );
	}

	//	 DF_ReadFlash(pic_current_page, 0,PictureName, 23);
	//      Camera_Number=PictureName[18];
	//      memcpy((u8*)&PicFileSize,PictureName+19,4);
	//pic_current_page++; //指向文件内容
	//pic_PageIn_offset=0;// 图片读取页内偏移地址
	// rt_kprintf("\r\n    open Pic =%s",PictureName);

	if( PicFileSize % 512 )
	{
		Photo_sdState.Total_packetNum = PicFileSize / 512 + 1;
	} else
	{
		Photo_sdState.Total_packetNum = PicFileSize / 512;
	}

	rt_kprintf( "\r\n    Camera %d  ReadpicStart total :%d ，Pagesize: %d Bytes\r\n\r\n", Camera_Number, Photo_sdState.Total_packetNum, PicFileSize );
	if( ( Camera_Number == 0 ) || ( Photo_sdState.Total_packetNum == 0 ) )
	{
		Photo_send_end( ); // clear  state
		rt_kprintf( "\r\n  图片总包数为空 ，摄像头序号为0 ，发送拍照失败到中心 \r\n" );
	}

	// -------  MultiMedia Related --------
	Media_Start_Init( 0, 0 );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u8  Sound_send_start( void )
{
	u8	sound_name[20];
	u16 i;
//  u8  oldstate=0;
//  u16 i2,j;
	// u8  WrieEnd=0,LeftLen=0;

	Sound_sdState.photo_sending		= disable;
	Sound_sdState.SD_flag			= 0;
	Sound_sdState.SD_packetNum		= 1; // 从1 开始
	Sound_sdState.Exeption_timer	= 0;

	//---  Speex_Init();	 // speachX 初始化
	// 1. 查找最新的文件


