nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
/*  memset((u8*)&MediaIndex,0,sizeof(MediaIndex));
   for(i=0;i<8;i++)
   {
   Api_RecordNum_Read(voice_index, i+1, (u8*)&MediaIndex, sizeof(MediaIndex));
        if(MediaIndex.Effective_Flag==1)
        {
            break;
   }
   }
   if(MediaIndex.Effective_Flag)
   {
   rt_kprintf("\r\n 索引filename:%s\r\n",MediaIndex.FileName);
   }
   else
   {
      rt_kprintf("\r\n 没有已存储的音频文件 \r\n");
      return false	;
   }

 */

	//	2.	创建wav 文件

	//	3. 文件大小
	// file name
	memset( sound_name, 0, sizeof( sound_name ) );
	DF_ReadFlash( SoundStart_offdet, 4, sound_name, 20 );
	SrcFileSize = Api_DFdirectory_Query( voice, 1 );
	//  Sound_sdState.Total_packetNum=(SrcFileSize/512); // 每包100个字节
	if( SrcFileSize % 512 )
	{
		Sound_sdState.Total_packetNum = SrcFileSize / 512 + 1;
	} else
	{
		Sound_sdState.Total_packetNum = SrcFileSize / 512;
	}
	rt_kprintf( "\r\n	文件名: %s大小: %d Bytes  totalpacketnum=%d \r\n", sound_name, SrcFileSize, Sound_sdState.Total_packetNum );

	// -------  MultiMedia Related --------
	//  Media_Start_Init(1,5); // 音频  wav 格式   0:JPEG ;   1: TIF ;   2:MP3;  3:WAV  4: WMV  其他保留
	//    5   amr
	Media_Start_Init( 1, 99 ); // 有word文档要求 对于非mp3  和 wav的实用99
	return true;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u8  MP3_send_start( void )
{
	u8 mp3_name[13];
	mp3_sendstate					= 1;
	Sound_sdState.photo_sending		= disable;
	Sound_sdState.SD_flag			= 0;
	Sound_sdState.SD_packetNum		= 1; // 从1 开始
	Sound_sdState.Exeption_timer	= 0;

	memset( mp3_name, 0, sizeof( mp3_name ) );
	memcpy( mp3_name, "ch12.mp3", 8 );

	if( mp3_fsize % 512 )
	{
		Sound_sdState.Total_packetNum = mp3_fsize / 512 + 1;
	} else
	{
		Sound_sdState.Total_packetNum = mp3_fsize / 512;
	}

	rt_kprintf( "\r\n  mp3文件名称:%s    文件大小  %d Bytes  \r\n", mp3_name, mp3_fsize );

	// -------  MultiMedia Related --------
	Media_Start_Init( 1, 2 ); // 音频  wav 格式
	return true;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u8  Video_send_start( void )
{
	u8 video_name[13];

	wmv_sendstate					= 1;
	Video_sdState.photo_sending		= disable;
	Video_sdState.SD_flag			= 0;
	Video_sdState.SD_packetNum		= 1; // 从1 开始
	Video_sdState.Exeption_timer	= 0;

	memset( video_name, 0, sizeof( video_name ) );
	memcpy( video_name, "ch1.wmv", 7 );

	if( wmv_fsize % 512 )
	{
		Video_sdState.Total_packetNum = wmv_fsize / 512 + 1;
	} else
	{
		Video_sdState.Total_packetNum = wmv_fsize / 512;
	}

	rt_kprintf( "\r\n  wmv文件名称:%s    文件大小  %d Bytes  \r\n", video_name, wmv_fsize );

	// -------  MultiMedia Related --------
	Media_Start_Init( 2, 4 ); // 音频  wav 格式
	return true;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u8   DrvRecoder_send_start( void )
{
	DrvRecoder_sdState.photo_sending	= disable;
	DrvRecoder_sdState.SD_flag			= 0;
	DrvRecoder_sdState.SD_packetNum		= 1;    // 从1 开始
	DrvRecoder_sdState.Exeption_timer	= 0;

	Media_Start_Init( 3, 0 );                   // 行车记录仪
	return true;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u8  BlindZoneData_send_start( void )
{
	BlindZone_sdState.photo_sending		= disable;
	BlindZone_sdState.SD_flag			= 0;
	BlindZone_sdState.SD_packetNum		= 1;    // 从1 开始
	BlindZone_sdState.Exeption_timer	= 0;

       BlindZone_sdState.Total_packetNum=BLIND_NUM/MQ_PKNUM;

	MediaObj.Media_Type = 4;                    // 盲区

	// Media_Start_Init(4,0); // 盲区
	return true;
}

//==========================================================
void Photo_send_end( void )
{
	Photo_sdState.photo_sending		= 0;
	Photo_sdState.SD_flag			= 0;
	Photo_sdState.SD_packetNum		= 0;
	Photo_sdState.Total_packetNum	= 0;
	Photo_sdState.Exeption_timer	= 0;
	MediaObj.Media_transmittingFlag = 0; // clear
	Media_Clear_State( );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void Sound_send_end( void )
{
	Sound_sdState.photo_sending		= 0;
	Sound_sdState.SD_flag			= 0;
	Sound_sdState.SD_packetNum		= 0;
	Sound_sdState.Total_packetNum	= 0;
	Sound_sdState.Exeption_timer	= 0;
	MediaObj.Media_transmittingFlag = 0;    // clear
	mp3_sendstate					= 0;
	VocREC.running					= 0;    // clear
	Media_Clear_State( );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void Video_send_end( void )
{
	Video_sdState.photo_sending		= 0;
	Video_sdState.SD_flag			= 0;
	Video_sdState.SD_packetNum		= 0;
	Video_sdState.Total_packetNum	= 0;
	Video_sdState.Exeption_timer	= 0;
	MediaObj.Media_transmittingFlag = 0; // clear
	wmv_sendstate					= 0;
	Media_Clear_State( );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void   DrvRecoder_send_end( void )
{
	DrvRecoder_sdState.photo_sending	= disable;
	DrvRecoder_sdState.SD_flag			= 0;
	DrvRecoder_sdState.SD_packetNum		= 1;    // 从1 开始
	DrvRecoder_sdState.Exeption_timer	= 0;

	MediaObj.Media_transmittingFlag = 0;        // clear
	Media_Clear_State( );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void  BlindZoneData_send_end( void )
{
	BlindZone_sdState.photo_sending		= disable;
	BlindZone_sdState.SD_flag			= 0;
	BlindZone_sdState.SD_packetNum		= 1;                                        // 从1 开始
	BlindZone_sdState.Exeption_timer	= 0;

	MediaObj.Media_transmittingFlag = 0;                                            // clear
	Media_Clear_State( );
}

//=============================================
void Video_Timer( void )
{
	if( ( Video_sdState.photo_sending == enable ) && ( 2 == MediaObj.Media_Type ) ) // 视频
	{
		if( ( Video_sdState.SD_packetNum <= Video_sdState.Total_packetNum + 1 ) && ( 2 != MediaObj.RSD_State ) )
		{                                                                           //  一下定时器在	在顺序发送过过程中	 和   收到重传开始后有效
			Video_sdState.Data_SD_counter++;
			if( Video_sdState.Data_SD_counter > 40 )
			{
				Video_sdState.Data_SD_counter	= 0;
				Video_sdState.SD_flag			= 1;
				MediaObj.SD_Data_Flag			= 1;
				Video_sdState.Exeption_timer	= 0;
				//rt_kprintf("\r\n Video send Flag \r\n");
			}
		}
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void Sound_Timer( void )
{
	if( ( Sound_sdState.photo_sending == enable ) && ( 1 == MediaObj.Media_Type ) ) // 音频
	{
		if( ( Sound_sdState.SD_packetNum <= Sound_sdState.Total_packetNum + 1 ) && ( 2 != MediaObj.RSD_State ) )
		{                                                                           //  一下定时器在	在顺序发送过过程中	 和   收到重传开始后有效
			Sound_sdState.Data_SD_counter++;
			if( Sound_sdState.Data_SD_counter > 35 )
			{
				Sound_sdState.Data_SD_counter	= 0;
				Sound_sdState.Exeption_timer	= 0;
				Sound_sdState.SD_flag			= 1;
				MediaObj.SD_Data_Flag			= 1;

