nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
				//rt_kprintf("\r\n Sound  Transmit set Flag \r\n");
			}
		}
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void Photo_Timer( void )
{
	if( ( Photo_sdState.photo_sending == enable ) && ( 0 == MediaObj.Media_Type ) )
	{
		if( ( Photo_sdState.SD_packetNum <= Photo_sdState.Total_packetNum + 1 ) && ( 2 != MediaObj.RSD_State ) )
		{                                               //  一下定时器在   在顺序发送过过程中   和   收到重传开始后有效
			Photo_sdState.Data_SD_counter++;
			if( Photo_sdState.Data_SD_counter > 35 )    //40   12
			{
				Photo_sdState.Data_SD_counter	= 0;
				Photo_sdState.Exeption_timer	= 0;
				Photo_sdState.SD_flag			= 1;
				MediaObj.SD_Data_Flag			= 1;
			}
		}
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void DrvRecoder_Timer( void )
{
	if( ( DrvRecoder_sdState.photo_sending == enable ) && ( 3 == MediaObj.Media_Type ) )
	{
		if( ( DrvRecoder_sdState.SD_packetNum <= DrvRecoder_sdState.Total_packetNum + 1 ) && ( 3 != MediaObj.RSD_State ) )
		{                                                   //  一下定时器在   在顺序发送过过程中   和   收到重传开始后有效
			DrvRecoder_sdState.Data_SD_counter++;
			if( DrvRecoder_sdState.Data_SD_counter > 35 )   //40   12
			{
				DrvRecoder_sdState.Data_SD_counter	= 0;
				DrvRecoder_sdState.Exeption_timer	= 0;
				DrvRecoder_sdState.SD_flag			= 1;
				MediaObj.SD_Data_Flag				= 1;
			}
		}
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void BlindZone_Timer( void )
{
	if( ( BlindZone_sdState.photo_sending == enable ) && ( 4 == MediaObj.Media_Type ) )
	{
		if( ( BlindZone_sdState.SD_packetNum <= BlindZone_sdState.Total_packetNum + 1 ) && ( 4 != MediaObj.RSD_State ) )
		{                                                   //  一下定时器在   在顺序发送过过程中   和   收到重传开始后有效
			BlindZone_sdState.Data_SD_counter++;
			if( BlindZone_sdState.Data_SD_counter > 35 )    //40   12
			{
				BlindZone_sdState.Data_SD_counter	= 0;
				BlindZone_sdState.Exeption_timer	= 0;
				BlindZone_sdState.SD_flag			= 1;
				MediaObj.SD_Data_Flag				= 1;
			}
		}
	}
}

//=============================================
void Meida_Trans_Exception( void )
{
	u8 resualt = 0;

	if( Photo_sdState.photo_sending == enable )
	{
		if( Photo_sdState.Exeption_timer++ > 50 )
		{
			Photo_send_end( );
			resualt = 1;
		}
	}else
	if( Sound_sdState.photo_sending == enable )
	{
		if( Sound_sdState.Exeption_timer++ > 50 )
		{
			Sound_send_end( );
			resualt = 2;
		}
	}else
	if( Video_sdState.photo_sending == enable )
	{
		if( Video_sdState.Exeption_timer++ > 50 )
		{
			Video_send_end( );
			resualt = 2;
		}
	}else
	if( DrvRecoder_sdState.photo_sending == enable )
	{
		if( DrvRecoder_sdState.Exeption_timer++ > 50 )
		{
			DrvRecoder_send_end( );
			resualt = 2;
		}
	}else
	if( BlindZone_sdState.photo_sending == enable )
	{
		if( BlindZone_sdState.Exeption_timer++ > 50 )
		{
			BlindZoneData_send_end( );
			resualt = 2;
		}
	}

	if( resualt )
	{
		rt_kprintf( "\r\n   Media  Trans  Timeout  resualt: %d\r\n", resualt );
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void Media_Timer_Service( void )
{
	//----------------------------------
	if( DataLink_Status( ) )
	{
		if( Photo_sdState.photo_sending == enable )
		{
			Photo_Timer( );
		} else
		if( Sound_sdState.photo_sending == enable )
		{
			Sound_Timer( );
		} else
		if( Video_sdState.photo_sending == enable )
		{
			Video_Timer( );
		} else
		if( DrvRecoder_sdState.photo_sending == enable )
		{
			DrvRecoder_Timer( );
		} else
		if( BlindZone_sdState.photo_sending == enable )
		{
			BlindZone_Timer( );
		}

		Media_RSdMode_Timer( );
	}
}

#endif
//------------------------------------------------------------
void DataTrans_Init( void )
{
	DataTrans.Data_RxLen	= 0;
	DataTrans.Data_TxLen	= 0;
	DataTrans.Tx_Wr			= 0;
	memset( DataTrans.DataRx, 0, sizeof( (const char*)DataTrans.DataRx ) );
	memset( DataTrans.Data_Tx, 0, sizeof( (const char*)DataTrans.Data_Tx ) );
}

//------------------------------------------------------------
void DoorCameraInit( void )
{
	DoorOpen.currentState	= 0;
	DoorOpen.BakState		= 0;
}

//-----------------------------------------------------------
void Spd_ExpInit( void )
{
	speed_Exd.current_maxSpd	= 0;
	speed_Exd.dur_seconds		= 0;
	speed_Exd.excd_status		= 0;
	memset( (char*)( speed_Exd.ex_startTime ), 0, 5 );
	speed_Exd.speed_flag = 0;
}

//-----------------------------------------------------------
void  TCP_RX_Process( u8 LinkNum )  //  ---- 808  标准协议
{
	u16 i		= 0, j = 0;         //,DF_PageAddr;
	u16 infolen = 0, contentlen = 0, msg_len = 0;
	// u8   ireg[5];
	u8	Ack_Resualt		= 1;
	u16 Ack_CMDid_8001	= 0;
	u16 Ack_Terminal_ID_8001=0;     // 终端返回的流水号  
	u8	Total_ParaNum	= 0;        // 中心设置参数总数
	u8	Process_Resualt = 0;        //  bit 表示   bit0 表示 1  bit 1 表示2
	u8	ContentRdAdd	= 0;        // 当前读取到的地址
	u8	SubInfolen		= 0;        // 子信息长度
	u8	Reg_buf[50];
	//u8   CheckResualt=0;
	u32 reg_u32 = 0;
	//u16  Devide_8003_packet_1stID=0; //  分包上传第一包 ID 
	  u8  devide_value=0; 
	//----------------      行车记录仪808 协议 接收处理   --------------------------

	//  0.  Decode
	Protocol_808_Decode( );
	//  1.  fliter head
	if( UDP_HEX_Rx[0] != 0x7e )                                 //   过滤头
	{
		return;
	}
	//  2.  check Centre Ack
	Centre_CmdID	= ( UDP_HEX_Rx[1] << 8 ) + UDP_HEX_Rx[2];   // 接收到中心消息ID
	Centre_FloatID	= ( UDP_HEX_Rx[11] << 8 ) + UDP_HEX_Rx[12]; // 接收到中心消息流水号

	//  分包判断
	if( UDP_HEX_Rx[3] & 0x20 )
	{                                                           //  分包判断
		;
	}

	//  3.   get infolen    ( 长度为消息体的长度)    不分包的话  消息头长度为12 则参与计算校验的长度 =infolen+12
	infolen		= ( u16 )( ( UDP_HEX_Rx[3] & 0x03 ) << 8 ) + ( u16 )UDP_HEX_Rx[4];
	contentlen	= infolen + 12;                                 //  参与校验字节的长度

	//  4.   Check  Fcs
	FCS_RX_UDP = 0;
	//nop;nop;
	for( i = 0; i < ( UDP_DecodeHex_Len - 3 ); i++ )            //先算出收到数据的异或和
	{
		FCS_RX_UDP ^= UDP_HEX_Rx[1 + i];
	}
	//nop;
	// ------- FCS filter -----------------
#if  0                                                          // 认证专用，暂时 屏蔽掉判断校验
	if( UDP_HEX_Rx[UDP_DecodeHex_Len - 2] != FCS_RX_UDP )       //判断校验结果
	{
		rt_kprintf( "\r\n  infolen=%d ", infolen );
		rt_kprintf( "\r\n808协议校验错误	  Caucate %x  ,RX  %x\r\n", FCS_RX_UDP, UDP_HEX_Rx[UDP_DecodeHex_Len - 2] );
		//-----------------  memset  -------------------------------------
		memset( UDP_HEX_Rx, 0, sizeof( UDP_HEX_Rx ) );
		UDP_hexRx_len = 0;
		return;
	}
#endif
	//  else
	// rt_kprintf("\r\n 808协议校验正确	  Caucate %x  ,RX  %x\r\n",FCS_RX_UDP,UDP_HEX_Rx[UDP_DecodeHex_Len-2]);

	//   5 .  Classify  Process
	rt_kprintf( "\r\n           CentreCMD = 0x%X  \r\n", Centre_CmdID );    // add for  debug

	switch( Centre_CmdID )
	{
		case  0x8001:                                                       //平台通用应答
			// 若没有分包处理的话  消息头长12  从0开始计算第12个字节是消息体得主体

			//  13 14  对应的终端消息流水号
			Ack_Terminal_ID_8001=( UDP_HEX_Rx[13] << 8 ) + UDP_HEX_Rx[14];
			//  15 16  对应终端的消息
			Ack_CMDid_8001 = ( UDP_HEX_Rx[15] << 8 ) + UDP_HEX_Rx[16];

