nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
			switch( Ack_CMDid_8001 )                                        // 判断对应终端消息的ID做区分处理
			{
				case 0x0200:                                                //  对应位置消息的应答
					//  rt_kprintf( "\r\n  0200-1");
					//----- 判断确认是否成功
					//  if(UDP_HEX_Rx[17]!=0x00)
					//	{     rt_kprintf( "\r\n  0200-2"); break;}

					//----- app msg ----------
					if( ( AppQue.sd_enable_flag == 2 ) && ( app_que_enable == 1 ) )
					{
						AppQue.sd_enable_flag = 0;
						rt_kprintf( "\r\n packet= %d  app_msg-ack", AppQue.read_num );
						AppQue.read_num++;
						if( AppQue.read_num >= 420 )
						{
							app_que_enable = 0;
							app_queenable( "0" );
							rt_kprintf( "\r\n DWJD over  =>return normal state\r\n" );
						}
					}
					//----------------------------------------
					if( Warn_Status[1] & 0x10 )         // 进出区域报警
					{
						InOut_Object.TYPE		= 0;    //圆形区域
						InOut_Object.ID			= 0;    //  ID
						InOut_Object.InOutState = 0;    //  进报警
						Warn_Status[1]			&= ~0x10;
						rt_kprintf( "\r\n进出--- 区域----报警清除!\r\n" );
					}

#ifndef   NEW_8203
					//--------------------------------
					if( Warn_Status[3] & 0x01 )         //紧急报警
					{
						StatusReg_WARN_Clear( );
						f_Exigent_warning	= 0;
						warn_flag			= 0;
						Send_warn_times		= 0;
						StatusReg_WARN_Clear( );
						rt_kprintf( "\r\n紧急报警收到应答，得清除!\r\n" );
					}
					if( Warn_Status[3] & 0x08 )         //危险报警-BD
					{
						Warn_Status[3] &= ~0x08;
					}

					//------------------------------------
					if( Warn_Status[1] & 0x10 )         // 进出区域报警
					{
						InOut_Object.TYPE		= 0;    //圆形区域
						InOut_Object.ID			= 0;    //  ID
						InOut_Object.InOutState = 0;    //  进报警
						Warn_Status[1]			&= ~0x10;
						rt_kprintf( "\r\n进出--- 区域----报警清除!\r\n" );
					}


					/* if(Warn_Status[1]&0x20)// 进出路线报警
					                                {
					                   InOut_Object.TYPE=0;//圆形区域
					                   InOut_Object.ID=0; //  ID
					                   InOut_Object.InOutState=0;//  进报警
					                   Warn_Status[1]&=~0x20;
					       rt_kprintf( "\r\n进出-----路线----报警清除!\r\n");
					                                } */
					if( Warn_Status[1] & 0x40 )         // 路段行驶时间不足、过长
					{
						Warn_Status[1] &= ~0x40;
					}
					//-----------------------------------------
					if( Warn_Status[0] & 0x08 )         //车辆非法点火
					{
						Warn_Status[0] &= ~0x08;
					}
					if( Warn_Status[0] & 0x10 )         //车辆非法位移
					{
						Warn_Status[0] &= ~0x10;
					}
					if( Warn_Status[0] & 0x80 )         //非法开门报警(终端未设置区域时，不判断非法开门)
					{
						Warn_Status[0] &= ~0x80;
					}
					if( Warn_Status[0] & 0x60 )
					{
						Warn_Status[0] &= ~0x60;        // 2 个bit    碰撞和侧翻
					}
#endif
					//------------------------------------
					rt_kprintf( "\r\nCentre ACK!\r\n" );
					
					//-------------------------------------------------------------------
					Api_cycle_Update();

					//--------------  多媒体上传相关  --------------
					if( MediaObj.Media_transmittingFlag == 1 ) // clear
					{
						MediaObj.Media_transmittingFlag = 2;
						if( Duomeiti_sdFlag == 1 )
						{
							Duomeiti_sdFlag = 0;
							Media_Clear_State( );
							Photo_send_end( );
							Sound_send_end( );
							Video_send_end( );
							rt_kprintf( "\r\n  手动上报多媒体上传处理\r\n" );
						}
						rt_kprintf( "\r\n  多媒体信息前的多媒体发送完毕 \r\n" );
					}

					break;
				case 0x0002:                                            //  心跳包的应答
					//  不用判结果了  ---
					JT808Conf_struct.DURATION.TCP_ACK_DurCnter	= 0;    //clear
					JT808Conf_struct.DURATION.TCP_SD_state		= 0;    //clear
					rt_kprintf( "\r\n  Centre  Heart ACK!\r\n" );
					break;
				case 0x0101:                                            //  终端注销应答
					if( 0 == UDP_HEX_Rx[17] )
					{                                                   // 注销成功
						memset( Reg_buf, 0, sizeof( Reg_buf ) );
						memcpy( Reg_buf, JT808Conf_struct.ConfirmCode, 20 );
						JT808Conf_struct.Regsiter_Status	= 0;
						Reg_buf[20]							= JT808Conf_struct.Regsiter_Status;
						Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
						rt_kprintf( "\r\n  终端注销成功!  \r\n" );
					}

					break;
				case 0x0102:                            //  终端鉴权

					rt_kprintf( "\r\n 收到鉴权结果: %x \r\n", UDP_HEX_Rx[17] );
					if( 0 == UDP_HEX_Rx[17] )
					{                                   // 鉴权成功
						DEV_Login.Operate_enable = 2;   // 鉴权完成
						if( DataLink_Status( ) )
						{
							DataLinkOK_Process( );
						}
						rt_kprintf( "\r\n  终端鉴权成功!  \r\n" );
					}
					break;
				case 0x0800:                // 多媒体事件信息上传
					rt_kprintf( "\r\n 多媒体事件信息上传回应! \r\n" );
					Media_Clear_State( );   //  clear

					if( 0 == MediaObj.Media_Type )
					{
						MediaObj.Media_transmittingFlag = 1;
						PositionSD_Enable( );
						Current_UDP_sd = 1;

						Photo_sdState.photo_sending = enable;
						Photo_sdState.SD_packetNum	= 1;    // 第一包开始
						PositionSD_Enable( );               //   使能上报
						rt_kprintf( "\r\n 开始上传照片! ....\r\n" );
					}else
					if( 1 == MediaObj.Media_Type )
					{
						MediaObj.Media_transmittingFlag = 1;

						Sound_sdState.photo_sending = enable;
						Sound_sdState.SD_packetNum	= 1;    // 第一包开始
						PositionSD_Enable( );               //   使能上报
						Current_UDP_sd = 1;
						rt_kprintf( "\r\n 开始上传音频! ....\r\n" );
					}else
					if( 2 == MediaObj.Media_Type )
					{
						MediaObj.Media_transmittingFlag = 1;
						PositionSD_Enable( );               //   使能上报
						Current_UDP_sd				= 1;
						Video_sdState.photo_sending = enable;
						Video_sdState.SD_packetNum	= 1;    // 第一包开始
						rt_kprintf( "\r\n 开始上传视频! ....\r\n" );
					}
					break;
				case 0x0702:
					rt_kprintf( "\r\n  驾驶员信息上报---中心应答!  \r\n" );

					break;
				case 0x0701:
					rt_kprintf( "\r\n  电子运单上报---中心应答!  \r\n" );

					break;
				case 0x0705:    //
					rt_kprintf( "\r\n can-ack" );
					break;
				case 0x0704:    // 批量应答
					rt_kprintf( "\r\n MQ packet= %d   0704H-ack", MQ_TrueUse.PacketNum );
					                   //  本地存储
                                          if(MangQU.Sd_flag==2)
										  { 	  
										       MangQU.Sd_flag=0;
											   MangQU.Sd_timer=0;
											   MangQU.Sd_timer=0;
											   
