nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
											   MangQU.PacketNum++;
											   if(MangQU.PacketNum>=(BLIND_NUM/MQ_PKNUM)) 
									  	    	{
									  	    	   MangQU.PacketNum=0;
												   MangQU.Enable_SD_state=0; 
												   rt_kprintf("\r\nReturn Normal\r\n");  
									  	    	}	
                                          }
										//  真正 存储
										    if((MQ_TrueUse.Sd_flag==2)&&(MQ_TrueUse.Enable_SD_state==1)) 
										  { 	  
										       MQ_TrueUse.Sd_flag=0; 
											   MQ_TrueUse.Sd_timer=0;
											   MQ_TrueUse.Sd_timer=0;
											   
											   MQ_TrueUse.PacketNum++;
											   if(MQ_TrueUse.PacketNum>CurrentTotal)  
									  	    	{
									  	    	   MQ_TrueUse.PacketNum=0;
												   MQ_TrueUse.Enable_SD_state=0; 
												   // 每次应答存储相关记录数目
												   DF_Write_RecordAdd(cycle_write,cycle_read,TYPE_CycleAdd);  
												   rt_kprintf("\r\nTrue Return Normal\r\n");  
									  	    	}	
                                          }
							           break; 		   

				default:
					break; 
			}

			//-------------------------------
			break;
		case  0x8100: //  监控中心对终端注册消息的应答
			//-----------------------------------------------------------
			switch( UDP_HEX_Rx[15] )
			{
				case 0: rt_kprintf( "\r\n   ----注册成功\r\n" );
					memset( JT808Conf_struct.ConfirmCode, 0, sizeof( JT808Conf_struct.ConfirmCode ) );
					memcpy( JT808Conf_struct.ConfirmCode, UDP_HEX_Rx + 16, infolen - 3 );

					memset( Reg_buf, 0, sizeof( Reg_buf ) );
					memcpy( Reg_buf, JT808Conf_struct.ConfirmCode, 20 );
					JT808Conf_struct.Regsiter_Status	= 1;
					Reg_buf[20]							= JT808Conf_struct.Regsiter_Status;
					Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
					rt_kprintf( "鉴权码: %s\r\n		   鉴权码长度: %d\r\n", JT808Conf_struct.ConfirmCode, strlen( (const char*)JT808Conf_struct.ConfirmCode ) );
					//-------- 开始鉴权 ------
					DEV_Login.Operate_enable = 1;
					break;
				case 1: rt_kprintf( "\r\n   ----车辆已被注册\r\n" );
					break;
				case 2: rt_kprintf( "\r\n   ----数据库中无该车辆\r\n" );
					break;
				case 3: rt_kprintf( "\r\n   ----终端已被注册\r\n" );
					if( 0 == JT808Conf_struct.Regsiter_Status )
					{
						;                               //JT808Conf_struct.Regsiter_Status=2;  // not  1
						                                //DEV_regist.DeRegst_sd=1;
					}else
					if( 1 == JT808Conf_struct.Regsiter_Status )
					{
						DEV_Login.Operate_enable = 1;   //开始鉴权
					}
					break;
				case 4: rt_kprintf( "\r\n   ----数据库中无该终端\r\n" );
					break;
			}
			break;
		case  0x8103:                                   //  设置终端参数
			//  Ack_Resualt=0;
			if( contentlen )
			{                                           // 和中心商议好了每次只下发操作一项设置
				Total_ParaNum = UDP_HEX_Rx[13];         // 中心设置参数总数
				rt_kprintf( "\r\n Set ParametersNum =%d  \r\n", Total_ParaNum );
				//-------------------------------------------------------------------
				ContentRdAdd	= 14;
				Process_Resualt = 0;                    // clear resualt
				for( i = 0; i < Total_ParaNum; i++ )
				{
					//  数类型是DWORD 4 个字节
					SubCMD_8103H = ( UDP_HEX_Rx[ContentRdAdd] << 24 ) + ( UDP_HEX_Rx[ContentRdAdd + 1] << 16 ) + ( UDP_HEX_Rx[ContentRdAdd + 2] << 8 ) + UDP_HEX_Rx[ContentRdAdd + 3];
					//  子信息长度
					SubInfolen = UDP_HEX_Rx[ContentRdAdd + 4];
					//  处理子信息 如果设置成功把相应Bit 位置为 1 否则保持 0
					if( CentreSet_subService_8103H( SubCMD_8103H, SubInfolen, UDP_HEX_Rx + ContentRdAdd + 5 ) )
					{
						Process_Resualt |= ( 0x01 << i );
					}
					//  移动偏移地址
					ContentRdAdd += 5 + UDP_HEX_Rx[ContentRdAdd + 4]; // 偏移下标
				}

				//--------------判断所有的设置结果  ---------------


				/* for(i=0;i<Total_ParaNum;i++)
				   {
				     if(!((Process_Resualt>>0)&0x01))
				   {
				          Ack_Resualt=1; //  1  表示失败
				          break;
				   }
				   if(i==(Total_ParaNum-1))  //  设置到最后一个确认成功
				   Ack_Resualt=0;  //  成功/确认
				   }*/
				Ack_Resualt = 0;
			}

			//-------------------------------------------------------------------
			if( SD_ACKflag.f_CentreCMDack_0001H == 2 )
			{
				Ack_Resualt							= 0;
				SD_ACKflag.f_CentreCMDack_resualt	= Ack_Resualt;
			}else
			if( SD_ACKflag.f_CentreCMDack_0001H == 0 )
			{
				SD_ACKflag.f_CentreCMDack_0001H		= 1;
				SD_ACKflag.f_CentreCMDack_resualt	= Ack_Resualt;
			}
			rt_kprintf( "\r\n  Set Device !\r\n" );

			break;
		case  0x8104:                           //  查询终端参数
			SD_ACKflag.f_SettingPram_0104H = 1; // 不管什么内容回复统一结果
			rt_kprintf( "\r\n  中心查询终端参数 !\r\n" );
			break;
		case  0x8105:                           // 终端控制
			// Ack_Resualt=0;
			rt_kprintf( "\r\ny  终端控制 -1!\r\n" );
			if( contentlen )
			{                                   // 和中心商议好了每次只下发操作一项设置
				Total_ParaNum = UDP_HEX_Rx[13]; //  终端控制命令字
				rt_kprintf( "\r\n Set ParametersNum =%d  \r\n", Total_ParaNum );
				//-------------------------------------------------------------------
				if( CentreSet_subService_8105H( Total_ParaNum, contentlen - 1, UDP_HEX_Rx + 14 ) )
				{
					Ack_Resualt = 0;            // 返回成功
				}
			}

			//-------------------------------------------------------------------
			Ack_Resualt = 0;
			if( SD_ACKflag.f_CentreCMDack_0001H == 0 )
			{
				SD_ACKflag.f_CentreCMDack_0001H		= 1;
				SD_ACKflag.f_CentreCMDack_resualt	= Ack_Resualt;
			}
			rt_kprintf( "\r\ny  终端控制 -1!\r\n" );

			break;
		case  0x8201:   // 位置信息查询    位置信息查询消息体为空
			SD_ACKflag.f_CurrentPosition_0201H = 1;
			rt_kprintf( "\r\n  位置信息查询 !\r\n" );
			break;
		case  0x8202:   // 临时位置跟踪控制
			Ack_Resualt = 0;

			//  13 14  时间间隔
			JT808Conf_struct.RT_LOCK.Lock_Dur = ( UDP_HEX_Rx[13] << 8 ) + UDP_HEX_Rx[14];
			//  15 16  17 18 对应终端的消息
			JT808Conf_struct.RT_LOCK.Lock_KeepDur = ( UDP_HEX_Rx[15] << 24 ) + ( UDP_HEX_Rx[16] << 16 ) + ( UDP_HEX_Rx[17] << 8 ) + UDP_HEX_Rx[18];

			JT808Conf_struct.RT_LOCK.Lock_state			= 1;                                        // Enable Flag
			JT808Conf_struct.RT_LOCK.Lock_KeepCnter		= 0;                                        //  保持计数器
			Current_SD_Duration							= JT808Conf_struct.RT_LOCK.Lock_KeepDur;    //更改发送间隔
			JT808Conf_struct.SD_MODE.DUR_TOTALMODE		= 1;                                        // 更新定时相关状态位
			JT808Conf_struct.SD_MODE.Dur_DefaultMode	= 1;
			//  保存配置
			Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );

			// if(SD_ACKflag.f_CentreCMDack_0001H==0)
			{
				Ack_Resualt							= 0;
				SD_ACKflag.f_CentreCMDack_0001H		= 1;
				SD_ACKflag.f_CentreCMDack_resualt	= Ack_Resualt;
			}
			rt_kprintf( "\r\n  临时位置跟踪控制!\r\n" );
			break;
		case  0x8300:                       //  文本信息下发
			Ack_Resualt			= 0;
			TextInfo.TEXT_FLAG	= UDP_HEX_Rx[13];
			if( TextInfo.TEXT_FLAG & 0x09 ) // 检测是否给TTS终端  ，紧急也给TTS播报
			{
				Dev_Voice.CMD_Type = '2';
				memset( Dev_Voice.Play_info, 0, sizeof( Dev_Voice.Play_info ) );
				memcpy( Dev_Voice.Play_info, UDP_HEX_Rx + 14, infolen - 1 );
				Dev_Voice.info_sdFlag = 1;

				//#ifdef LCD_5inch
				//DwinLCD.Type=LCD_SDTXT;
				// memset(DwinLCD.TXT_content,0,sizeof(DwinLCD.TXT_content));
				//DwinLCD.TXT_contentLen=AsciiToGb(DwinLCD.TXT_content,infolen-1,UDP_HEX_Rx+14);
				//#endif
				//  TTS
				TTS_Get_Data( UDP_HEX_Rx + 14, infolen - 1 );
			}
			if( ( TextInfo.TEXT_FLAG & 0x04 ) || ( TextInfo.TEXT_FLAG & 0x01 ) )    // 检测是否给终端显示器
			{
				memset( TextInfo.TEXT_Content, 0, sizeof( TextInfo.TEXT_Content ) );
				memcpy( TextInfo.TEXT_Content, UDP_HEX_Rx + 14, infolen - 1 );
				TextInfo.TEXT_SD_FLAG = 1;                                          // 置发送给显示屏标志位  // ||||||||||||||||||||||||||||||||||

				//========================================
				TextInforCounter++;
				rt_kprintf( "\r\n写入收到的第 %d 条信息,消息长度=%d,消息:%s", TextInforCounter, infolen - 1, TextInfo.TEXT_Content );
				TEXTMSG_Write( TextInforCounter, 1, infolen - 1, TextInfo.TEXT_Content );
				//========================================
			}

