nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
#ifdef LCD_5inch
			//======  信息都在屏幕上显示
			DwinLCD.Type = LCD_SDTXT;
			memset( DwinLCD.TXT_content, 0, sizeof( DwinLCD.TXT_content ) );
			DwinLCD.TXT_contentLen = AsciiToGb( DwinLCD.TXT_content, infolen - 1, UDP_HEX_Rx + 14 );
#endif

			//------- 返回 ----
			//  if(SD_ACKflag.f_CentreCMDack_0001H==0)
			{
				Ack_Resualt							= 0;
				SD_ACKflag.f_CentreCMDack_0001H		= 1;
				SD_ACKflag.f_CentreCMDack_resualt	= Ack_Resualt;
			}
			rt_kprintf( "\r\n 文本信息: %s\r\n", TextInfo.TEXT_Content );
			break;
		case  0x8301:                                   //  事件设置
			if( contentlen )
			{
				//--- 设置类型--
				switch( UDP_HEX_Rx[13] )
				{
					case 0:                             //  删除终端现有所有事件，该命令后不带后继字符
						Event_Init( 1 );
						rt_kprintf( "\r\n 删除所有事件\r\n" );
						break;
					case 1:                             // 更新事件
						if( UDP_HEX_Rx[13] == 1 )
						{
							rt_kprintf( "\r\n 更新事件\r\n" );
						}
					//break;
					case 2:                             // 追加事件
						if( UDP_HEX_Rx[13] == 2 )
						{
							rt_kprintf( "\r\n 追加事件\r\n" );
						}
					//break;
					case 3:                             // 修改事件
						if( UDP_HEX_Rx[13] == 3 )
						{
							rt_kprintf( "\r\n 修改事件\r\n" );
						}
					//break;
					case 4:                             // 删除特定事件
						if( UDP_HEX_Rx[13] == 4 )
						{
							rt_kprintf( "\r\n 删除特点事件\r\n" );
						}
						Total_ParaNum = UDP_HEX_Rx[14]; // 中心设置参数总数
						rt_kprintf( "\r\n Set ParametersNum(事件信息项总数) =%d  \r\n", Total_ParaNum );
						if( Total_ParaNum == 1 )
						{
							if( ( UDP_HEX_Rx[15] > 8 ) || ( UDP_HEX_Rx[15] == 0 ) )
							{
								EventObj.Event_ID = 0;
							} else
							{
								EventObj.Event_ID = UDP_HEX_Rx[15];
							}

							EventObj.Event_Len = UDP_HEX_Rx[16];
							memset( EventObj.Event_Str, 0, sizeof( EventObj.Event_Str ) );
							memcpy( EventObj.Event_Str, UDP_HEX_Rx + 17, EventObj.Event_Len );
							EventObj.Event_Effective = 1;
							Api_RecordNum_Write( event_808, EventObj.Event_ID, (u8*)&EventObj, sizeof( EventObj ) );
							rt_kprintf( "\r\n(事件内容1)ID=%d,Len=%d,有效性=%d(1有效)内容:%s\r\n", EventObj.Event_ID, EventObj.Event_Len, EventObj.Event_Effective, EventObj.Event_Str );
						}else
						{
							EventObj.Event_ID	= UDP_HEX_Rx[15];
							EventObj.Event_Len	= UDP_HEX_Rx[16];
							memset( EventObj.Event_Str, 0, sizeof( EventObj.Event_Str ) );
							memcpy( EventObj.Event_Str, UDP_HEX_Rx + 17, EventObj.Event_Len );
							EventObj.Event_Effective = 1;
							Api_RecordNum_Write( event_808, EventObj.Event_ID, (u8*)&EventObj, sizeof( EventObj ) );
							rt_kprintf( "\r\n(事件内容2)ID=%d,Len=%d,有效性=%d(1有效)内容:%s\r\n", EventObj.Event_ID, EventObj.Event_Len, EventObj.Event_Effective, EventObj.Event_Str );
							//
							EventObj.Event_ID	= UDP_HEX_Rx[17 + EventObj.Event_Len];
							EventObj.Event_Len	= UDP_HEX_Rx[18 + EventObj.Event_Len];
							memset( EventObj.Event_Str, 0, sizeof( EventObj.Event_Str ) );
							memcpy( EventObj.Event_Str, UDP_HEX_Rx + 19, EventObj.Event_Len );
							EventObj.Event_Effective = 1;
							Api_RecordNum_Write( event_808, EventObj.Event_ID, (u8*)&EventObj, sizeof( EventObj ) );
							rt_kprintf( "\r\n(事件内容2)ID=%d,Len=%d,有效性=%d(1有效)内容:%s\r\n", EventObj.Event_ID, EventObj.Event_Len, EventObj.Event_Effective, EventObj.Event_Str );
						}
						break;
					default:
						break;
				}

				//---------返回 -------
				// if(SD_ACKflag.f_CentreCMDack_0001H==0) // 一般回复
				{
					SD_ACKflag.f_CentreCMDack_0001H		= 1;
					Ack_Resualt							= 0;
					SD_ACKflag.f_CentreCMDack_resualt	= Ack_Resualt;
				}


				/*
				   if(SD_ACKflag.f_CurrentEventACK_0301H==0)
				   {
				   SD_ACKflag.f_CurrentEventACK_0301H=1;
				   }
				 */
			}

			break;
		case  0x8302: // 提问下发
			// if(UDP_HEX_Rx[13]&0x08)  // 检测标志是否给显示终端
			rt_kprintf( "\r\n  中心下发提问 \r\n" );
			{
				ASK_Centre.ASK_infolen = UDP_HEX_Rx[14];
				memset( ASK_Centre.ASK_info, 0, sizeof( ASK_Centre.ASK_info ) );
				memcpy( ASK_Centre.ASK_info, UDP_HEX_Rx + 15, ASK_Centre.ASK_infolen );
				rt_kprintf( "\r\n  问题: %s \r\n", ASK_Centre.ASK_info );
				memset( ASK_Centre.ASK_answer, 0, sizeof( ASK_Centre.ASK_answer ) );
				memcpy( ASK_Centre.ASK_answer, UDP_HEX_Rx + 15 + ASK_Centre.ASK_infolen, infolen - 2 - ASK_Centre.ASK_infolen );

				ASK_Centre.ASK_SdFlag		= 1;                // ||||||||||||||||||||||||||||||||||
				ASK_Centre.ASK_floatID		= Centre_FloatID;   // 备份 FloatID
				ASK_Centre.ASK_disp_Enable	= 1;
				rt_kprintf( "\r\n 提问Answer:%s\r\n", ASK_Centre.ASK_answer + 3 );

				Api_RecordNum_Write( ask_quesstion, 1, (u8*)&ASK_Centre, sizeof( ASK_Centre ) );
			}

			// if(SD_ACKflag.f_CentreCMDack_0001H==0)
			{
				Ack_Resualt							= 0;
				SD_ACKflag.f_CentreCMDack_0001H		= 1;
				SD_ACKflag.f_CentreCMDack_resualt	= Ack_Resualt;
			}

			break;
		case  0x8303:                               //  信息点播菜单设置
			                                        //--- 设置类型--
			switch( UDP_HEX_Rx[13] )
			{
				case 0:                             //  删除终端现有所有信息
					MSG_BroadCast_Init( 1 );
					rt_kprintf( "\r\n 删除信息\r\n" );
					break;
				case 1:                             // 更新菜单
					if( UDP_HEX_Rx[13] == 1 )
					{
						rt_kprintf( "\r\n 更新菜单\r\n" );
					}
				//break;
				case 2:                             // 追加菜单
					if( UDP_HEX_Rx[13] == 2 )
					{
						rt_kprintf( "\r\n 追加菜单\r\n" );
					}
				//break;
				case 3:                             // 修改菜单
					if( UDP_HEX_Rx[13] == 3 )
					{
						rt_kprintf( "\r\n 修改菜单\r\n" );
					}
					Total_ParaNum = UDP_HEX_Rx[14]; // 消息项总数
					rt_kprintf( "\r\n Set ParametersNum =%d(信息项总数)\r\n", Total_ParaNum );
					if( Total_ParaNum == 1 )        //追加1条信息
					{
						if( ( UDP_HEX_Rx[15] > 8 ) || ( UDP_HEX_Rx[15] == 0 ) )
						{
							MSG_BroadCast_Obj.INFO_TYPE = 0;
						} else
						{
							MSG_BroadCast_Obj.INFO_TYPE = UDP_HEX_Rx[15];
							MSG_BroadCast_Obj.INFO_LEN	= ( UDP_HEX_Rx[16] << 8 ) + UDP_HEX_Rx[17];
							memset( MSG_BroadCast_Obj.INFO_STR, 0, sizeof( MSG_BroadCast_Obj.INFO_STR ) );
							memcpy( MSG_BroadCast_Obj.INFO_STR, UDP_HEX_Rx + 18, MSG_BroadCast_Obj.INFO_LEN );
							MSG_BroadCast_Obj.INFO_Effective	= 1;
							MSG_BroadCast_Obj.INFO_PlyCancel	= 1;
							Api_RecordNum_Write( msg_broadcast, MSG_BroadCast_Obj.INFO_TYPE, (u8*)&MSG_BroadCast_Obj, sizeof( MSG_BroadCast_Obj ) );
							rt_kprintf( "\r\n(信息点播内容1)TYPE=%d,Len=%d,有效性=%d(1有效)内容:%s\r\n", MSG_BroadCast_Obj.INFO_TYPE, MSG_BroadCast_Obj.INFO_LEN, MSG_BroadCast_Obj.INFO_Effective, MSG_BroadCast_Obj.INFO_STR );
						}
					}else
					{
						if( ( UDP_HEX_Rx[15] > 8 ) || ( UDP_HEX_Rx[15] == 0 ) )
						{
							MSG_BroadCast_Obj.INFO_TYPE = 0;
							rt_kprintf( "\r\n(信息点播内容2) type=%d", UDP_HEX_Rx[15] );
						}else
						{
							MSG_BroadCast_Obj.INFO_TYPE = UDP_HEX_Rx[15];
							MSG_BroadCast_Obj.INFO_LEN	= ( UDP_HEX_Rx[16] << 8 ) + UDP_HEX_Rx[17];
							msg_len						= MSG_BroadCast_Obj.INFO_LEN;
							memset( MSG_BroadCast_Obj.INFO_STR, 0, sizeof( MSG_BroadCast_Obj.INFO_STR ) );
							memcpy( MSG_BroadCast_Obj.INFO_STR, UDP_HEX_Rx + 18, msg_len );
							MSG_BroadCast_Obj.INFO_Effective	= 1;
							MSG_BroadCast_Obj.INFO_PlyCancel	= 1;
							Api_RecordNum_Write( msg_broadcast, MSG_BroadCast_Obj.INFO_TYPE, (u8*)&MSG_BroadCast_Obj, sizeof( MSG_BroadCast_Obj ) );
							rt_kprintf( "\r\n(信息点播内容2)TYPE=%d,Len=%d,有效性=%d(1有效)内容:%s\r\n", MSG_BroadCast_Obj.INFO_TYPE, MSG_BroadCast_Obj.INFO_LEN, MSG_BroadCast_Obj.INFO_Effective, MSG_BroadCast_Obj.INFO_STR );
						}
						if( ( UDP_HEX_Rx[18 + msg_len] > 8 ) || ( UDP_HEX_Rx[18 + msg_len] == 0 ) )
						{
							MSG_BroadCast_Obj.INFO_TYPE = 0;
							rt_kprintf( "\r\n(信息点播内容2) type=%d", UDP_HEX_Rx[18 + msg_len] );
						}else
						{
							MSG_BroadCast_Obj.INFO_TYPE = UDP_HEX_Rx[18 + msg_len];
							MSG_BroadCast_Obj.INFO_LEN	= ( UDP_HEX_Rx[19 + msg_len] << 8 ) + UDP_HEX_Rx[20 + msg_len];
							memset( MSG_BroadCast_Obj.INFO_STR, 0, sizeof( MSG_BroadCast_Obj.INFO_STR ) );
							memcpy( MSG_BroadCast_Obj.INFO_STR, UDP_HEX_Rx + 21 + msg_len, MSG_BroadCast_Obj.INFO_LEN );
							MSG_BroadCast_Obj.INFO_Effective	= 1;
							MSG_BroadCast_Obj.INFO_PlyCancel	= 1;
							Api_RecordNum_Write( msg_broadcast, MSG_BroadCast_Obj.INFO_TYPE, (u8*)&MSG_BroadCast_Obj, sizeof( MSG_BroadCast_Obj ) );
							rt_kprintf( "\r\n(信息点播内容2)TYPE=%d,Len=%d,有效性=%d(1有效)内容:%s\r\n", MSG_BroadCast_Obj.INFO_TYPE, MSG_BroadCast_Obj.INFO_LEN, MSG_BroadCast_Obj.INFO_Effective, MSG_BroadCast_Obj.INFO_STR );
						}
					}
					break;
				default:
					break;
			}

			//---------返回 -------
			// if(SD_ACKflag.f_CentreCMDack_0001H==0) // 一般回复
			{
				SD_ACKflag.f_CentreCMDack_0001H		= 1;
				Ack_Resualt							= 0;
				SD_ACKflag.f_CentreCMDack_resualt	= Ack_Resualt;
			}


