nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
			if( ( ROUTE_Obj.Route_ID > Route_Mum ) || ( ROUTE_Obj.Route_ID == 0 ) )
			{
				ROUTE_Obj.Route_ID = 1;
			}
			ROUTE_Obj.Effective_flag = 1;
			Api_RecordNum_Write( route_line, ROUTE_Obj.Route_ID, (u8*)&ROUTE_Obj, sizeof( ROUTE_Obj ) ); // 删除对应的围栏

			//----------------
			// if(SD_ACKflag.f_CentreCMDack_0001H==0)
			{
				SD_ACKflag.f_CentreCMDack_0001H		= 1;
				Ack_Resualt							= 0;
				SD_ACKflag.f_CentreCMDack_resualt	= Ack_Resualt;
			}
			break;
		case  0x8607:                                               //  删除路线
			rt_kprintf( "\r\n  删除路线 \r\n" );
			if( 0 == UDP_HEX_Rx[13] )                               // 区域数
			{
				RouteLine_Init( );                                  // 删除所有区域
			}else
			{
				memset( (u8*)&ROUTE_Obj, 0, sizeof( ROUTE_Obj ) );  //  clear all  first
				for( i = 0; i < UDP_HEX_Rx[13]; i++ )
				{
					ROUTE_Obj.Route_ID = ( UDP_HEX_Rx[14 + i] << 24 ) + ( UDP_HEX_Rx[15 + i] << 16 ) + ( UDP_HEX_Rx[16 + i] << 8 ) + UDP_HEX_Rx[17 + i];
					if( ( ROUTE_Obj.Route_ID > Route_Mum ) || ( ROUTE_Obj.Route_ID == 0 ) )
					{
						ROUTE_Obj.Route_ID = 1;
					}
					ROUTE_Obj.Effective_flag = 0;
					Api_RecordNum_Write( route_line, ROUTE_Obj.Route_ID, (u8*)&ROUTE_Obj, sizeof( ROUTE_Obj ) ); // 删除对应的围栏
				}
			}

			//----------------
			// if(SD_ACKflag.f_CentreCMDack_0001H==0)
			{
				SD_ACKflag.f_CentreCMDack_0001H		= 1;
				Ack_Resualt							= 0;
				SD_ACKflag.f_CentreCMDack_resualt	= Ack_Resualt;
			}
			break;
		case  0x8700: //  行车记录仪数据采集命令


			/*
			                           行车记录仪发送出发开始
			 */
			rt_kprintf( "\r\n  记录仪采集命令 \r\n" );
			Recode_Obj.Float_ID = Centre_FloatID;
			
			Recode_Obj.RSD_end=0;// clear
			//Recode_Obj.CMD=UDP_HEX_Rx[13];
			//    Stuff  Hardly
			switch( UDP_HEX_Rx[13] )
			{
				case 0x00: Recode_Obj.CMD	= UDP_HEX_Rx[13];
					Recode_Obj.SD_Data_Flag = 1;
					Recode_Obj.CountStep	= 1;
					break;
				//--------- Lagre  block -------


				/*
				      cmd         maxnum
				        15H	  2
				        12H	  10
				   11H	  10
				   10H	  100
				   09H	  360
				   08H	  576

				 */
				case  0x08:  Recode_Obj.Total_pkt_num	= 720;
					Recode_Obj.Current_pkt_num			= 1;
					Recode_Obj.Bak_current_num=1;
					Recode_Obj.Transmit_running=1;  // enable transmit
					Recode_Obj.Devide_Flag				= 1;
					//--------------------------------
					Recode_Obj.CMD			= UDP_HEX_Rx[13];
					Recode_Obj.SD_Data_Flag = 1;
					Recode_Obj.CountStep	= 1;
					MediaObj.Media_Type		= 3; //行驶记录仪 只是利用类型填充ID 时候有用
					break;

				case  0x09:  Recode_Obj.Total_pkt_num	= 360;  //333----720    666--360
					Recode_Obj.Current_pkt_num			= 1; //0
					Recode_Obj.Devide_Flag				= 1;
					Recode_Obj.Bak_current_num=0;
					Recode_Obj.Transmit_running=1;  // enable transmit
					//--------------------------------
					Recode_Obj.CMD			= UDP_HEX_Rx[13];
					Recode_Obj.SD_Data_Flag = 1;
					Recode_Obj.CountStep	= 1;
					MediaObj.Media_Type		= 3; //行驶记录仪
					break;
				case  0x10:
					Recode_Obj.Total_pkt_num	= 100;
					Recode_Obj.Current_pkt_num	= 1;
					Recode_Obj.Devide_Flag		= 1;
					Recode_Obj.Bak_current_num=1;
					Recode_Obj.Transmit_running=1;  // enable transmit
					//--------------------------------
					Recode_Obj.CMD			= UDP_HEX_Rx[13];
					Recode_Obj.SD_Data_Flag = 1;
					Recode_Obj.CountStep	= 1;
					Recode_Obj.fcs				= 0;
					MediaObj.Media_Type		= 3; //行驶记录仪
					break;
				case  0x11:
					Recode_Obj.Total_pkt_num	= 100;
					Recode_Obj.Current_pkt_num	= 1;
					Recode_Obj.Devide_Flag		= 1;
					Recode_Obj.Bak_current_num=1;
					Recode_Obj.Transmit_running=1;  // enable transmit
					//------------------------------------
					Recode_Obj.CMD				= UDP_HEX_Rx[13];
					Recode_Obj.SD_Data_Flag		= 1;
					Recode_Obj.CountStep		= 1;
					Recode_Obj.fcs				= 0;
					MediaObj.Media_Type			= 3; //行驶记录仪
					break;
				case  0x12:
					Recode_Obj.Total_pkt_num	= 10;
					Recode_Obj.Current_pkt_num	= 1;
					Recode_Obj.Devide_Flag		= 1;
					Recode_Obj.Bak_current_num=1;
					Recode_Obj.Transmit_running=1;	// enable transmit

					//------------------------------------
					Recode_Obj.CMD				= UDP_HEX_Rx[13];
					Recode_Obj.SD_Data_Flag		= 1;
					Recode_Obj.CountStep		= 1;
					Recode_Obj.fcs				= 0;
					MediaObj.Media_Type			= 3; //行驶记录仪
					break;
				case  0x13:
					//--------------------------------
					Recode_Obj.CMD			= UDP_HEX_Rx[13];
					Recode_Obj.SD_Data_Flag = 1;
					Recode_Obj.CountStep	= 1;
					break;
				case  0x14:
					//--------------------------------
					Recode_Obj.CMD			= UDP_HEX_Rx[13];
					Recode_Obj.SD_Data_Flag = 1;
					Recode_Obj.CountStep	= 1;
					break;
				case  0x15:
					Recode_Obj.Current_pkt_num	= 1;
					Recode_Obj.Devide_Flag		= 1;
					Recode_Obj.Bak_current_num=1;
					Recode_Obj.Transmit_running=1;  // enable transmit
					Recode_Obj.CMD				= UDP_HEX_Rx[13];
					Recode_Obj.SD_Data_Flag		= 1;
					Recode_Obj.CountStep		= 1;
					Recode_Obj.Total_pkt_num	= 10;
					Recode_Obj.fcs				= 0;
					MediaObj.Media_Type			= 3;                        //行驶记录仪
					break;
				default:
					break;
			}

			break;
		case  0x8701:                                                       //  行驶记录仪参数下传命令
			rt_kprintf( "\r\n  记录仪参数下传 \r\n" );
			Recode_Obj.Float_ID		= Centre_FloatID;
			Recode_Obj.CMD			= UDP_HEX_Rx[13];
			Recode_Obj.SD_Data_Flag = 1;
			CenterSet_subService_8701H( Recode_Obj.CMD, UDP_HEX_Rx + 14 );  //跳过2B长度和1 保留字
			break;
		case  0x8800:                                                       //   多媒体数据上传应答
			if( infolen == 5 )
			{                                                               //  判断是否有重传ID列表，如果没有则表示中心接收完成!
				switch( MediaObj.Media_Type )
				{
					case 0:                                                 // 图像
						Photo_send_end( );                                  // 拍照上传结束
						rt_kprintf( "\r\n 图像传输结束! \r\n" );
						//------------多路拍照处理  -------
						// CheckResualt=Check_MultiTakeResult_b4Trans();

						break;
					case 1:                                                 // 音频
						Sound_send_end( );
						rt_kprintf( "\r\n 音频传输结束! \r\n" );
						break;
					case 2:                                                 // 视频
						Video_send_end( );
						rt_kprintf( "\r\n 视频传输结束! \r\n" );
						break;
					default:
						break;
				}
				// if(CheckResualt==0)
				Media_Clear_State( );
			}
			else
			{                                               //  重传包ID 列表
				if( UDP_HEX_Rx[17] != 0 )
				{
					MediaObj.RSD_State	= 1;                //   进入重传状态
					MediaObj.RSD_Timer	= 0;                //   清除重传定时器
					MediaObj.RSD_Reader = 0;
					MediaObj.RSD_total	= UDP_HEX_Rx[17];   // 重传包总数
					//   获取重传列表
					j = 0;
					for( i = 0; i < MediaObj.RSD_total; i++ )
					{
						MediaObj.Media_ReSdList[i]	= ( UDP_HEX_Rx[18 + j] << 8 ) + UDP_HEX_Rx[19 + j];
						j							+= 2;
					}
					rt_kprintf( "\r\n  8003 重传列表Total=%d: ", MediaObj.RSD_total );
					for( i = 0; i < MediaObj.RSD_total; i++ )
					{
						rt_kprintf( "%d,", MediaObj.Media_ReSdList[i] );
					}
					rt_kprintf( "\r\n" );
				}
			}

			break;
		case  0x8801:                                                               //    摄像头立即拍照

