nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
			SD_ACKflag.f_SettingPram_0104H = 2;                                         // 中心查询指定参数
			break;
		case  0x8107:                                                                   // BD--8.14 查询终端属性
			SD_ACKflag.f_BD_DeviceAttribute_8107 = 1;                                   // 消息体为空
			break;
		case   0x8108:                                                                  //BD--8.16 下发终端升级包   远程升级  (重要)

			//   1.  分包判断bit 位
			if( UDP_HEX_Rx[3] & 0x20 )
			{                                                                           //  分包判断
				BD_ISP.Total_PacketNum		= ( UDP_HEX_Rx[13] << 8 ) + UDP_HEX_Rx[14]; // 总包数
				BD_ISP.CurrentPacket_Num	= ( UDP_HEX_Rx[15] << 8 ) + UDP_HEX_Rx[16]; // 当前包序号从1 开始
			}else
			{
				//------------   ACK   Flag -----------------
				SD_ACKflag.f_CentreCMDack_0001H		= 1;
				Ack_Resualt							= 0;
				SD_ACKflag.f_CentreCMDack_resualt	= Ack_Resualt;
			}
			//   2.  检测
			if( BD_ISP.CurrentPacket_Num == 1 )
			{
				BD_ISP.Update_Type = UDP_HEX_Rx[17]; //升级包类型
				//----  Debug ------
				switch( BD_ISP.Update_Type )
				{
					case  0:
						rt_kprintf( "\r\n 升级类型: 终端\r\n" );
						break;
					case  12:
						rt_kprintf( "\r\n 升级类型: IC 卡读卡器\r\n" );
						break;
					case  52:
						rt_kprintf( "\r\n 升级类型: 北斗模块\r\n" );
						break;
				}
				//----------------------
				memcpy( BD_ISP.ProductID, UDP_HEX_Rx + 18, 5 );                                                                                 // 制造商ID
				BD_ISP.Version_len = UDP_HEX_Rx[23];                                                                                            // 版本号长度
				memcpy( BD_ISP.VersionStr, UDP_HEX_Rx + 20, BD_ISP.Version_len );                                                               // 软件版本号
				i					= 24 + BD_ISP.Version_len;
				BD_ISP.Content_len	= ( UDP_HEX_Rx[i] << 24 ) + ( UDP_HEX_Rx[i + 1] << 16 ) + ( UDP_HEX_Rx[i + 2] << 8 ) + UDP_HEX_Rx[i + 3];   // 升级包长度
				i					+= 4;
				rt_kprintf( "\r\n 升级包长度:%d Bytes\r\n", BD_ISP.Content_len );

				infolen = infolen - 11 - BD_ISP.Version_len;                                                                                    // infolen

				BD_ISP.PacketRX_wr	= 0;                                                                                                        // clear
				BD_ISP.ISP_running	= 1;
			}
			//--------  升级包内容  -------------
			if( infolen )                                                                                                                       //  升级内容以后根据类型往不同的存储区域写
			{
				memcpy( BD_ISP.ContentData, UDP_HEX_Rx + i + 4, infolen );                                                                      // 升级包内容
				BD_ISP.PacketRX_wr += infolen;
			}
			//------------   ACK   Flag -----------------
			SD_ACKflag.f_CentreCMDack_0001H		= 1;
			Ack_Resualt							= 0;
			SD_ACKflag.f_CentreCMDack_resualt	= Ack_Resualt;
			//------------------------------------------------------------------------
			break;
		case   0x8203:                                                                                  //BD--8.22  人工确认报警消息
			HumanConfirmWarn.Warn_FloatID		= ( UDP_HEX_Rx[13] << 8 ) + UDP_HEX_Rx[14];
			HumanConfirmWarn.ConfirmWarnType	= ( UDP_HEX_Rx[15] << 24 ) + ( UDP_HEX_Rx[16] << 16 ) + ( UDP_HEX_Rx[17] << 8 ) + UDP_HEX_Rx[18];
			if( HumanConfirmWarn.Warn_FloatID == 0x00 )
			{                                                                                           //  如果为0 表示所有消息
				Warn_Status[3]	&= ~0x01;                                                               // bit 0
				Warn_Status[3]	&= ~0x08;                                                               // bit3
				Warn_Status[1]	&= ~0x10;                                                               // bit20 进出区域报警
				Warn_Status[1]	&= ~0x20;                                                               // bit 21 进出线路报警
				Warn_Status[1]	&= ~0x40;                                                               // bit 22  路段行驶时间不足报警
				Warn_Status[0]	&= ~0x08;                                                               // bit 27  确认车辆非法点火报警
				Warn_Status[0]	&= ~0x10;                                                               // bit 28  确认车辆非法报警
				Warn_Status[0]	&= ~0x80;                                                               //bit 31  非法开门 (终端不设置区域时，车门开关无效)
			}else
			{
				//--------------------------------
				if( ( Warn_Status[3] & 0x01 ) && ( 0x00000001 & HumanConfirmWarn.ConfirmWarnType ) )    //紧急报警
				{
					StatusReg_WARN_Clear( );
					f_Exigent_warning	= 0;
					warn_flag			= 0;
					Send_warn_times		= 0;
					StatusReg_WARN_Clear( );
					rt_kprintf( "\r\n紧急报警收到应答，得清除!\r\n" );
				}
				if( ( Warn_Status[3] & 0x08 ) && ( 0x00000008 & HumanConfirmWarn.ConfirmWarnType ) )    //危险报警-BD
				{
					Warn_Status[3] &= ~0x08;
				}

				//------------------------------------
				if( ( Warn_Status[1] & 0x10 ) && ( 0x00001000 & HumanConfirmWarn.ConfirmWarnType ) )    // 进出区域报警
				{
					InOut_Object.TYPE		= 0;                                                        //圆形区域
					InOut_Object.ID			= 0;                                                        //  ID
					InOut_Object.InOutState = 0;                                                        //  进报警
					Warn_Status[1]			&= ~0x10;
				}
				if( ( Warn_Status[1] & 0x20 ) && ( 0x00002000 & HumanConfirmWarn.ConfirmWarnType ) )    // 进出路线报警
				{
					InOut_Object.TYPE		= 0;                                                        //圆形区域
					InOut_Object.ID			= 0;                                                        //  ID
					InOut_Object.InOutState = 0;                                                        //  进报警
					Warn_Status[1]			&= ~0x20;
				}
				if( ( Warn_Status[1] & 0x40 ) && ( 0x00004000 & HumanConfirmWarn.ConfirmWarnType ) )    // 路段行驶时间不足、过长
				{
					Warn_Status[1] &= ~0x40;
				}
				//-----------------------------------------
				if( ( Warn_Status[0] & 0x08 ) && ( 0x08000000 & HumanConfirmWarn.ConfirmWarnType ) )    //车辆非法点火
				{
					Warn_Status[0] &= ~0x08;
				}
				if( ( Warn_Status[0] & 0x10 ) && ( 0x10000000 & HumanConfirmWarn.ConfirmWarnType ) )    //车辆非法位移
				{
					Warn_Status[0] &= ~0x10;
				}
				if( ( Warn_Status[0] & 0x80 ) && ( 0x80000000 & HumanConfirmWarn.ConfirmWarnType ) )    //非法开门报警(终端未设置区域时，不判断非法开门)
				{
					Warn_Status[0] &= ~0x80;
				}
				//------------------------------------
			}

			//---------  报警确认后发送，立即发送定位包
			PositionSD_Enable( );
			Current_UDP_sd = 1;
			break;
		case   0x8702:                              // BD-8.47-  上报驾驶员身份信息请求
			SD_ACKflag.f_DriverInfoSD_0702H = 1;    // 消息体为空
			break;
		case  0x8805:                               //BD--8.55    单条存储多媒体数据检索上传命令	---- 补充协议要求

