nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
			reg_u32 = ( UDP_HEX_Rx[13] << 24 ) + ( UDP_HEX_Rx[14] << 16 ) + ( UDP_HEX_Rx[15] << 8 ) + UDP_HEX_Rx[16];
			rt_kprintf( "\r\n单条存储多媒体数据检索上传 MeidiaID=%d 删除标志: %d ", reg_u32, UDP_HEX_Rx[17] );

			Camera_Number = 1;
			Photo_send_start( Camera_Number );      //在不是多路拍照的情况下拍完就可以上传了
			//------------------------------
			// if(SD_ACKflag.f_CentreCMDack_0001H==0)
			{
				SD_ACKflag.f_CentreCMDack_0001H		= 1;
				Ack_Resualt							= 0;
				SD_ACKflag.f_CentreCMDack_resualt	= Ack_Resualt;
			}
			break;
		case  0x8003:                                //    补传分包请求

			    //Devide_8003_packet_1stID=( UDP_HEX_Rx[13] << 8 ) + UDP_HEX_Rx[14]; //高字节在前，在后 
			                                                                      // 这里通过高字节判断

  		       devide_value=0;
			   switch(UDP_HEX_Rx[13]) //根据中心下发的流水号判断
			   {
				   case 0x80:
				   	         Recode_Obj.CMD=0x08;
							 Recode_Obj.Total_pkt_num	= 720;
							Recode_Obj.Devide_Flag				= 1;
							MediaObj.Media_Type		= 3; //行驶记录仪 只是利用类型填充ID 时候有用
							  break;
				   case 0x90: 
				   	        Recode_Obj.CMD=0x09;
							Recode_Obj.Total_pkt_num	= 720;
							Recode_Obj.Devide_Flag				= 1;					
							MediaObj.Media_Type		= 3; //行驶记录仪
							  break;
				   case 0xA0:
				   	        Recode_Obj.CMD=0x10;
							Recode_Obj.Total_pkt_num	= 100;
							Recode_Obj.Devide_Flag				= 1;					
							MediaObj.Media_Type		= 3; //行驶记录仪
							  break;
				   case 0xB0:
				   	         Recode_Obj.CMD=0x11;
							 Recode_Obj.Total_pkt_num	= 100;
					        Recode_Obj.Devide_Flag				= 1;					
							MediaObj.Media_Type		= 3; //行驶记录仪
							  break;
				   case 0xC0:
				   	        Recode_Obj.CMD=0x12;
							Recode_Obj.Total_pkt_num	= 10;						
					        Recode_Obj.Devide_Flag				= 1;					
							MediaObj.Media_Type		= 3; //行驶记录仪
							  break;
							  break;
				   case  0xD0:
				   	        Recode_Obj.CMD=0x15;
							Recode_Obj.Total_pkt_num	= 10;						
					        Recode_Obj.Devide_Flag				= 1;					
							MediaObj.Media_Type		= 3; //行驶记录仪
							  break;
							  break;  
				   default:
                              devide_value=1; // 多媒体分包处理方式
					          break;
                 }

                 


				  if(0==devide_value)
				  	{  // 记录仪分包处理
				  		//   获取重传列表
						if( Recode_Obj.RSD_end==1)
						 {
						    rt_kprintf( "\r\n 之前列表项为0  ，现在不予处理了。\r\n" );
							Recorder_init(1);// clear all state
							Recode_Obj.RSD_end=1; 
							break;
						 }	
						
				  	if(Recode_Obj.CountStep)
				       	Recode_Obj.RSD_State	= 3;                //   进入重传状态
				    else
                        Recode_Obj.RSD_State	= 1;                //   进入重传状态
					
						Recode_Obj.RSD_Timer	= 0;                //   清除重传定时器
						Recode_Obj.RSD_Reader = 0;
						Recode_Obj.RSD_total	= UDP_HEX_Rx[15];   // 重传包总数

					
						j = 0;
						for( i = 0; i < Recode_Obj.RSD_total; i++ )
						{
							Recode_Obj.Media_ReSdList[i]	= ( UDP_HEX_Rx[16 + j] << 8 ) + UDP_HEX_Rx[17 + j];
							j							+= 2;
						}
						rt_kprintf( "\r\n 记录仪  8003 重传列表Total=%d: ", Recode_Obj.RSD_total );  
							for( i = 0; i < Recode_Obj.RSD_total; i++ )
							{
								rt_kprintf( "%d,", Recode_Obj.Media_ReSdList[i] ); 
							}
							rt_kprintf( "\r\n" );

                         if(Recode_Obj.RSD_total==0)
						 	  Recode_Obj.RSD_end=1;//enable
				  	}
                   else
		            {  //  多媒体分包  
		       
					MediaObj.RSD_State	= 1;                //   进入重传状态
					MediaObj.RSD_Timer	= 0;                //   清除重传定时器
					MediaObj.RSD_Reader = 0;
					MediaObj.RSD_total	= UDP_HEX_Rx[15];   // 重传包总数

					//   获取重传列表
					j = 0;
					for( i = 0; i < MediaObj.RSD_total; i++ )
					{
						MediaObj.Media_ReSdList[i]	= ( UDP_HEX_Rx[16 + j] << 8 ) + UDP_HEX_Rx[17 + j];
						j							+= 2;
					}
					rt_kprintf( "\r\n  8003 重传列表Total=%d: ", MediaObj.RSD_total );   
					if( MediaObj.RSD_total<=100)
					{
						for( i = 0; i < MediaObj.RSD_total; i++ )
						{
							rt_kprintf( "%d,", MediaObj.Media_ReSdList[i] );
						}
						rt_kprintf( "\r\n" );
			         }
		           }
			//==================================================================
           /*      列表重传不要应答 
                     if(Recode_Obj.RSD_total)  // 重传列表项为0 不返回 
			{
				SD_ACKflag.f_CentreCMDack_0001H		= 1;
				Ack_Resualt							= 0;
				SD_ACKflag.f_CentreCMDack_resualt	= Ack_Resualt;
			}
			*/

			break;
		//--------  BD  add  Over  --------------------------------
		default:
			break;
	}

	//-----------------  memset  -------------------------------------
	//memset(UDP_HEX_Rx, 0, sizeof(UDP_HEX_Rx));
	//UDP_hexRx_len= 0;
	return;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void Time2BCD( u8 *dest )
{
	dest[0] = ( ( time_now.year / 10 ) << 4 ) + ( time_now.year % 10 );
	dest[1] = ( ( time_now.month / 10 ) << 4 ) + ( time_now.month % 10 );
	dest[2] = ( ( time_now.day / 10 ) << 4 ) + ( time_now.day % 10 );
	dest[3] = ( ( time_now.hour / 10 ) << 4 ) + ( time_now.hour % 10 );
	dest[4] = ( ( time_now.min / 10 ) << 4 ) + ( time_now.min % 10 );
	dest[5] = ( ( time_now.sec / 10 ) << 4 ) + ( time_now.sec % 10 );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void AvrgSpd_MintProcess( u8 hour, u8 min, u8 sec )
{
	//------- 系统启动时处理   若 标志位为0 且年月日都为 0，表面是系统刚刚启动，这时获取当前时间把当前时间给BAK------
	if( ( 0 == Avrgspd_Mint.saveFlag ) && ( Avrgspd_Mint.datetime_Bak[0] == 0 ) && ( Avrgspd_Mint.datetime_Bak[1] == 0 ) && ( Avrgspd_Mint.datetime_Bak[2] == 0 ) )
	{
		Time2BCD( Avrgspd_Mint.datetime );
		memcpy( Avrgspd_Mint.datetime_Bak, Avrgspd_Mint.datetime, 6 );              //将当前时间给BAK
		avgspd_Mint_Wr = time_now.min;                                              //分钟既是下标	 5-----4
	}else
	{                                                                               // 若不是系统启动开始
		if( min == 0 )                                                              //  把秒数写为非0 ，以便留出时间去存储上1小时的数据
		{
			avgspd_Mint_Wr = 0;                                                     //(xj)分钟数为0，清0
			if( sec == 2 )                                                          //存储上一小时每分钟的平均速度 ==2是因为要保证第59分钟速度已经被存储到相应的寄存器中
			{
				memcpy( Avrgspd_Mint.datetime_Bak, Avrgspd_Mint.datetime, 6 );      //将当前时间给BAK
				Avrgspd_Mint.datetime_Bak[4]	= 0;                                // 分钟为0
				Avrgspd_Mint.datetime_Bak[5]	= 0;                                // 秒也为0
				Avrgspd_Mint.saveFlag			= 1;                                //使能存储      到NandFlag  标志位
				Time2BCD( Avrgspd_Mint.datetime );                                  //获取新的时间
			}
			if( sec == 8 )                                                          //存储完后  清除时间下标
			{
				avgspd_Mint_Wr = 0;
			}
		}
	}
	if( sec == 0 )                                                                  // 秒为0时存储上1分钟的数据
	{
		//-----------------------------------------------------------------------------------------
		//avgspd_Mint_Wr=(Avrgspd_Sec.datetime_Bak[4]>>4)*10+(0x0f&Avrgspd_Sec.datetime_Bak[4]);
		if( AspdCounter )
		{
			Avrgspd_Mint.avgrspd[avgspd_Mint_Wr] = PerMinSpdTotal / AspdCounter;    //第几分钟的平均速度
		}else
		{
			Avrgspd_Mint.avgrspd[avgspd_Mint_Wr] = 0;
		}
		//---------------------------------------------------------------------------------------------
		// rt_kprintf("\r\n	  %2X:%2X  每分钟的平均速度  avrgSpd=%d \r\n",Avrgspd_Sec.datetime_Bak[3],Avrgspd_Sec.datetime_Bak[4], Avrgspd_Mint.avgrspd[avgspd_Mint_Wr]);
		//--------------------------------------------------
		PerMinSpdTotal	= 0;                    // clear
		AspdCounter		= 0;                    // clear
	}else
	{
		if( UDP_dataPacket_flag == 0x02 )
		{
			AspdCounter++;
			PerMinSpdTotal += GPS_speed / 10;   // 只要求精确到 km/h   所以要除 10
		}
	}
}

//==================================================================================================
// 第四部分 :   以下是行车记录仪相关协议 即 附录A
//==================================================================================================

//  1.  上载数据命令字相关


