nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
/*
   u8 In_Type  :   传输类型
   u8* InStr   :   参数字符串
   u8 TransType:   传输方式   串口  或  GPRS

 */
void Device_Data( u8 In_Type, u8 TransType )
{
	u8	UpReg[500];
	u16 Up_wr	= 0, SregLen = 0, Greglen = 0, Swr = 0; //,Gwr=0; // S:serial  G: GPRS
	u8	Sfcs	= 0, Gfcs = 0;
	u16 i		= 0;
//  u16  packet_len=0;
	u8	Reg[70];
	u32 regdis		= 0, reg2 = 0;
	u8	QueryRecNum = 0;

	memset( UpReg, 0, 500 );
	Up_wr = 0;

	if( TransType )                                                                     //-------  GPRS  得添加 无线协议头
	{
		memcpy( UpReg + Up_wr, "*GB", 3 );                                              // GPRS 起始头
		Up_wr += 3;

		UpReg[Up_wr++]	= 0x00;                                                         // SIM 号码   最先两个字节填写0x00
		UpReg[Up_wr++]	= 0x00;
		memcpy( UpReg + Up_wr, SIM_code, 6 );
		Up_wr += 6;

		Greglen = Up_wr;                                                                // 长度
		Up_wr	+= 2;

		UpReg[Up_wr++] = 0x00;                                                          //消息序号 默认 0x00

		UpReg[Up_wr++] = 0x20;                                                          //参数  bit5 bit4 10 选择应答遵照协议

		UpReg[Up_wr++] = 0xF0;                                                          // 命令字  无线传输RS232数据

		//   以下是数据内容
	}
	//---------------填写 A 协议头 ------------------------
	Swr				= Up_wr;                                                            // reg save
	UpReg[Up_wr++]	= 0xAA;                                                             // 起始头
	UpReg[Up_wr++]	= 0x75;
	//---------------根据类型分类填写内容------------------
	switch( In_Type )
	{
		//---------------- 上传数类型  -------------------------------------
		case  A_Up_DrvInfo:                                                             //  当前驾驶人信息
			UpReg[Up_wr++] = In_Type;                                                   //命令字

			SregLen			= 0x00;                                                     // 信息长度
			UpReg[Up_wr++]	= 0x00;                                                     // Hi
			UpReg[Up_wr++]	= 39;                                                       // Lo

			UpReg[Up_wr++] = 0x00;                                                      // 保留字

			memcpy( UpReg + Up_wr, JT808Conf_struct.Driver_Info.DriverCard_ID, 18 );    //信息内容
			Up_wr += 18;
			memcpy( UpReg + Up_wr, JT808Conf_struct.Driver_Info.DriveName, 21 );
			Up_wr += 21;

			break;
		case  A_Up_RTC:                                                                 //  采集记录仪的实时时钟
			UpReg[Up_wr++] = In_Type;                                                   //命令字

			SregLen			= 0x00;                                                     // 信息长度
			UpReg[Up_wr++]	= 0x00;                                                     // Hi
			UpReg[Up_wr++]	= 6;                                                        // Lo

			UpReg[Up_wr++] = 0x00;                                                      // 保留字

			Time2BCD( UpReg + Up_wr );                                                  //信息内容
			Up_wr += 6;
			break;
		case  A_Up_Dist:                                                                //  采集里程
			UpReg[Up_wr++] = In_Type;                                                   //命令字

			SregLen			= 0x00;                                                     // 信息长度
			UpReg[Up_wr++]	= 0x00;                                                     // Hi
			UpReg[Up_wr++]	= 16;                                                       // Lo

			UpReg[Up_wr++] = 0x00;                                                      // 保留字
			//   信息内容
			Time2BCD( UpReg + Up_wr );
			Up_wr += 6;
			memcpy( UpReg + Up_wr, (u8*)JT808Conf_struct.FirstSetupDate, 6 );
			Up_wr			+= 6;
			regdis			= JT808Conf_struct.Distance_m_u32 / 100;                    //单位0.1km
			reg2			= regdis / 10000000;
			UpReg[Up_wr++]	= ( reg2 << 4 ) + ( ( regdis % 10000000 ) / 1000000 );
			UpReg[Up_wr++]	= ( ( regdis % 1000000 / 100000 ) << 4 ) + ( regdis % 100000 / 10000 );
			UpReg[Up_wr++]	= ( ( regdis % 10000 / 1000 ) << 4 ) + ( regdis % 1000 / 100 );
			UpReg[Up_wr++]	= ( ( regdis % 100 / 10 ) << 4 ) + ( regdis % 10 );

		case  A_Up_PLUS:                                                                //  采集记录仪速度脉冲系数
			UpReg[Up_wr++] = In_Type;                                                   //命令字

			SregLen			= 0x00;                                                     // 信息长度
			UpReg[Up_wr++]	= 0x00;                                                     // Hi
			UpReg[Up_wr++]	= 10;                                                       // Lo

			UpReg[Up_wr++] = 0x00;                                                      // 保留字

			//  信息内容
			Time2BCD( UpReg + Up_wr );
			Up_wr			+= 6;
			UpReg[Up_wr++]	= (u8)( JT808Conf_struct.Vech_Character_Value << 24 );
			UpReg[Up_wr++]	= (u8)( JT808Conf_struct.Vech_Character_Value << 16 );
			UpReg[Up_wr++]	= (u8)( JT808Conf_struct.Vech_Character_Value << 8 );
			UpReg[Up_wr++]	= (u8)( JT808Conf_struct.Vech_Character_Value );

			break;
		case  A_Up_VechInfo:                                                        //  车辆信息
			UpReg[Up_wr++] = In_Type;                                               //命令字

			SregLen			= 0x00;                                                 // 信息长度
			UpReg[Up_wr++]	= 0x00;                                                 // Hi
			UpReg[Up_wr++]	= 41;                                                   // Lo

			UpReg[Up_wr++] = 0x00;                                                  // 保留字

			memcpy( UpReg + Up_wr, JT808Conf_struct.Vechicle_Info.Vech_VIN, 17 );   //信息内容
			Up_wr += 17;
			memcpy( UpReg + Up_wr, JT808Conf_struct.Vechicle_Info.Vech_Num, 12 );
			Up_wr += 12;
			memcpy( UpReg + Up_wr, JT808Conf_struct.Vechicle_Info.Vech_Type, 12 );
			Up_wr += 12;

			break;
		case  A_Up_AvrgMin:                                         //  每分钟平均速度记录      // 默认填写最新7分钟记录
			UpReg[Up_wr++] = In_Type;                               //命令字

			SregLen			= 455;                                  // 信息长度
			UpReg[Up_wr++]	= (u8)( SregLen >> 8 );                 // Hi
			UpReg[Up_wr++]	= (u8)SregLen;                          // Lo	65x7

