nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
			Settingchg_Status				= 0x82;                                                                                                 //设置车辆信息
			NandsaveFlg.Setting_SaveFlag	= 1;                                                                                                    //存储参数修改记录
		case 0x83:                                                                                                                                  // 设置初次安装日期
			memcpy( JT808Conf_struct.FirstSetupDate, instr, 6 );
			Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
			Adata_ACKflag.A_Flag_Dn_SetupDate_83H	= instr[2];
			Settingchg_Status						= 0x83;                                                                                         //设置车辆信息
			NandsaveFlg.Setting_SaveFlag			= 1;                                                                                            //存储参数修改记录
			break;
		case 0x84:                                                                                                                                  // 设置状态量信息
			Settingchg_Status				= 0x84;                                                                                                 //设置车辆信息
			NandsaveFlg.Setting_SaveFlag	= 1;                                                                                                    //存储参数修改记录
			break;
		case 0xc2:                                                                                                                                  // 设置记录仪时钟
			Adata_ACKflag.A_Flag_Dn_RTC_C2H = instr[2];
			Settingchg_Status				= 0xc2;                                                                                                 //设置车辆信息
			NandsaveFlg.Setting_SaveFlag	= 1;                                                                                                    //存储参数修改记录
			break;
		case 0xc3:                                                                                                                                  // 设置记录仪速度脉冲系数
			JT808Conf_struct.Vech_Character_Value = (u32)( instr[0] << 24 ) + (u32)( instr[1] << 16 ) + (u32)( instr[2] << 8 ) + (u32)( instr[3] ); // 特征系数	速度脉冲系数
			Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
			Adata_ACKflag.A_Flag_Dn_Plus_C3H	= instr[2];
			Settingchg_Status					= 0xc3;                                                                                             //设置车辆信息
			NandsaveFlg.Setting_SaveFlag		= 1;                                                                                                //存储参数修改记录
			break;
		default:

			break;
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u8 Send_Device_Data( void )  //  给行车记录仪发送数据
{
	u8 j = 0, i = 0, reg = 0;;

	j = sizeof( Adata_ACKflag );
	for( i = 0; i < j; i++ )
	{
		reg = ( *( (u8*)&Adata_ACKflag + i ) );
		if( reg )
		{
			if( reg != 0xff )
			{
				Device_Data( reg, 1 );
			}else
			{
				Device_Data( 0x00, 1 );             // 采集行车记录仪执行标准版本号 命令为0x00 置位时填写0xFF,所以单独处理
			}
			( *( (u8*)&Adata_ACKflag + i ) ) = 0;   // clear flag
			return true;
		}
	}
	return false;
}

#if 0


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u8 RecordSerial_output_Str( const char *fmt, ... )
{
	u8		regstr[100], fcs = 0;
	u16		reglen = 0, i = 0;

	va_list args;
	va_start( args, fmt );
	memset( regstr, 0, sizeof( regstr ) );
	regstr[0]	= 0x55;                 // 协议头
	regstr[1]	= 0x7A;
	regstr[2]	= 0xFE;                 // 命令字 ，用预留命令字表示调试输出
	//  3,4 为长度字节最后填写
	regstr[5] = 0x00;                   // 备用字  0x00

	reglen = vsprintf( (char*)regstr + 6, fmt, args );
	va_end( args );
	regstr[3]	= (u8)( reglen >> 8 );  // 填写长度  ，长度为信息内容的长度
	regstr[4]	= (u8)reglen;

	reglen	+= 6;
	fcs		= 0;
	for( i = 0; i < reglen; i++ )
	{
		fcs ^= regstr[i];
	}
	regstr[reglen] = fcs;
	reglen++;
	for( i = 0; i < reglen; i++ )
	{
		rt_kprintf( "%c", regstr[i] );
	}

	return 1;
}

#endif


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void SpeedWarnJudge( void )                     //  速度报警判断
{
	//--------  速度报警  -------
	if( JT808Conf_struct.Speed_warn_MAX > 0 )   //> 0
	{
		//----- GPS  即时速度	0.1 km/h  ---------
		if( GPS_speed > ( JT808Conf_struct.Speed_warn_MAX * 10 ) )
		// if( DebugSpd > ( JT808Conf_struct.Speed_warn_MAX*10) )
		{
			speed_Exd.dur_seconds++;
			if( speed_Exd.dur_seconds > JT808Conf_struct.Spd_Exd_LimitSeconds )
			{
				speed_Exd.dur_seconds = 0;
				if( speed_Exd.speed_flag != 1 )
				{
					speed_Exd.speed_flag = 1;
					//PositionsSD_Enable();	  //  回报GPS 信息

					StatusReg_SPD_WARN( );                  //  超速报警状态
					rt_kprintf( "\r\n  超速报警\r\n" );
					TTS_play( " 超速报警触发" );
				}
				//---------------------------------------------
				Time2BCD( speed_Exd.ex_startTime );         //记录超速报警起始时间
				if( speed_Exd.current_maxSpd < GPS_speed )  //找最大速度
				{
					speed_Exd.current_maxSpd = GPS_speed;
				}
				speed_Exd.excd_status = 1;
				speed_Exd.dur_seconds++;

				//----------------------------------------------
			}

			if( speed_Exd.excd_status == 1 )                // 使能flag 后开始计时
			{
				speed_Exd.dur_seconds++;
				if( speed_Exd.current_maxSpd < GPS_speed )  //找最大速度
				{
					speed_Exd.current_maxSpd = GPS_speed;
				}
			}
		}else
		{
			StatusReg_SPD_NORMAL( );                        //  清除速度报警状态寄存器

			if( speed_Exd.excd_status != 2 )
			{
				StatusReg_SPD_NORMAL( );                    //  清除速度报警状态寄存器
				speed_Exd.dur_seconds	= 0;
				speed_Exd.speed_flag	= 0;
			}
			//----------------------------------------------
			if( speed_Exd.excd_status == 1 )
			{
				Time2BCD( speed_Exd.ex_endTime );           //记录超速报警结束时间
				speed_Exd.excd_status = 2;
			}else
			if( speed_Exd.excd_status == 0 )
			{
				Spd_ExpInit( );
			}
			//----------------------------------------------
		}
	} //------- 速度报警 over	 ---
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u16  Protocol_808_Encode( u8 *Dest, u8 *Src, u16 srclen )
{
	u16 lencnt = 0, destcnt = 0;

	for( lencnt = 0; lencnt < srclen; lencnt++ )
	{
		if( Src[lencnt] == 0x7e )           // 7e 转义
		{
			Dest[destcnt++] = 0x7d;
			Dest[destcnt++] = 0x02;
		}else
		if( Src[lencnt] == 0x7d )           //  7d  转义
		{
			Dest[destcnt++] = 0x7d;
			Dest[destcnt++] = 0x01;
		}else
		{
			Dest[destcnt++] = Src[lencnt];  // 原始信息
		}
	}

	return destcnt;                         //返回转义后的长度
}

//-------------------------------------------------------------------------------
void Protocol_808_Decode( void )            // 解析指定buffer :  UDP_HEX_Rx
{
	//-----------------------------------
	u16 i = 0;

