nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
	// 1.  clear  write_counter
	UDP_DecodeHex_Len = 0;                  //clear DecodeLen

	// 2   decode process
	for( i = 0; i < UDP_hexRx_len; i++ )
	{
		if( ( UDP_HEX_Rx[i] == 0x7d ) && ( UDP_HEX_Rx[i + 1] == 0x02 ) )
		{
			UDP_HEX_Rx[UDP_DecodeHex_Len] = 0x7e;
			i++;
		}else
		if( ( UDP_HEX_Rx[i] == 0x7d ) && ( UDP_HEX_Rx[i + 1] == 0x01 ) )
		{
			UDP_HEX_Rx[UDP_DecodeHex_Len] = 0x7d;
			i++;
		}else
		{
			UDP_HEX_Rx[UDP_DecodeHex_Len] = UDP_HEX_Rx[i];
		}
		UDP_DecodeHex_Len++;
	}
	//  3.  The  End
}

//---------  拐点补传测试程序  ---------------------------
//#if 0


/*
   void Inflexion_Process(void)
   {            //
   u16  once_delta=0;


   Inflexion_Current=GPS_direction;  //  update new
   //-----------------------------------------------------------------------
    if(Inflexion_Current>Inflexion_Bak)   // 初步判断大小
     {  // 增大
            if((Inflexion_Current-Inflexion_Bak)>300)  // 判断是否倒置减小
   {   //  如果差值大于300 ，说明是小于
        once_delta=Inflexion_Bak+360-Inflexion_Current;  //判断差值绝对值
        InflexDelta_Accumulate+=once_delta;
     if((once_delta>=15)&&(once_delta<=60)) // 角度最小变化率不得小于15度  拐点补传角度不大于180 要求连续3s  所以每秒不大于60
     {
         if((Inflexion_chgcnter>0)&&(InflexLarge_or_Small==2))  //判断之前是否一直是小于
          {
                          Inflexion_chgcnter++;
        if((InflexDelta_Accumulate>=3)&&(InflexDelta_Accumulate>JT808Conf_struct.DURATION.SD_Delta_maxAngle)&&(InflexDelta_Accumulate<=180))
         {     //要求至少持续3s	累计拐角补传角度不得大于180
                                           InflexLarge_or_Small=0;
             Inflexion_chgcnter=0;
             InflexDelta_Accumulate=0;
             PositionSD_Enable=1; // 发送拐点标志位
             rt_kprintf("\r\n 拐点上报 --1\r\n");
         }
        else
          InflexLarge_or_Small=2; // 这次是小于
          }
      else
       {
          InflexLarge_or_Small=2;  // 这是第一次小于
          Inflexion_chgcnter=1;
          InflexDelta_Accumulate=once_delta;
       }
     }
     else
     {    //  小于 15 就算等于
       InflexLarge_or_Small=0;
       Inflexion_chgcnter=0;
       InflexDelta_Accumulate=0;
     }

            }
   else		// current真真正正的比Bak 大
   {
      once_delta=Inflexion_Current-Inflexion_Bak;  //判断差值绝对值
      InflexDelta_Accumulate+=once_delta;
      if((once_delta>=15)&&(once_delta<=60)) // 角度最小变化率不得小于15度  拐点补传角度不大于180 要求连续3s  所以每秒不大于60
      {
                if((Inflexion_chgcnter>0)&&(InflexLarge_or_Small==1)) //判断之前是否一直大于
       {
           Inflexion_chgcnter++;
        if((InflexDelta_Accumulate>=3)&&(InflexDelta_Accumulate>JT808Conf_struct.DURATION.SD_Delta_maxAngle)&&(InflexDelta_Accumulate<=180))
         {	 //要求至少持续3s	累计拐角补传角度不得大于180
          InflexLarge_or_Small=0;
          Inflexion_chgcnter=0;
          InflexDelta_Accumulate=0;
          PositionSD_Enable(); // 发送拐点标志位
          rt_kprintf("\r\n 拐点上报 --2\r\n");
         }
        else
          InflexLarge_or_Small=1; // 这次是大于
                }
       else
        {
                       InflexLarge_or_Small=1;  // 这是第一次大于
        Inflexion_chgcnter=1;
        InflexDelta_Accumulate=once_delta;
        }
      }
       else
     {     // 小于15度就算等于
       InflexLarge_or_Small=0;
       Inflexion_chgcnter=0;
       InflexDelta_Accumulate=0;
     }

   }
     }
   else
   if(Inflexion_Current<Inflexion_Bak)
   {  // 减小
               if((Inflexion_Bak-Inflexion_Current)>300)  // 判断是否倒置增大
               { //  如果差值大于300 ，说明是大于
                  once_delta=Inflexion_Current+360-Inflexion_Bak;  //判断差值绝对值
         InflexDelta_Accumulate+=once_delta;
      if((once_delta>=15)&&(once_delta<=60)) // 角度最小变化率不得小于15度	拐点补传角度不大于180 要求连续3s  所以每秒不大于60
                  {   // 最小变化率 不小于 15
                     if((Inflexion_chgcnter>0)&&(InflexLarge_or_Small==1))  //判断之前是否一直是大于
          {
                          Inflexion_chgcnter++;
        if((InflexDelta_Accumulate>=3)&&(InflexDelta_Accumulate>JT808Conf_struct.DURATION.SD_Delta_maxAngle)&&(InflexDelta_Accumulate<=180))
         {     //要求至少持续3s	累计拐角补传角度不得大于180
                                           InflexLarge_or_Small=0;
             Inflexion_chgcnter=0;
             InflexDelta_Accumulate=0;
             PositionSD_Enable(); // 发送拐点标志位
             rt_kprintf("\r\n 拐点上报 --3\r\n");
         }
        else
          InflexLarge_or_Small=1; // 这次是大于
          }
      else
       {
          InflexLarge_or_Small=1;  // 这是第一次大于
          Inflexion_chgcnter=1;
          InflexDelta_Accumulate=once_delta;
       }

                  }
      else
      {    //  小于 15 就算等于
       InflexLarge_or_Small=0;
       Inflexion_chgcnter=0;
       InflexDelta_Accumulate=0;
      }
     }//---------------------------
      else     // current 真真正正的比Bak 小
      {
      once_delta=Inflexion_Bak-Inflexion_Current;  //判断差值绝对值
      InflexDelta_Accumulate+=once_delta;
      if((once_delta>=15)&&(once_delta<=60)) // 角度最小变化率不得小于15度	拐点补传角度不大于180 要求连续3s  所以每秒不大于60
      {
       if((Inflexion_chgcnter>0)&&(InflexLarge_or_Small==2)) //判断之前是否一直小于
       {
        Inflexion_chgcnter++;
        if((InflexDelta_Accumulate>=3)&&(InflexDelta_Accumulate>JT808Conf_struct.DURATION.SD_Delta_maxAngle)&&(InflexDelta_Accumulate<=180))
         {  //要求至少持续3s	累计拐角补传角度不得大于180
          InflexLarge_or_Small=0;
          Inflexion_chgcnter=0;
          InflexDelta_Accumulate=0;
          PositionSD_Enable(); // 发送拐点标志位
          rt_kprintf("\r\n 拐点上报 --4\r\n");
         }
        else
         InflexLarge_or_Small=2; // 这次是小于
       }
       else
        {
        InflexLarge_or_Small=2;  // 这是第一次小于
        Inflexion_chgcnter=1;
        InflexDelta_Accumulate=once_delta;
        }
      }
       else
     {	  // 小于15度就算等于
       InflexLarge_or_Small=0;
       Inflexion_chgcnter=0;
       InflexDelta_Accumulate=0;
     }

      }



   }
   else
   {
    InflexLarge_or_Small=0;
    Inflexion_chgcnter=0;
    InflexDelta_Accumulate=0;
   }

    //--------------------------------------------------------
    Inflexion_Bak=Inflexion_Current; //  throw  old	 to  Bak

   }*/
//#endif

