nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
				//continue;
			}
			if( Rail_Cycle.Area_attribute & 0x0100 )                                                    //bit8  --BD 允许开门
			{
				;                                                                                       // continue
			}
			if( Rail_Cycle.Area_attribute & 0x4000 )                                                    //bit14  --BD  进区域 开启通信模块
			{
				;                                                                                       // continue
			}
			if( Rail_Cycle.Area_attribute & 0x8000 )                                                    //bit15  --BD  进区域 采集详细信息
			{
				;                                                                                       // continue
			}
		}
	}

#endif
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void RectangleRail_Judge( u8* LatiStr, u8* LongiStr )
{
	u8	i			= 0;
	u32 Latitude	= 0, Longitude = 0;
//	u32 DeltaLatiDis=0,DeltaLongiDis=0,CacuDist=0;
	u8	InOutState = 1; //	 0 表示 in	 1	表示Out

	//  1. get value
	Latitude	= ( LatiStr[0] << 24 ) + ( LatiStr[1] << 16 ) + ( LatiStr[2] << 8 ) + LatiStr[3];
	Longitude	= ( LongiStr[0] << 24 ) + ( LongiStr[1] << 16 ) + ( LongiStr[2] << 8 ) + LongiStr[3];

	// rt_kprintf("\r\n  1---TemperLati  %d  TemperLongi	%d	 res %d\r\n",Latitude,Longitude,InOutState);

	for( i = 0; i < 8; i++ )
	{
		InOutState = 1;
		//Api_RecordNum_Read( Rail_rect, i + 1, (u8*)&Rail_Rectangle, sizeof( Rail_Rectangle ) );		
		memcpy((u8*)&Rail_Rectangle,(u8*)&Rail_Rectangle_multi[i],sizeof(Rail_Rectangle));	
		

		if( Rail_Rectangle.Effective_flag == 1 )
		{
			//  rt_kprintf("\r\n\r\n 判断矩形形围栏 有效:%d ID: %d  atrri=%X  leftlati: %d  leftlongiti:%d    rightLati:%d   rightLongitu: %d	\r\n",Rail_Rectangle.Effective_flag,i+1,Rail_Rectangle.Area_attribute,Rail_Rectangle.LeftUp_Latitude,Rail_Rectangle.LeftUp_Longitude,Rail_Rectangle.RightDown_Latitude,Rail_Rectangle.RightDown_Longitude);
			if( ( Latitude > Rail_Rectangle.RightDown_Latitude ) && ( Latitude < Rail_Rectangle.LeftUp_Latitude ) && ( Longitude > Rail_Rectangle.LeftUp_Longitude ) && ( Longitude < Rail_Rectangle.RightDown_Longitude ) )
			{
				InOutState = 0;
			}

			//rt_kprintf("\r\n  TemperLati  %d  TemperLongi  %d   res %d\r\n",Latitude,Longitude,InOutState);

			// 1. 判断属性
			if( Rail_Rectangle.Area_attribute & 0x0001 )    //Bit 0 根据时间
			{
				//continue;
			}
			if( Rail_Rectangle.Area_attribute & 0x0002 )    //Bit 1 限速
			{
				//continue;
			}
			if( Rail_Rectangle.Area_attribute & 0x0004 )    //Bit 2 进区域报警给驾驶员
			{
				//continue;
			}
			if( Rail_Rectangle.Area_attribute & 0x0008 )    //Bit 3 进区域报警给平台
			{
				if( InOutState == 0 )
				{
					if( InOut_Object.Keep_state == 2 )      // 如果没在in ，报一次
					{
						Warn_Status[1]			|= 0x10;    // 进出区域报警
						InOut_Object.TYPE		= 2;        //矩形区域
						InOut_Object.ID			= i;        //	ID
						InOut_Object.InOutState = 0;        //  进报警
						InOut_Object.Keep_state = 1;        //在围栏内
						PositionSD_Enable( );
						Current_UDP_sd = 1;
						rt_kprintf( "\r\n -----矩形电子围栏--入报警" );
						gps_raw( "3" );  // 使能原始GPS 数据信息上传
					}
					InOut_Object.Keep_state = 1;            //在围栏内	//
					break;
				}
				//continue;
			}
			if( Rail_Rectangle.Area_attribute & 0x0010 )    //Bit 4 出区域报警给司机
			{
				// continue;
			}
			if( Rail_Rectangle.Area_attribute & 0x0020 )    //Bit 5 出区域报警给平台
			{
				if( InOutState == 1 )
				{
					if( InOut_Object.Keep_state == 1 )      // 如果没在out ，报一次
					{
						Warn_Status[1]			|= 0x10;    // 进出区域报警
						InOut_Object.TYPE		= 2;        //矩形区域
						InOut_Object.ID			= i;        //	ID
						InOut_Object.InOutState = 1;        //  出报警
						InOut_Object.Keep_state = 2;        //在围栏外
						PositionSD_Enable( );
						Current_UDP_sd = 1;
						rt_kprintf( "\r\n -----矩形电子围栏--出报警" );
						gps_raw( "0" );
					}
					InOut_Object.Keep_state = 2;            //在围栏外
					break;
				}
			}
			// continue;
			if( Rail_Rectangle.Area_attribute & 0x4000 )    //Bit 14 开启关闭通信模块
			{
				if( InOutState == 0 )
				{
					;                                       //  关闭通信


					   if( JT808Conf_struct.Close_CommunicateFlag==0)
					           {
					                  close_com();
									  mq_true_enable(2);  //  使能盲区补报存储
					                rt_kprintf("\r\n -----矩形电子围栏--关闭通信");

					           }	
					break;
				}else
				if( InOutState == 1 )
				{
					; // 开启通信
					if( JT808Conf_struct.Close_CommunicateFlag == 1 )
					{
						 open_com("0");
						 mq_true_enable(1); // 使能盲区补报上报 
						rt_kprintf( "\r\n -----矩形电子围栏--开启通信" );
					}
					break;
				}
			}
		}
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void RouteLineWarn_judge( u8* LatiStr, u8* LongiStr )
{
	//  u32 Latitude=0,Longitude=0;

	//  1. get value
	// Latitude=(LatiStr[0]<<24)+(LatiStr[1]<<16)+(LatiStr[2]<<8)+LatiStr[3];
	// Longitude=(LongiStr[0]<<24)+(LongiStr[1]<<16)+(LongiStr[2]<<8)+LongiStr[3];

	//13 03 05 10 15 32 A 39587815N116000189E   内-> 外
	if( ( Temp_Gps_Gprs.Date[0] == 13 ) && ( Temp_Gps_Gprs.Date[1] == 3 ) && ( Temp_Gps_Gprs.Date[2] == 5 ) && \
	    ( Temp_Gps_Gprs.Time[0] == 18 ) && ( Temp_Gps_Gprs.Time[1] == 15 ) && \
	    ( ( Temp_Gps_Gprs.Time[2] == 32 ) || ( Temp_Gps_Gprs.Time[2] == 33 ) ) )
	{
		if( ( Warn_Status[1] & 0x80 ) == 0 )    //  如果以前没触发，那么及时上报
		{
			PositionSD_Enable( );
			Current_UDP_sd = 1;
			rt_kprintf( "\r\n     出线路 !\r\n" );
		}
		Warn_Status[1] |= 0x80;                 // 路线偏航报警
	}

	//13 03 05 10 21 32 A 39578028N116000001E	   外-> 内
	if( ( Temp_Gps_Gprs.Date[0] == 13 ) && ( Temp_Gps_Gprs.Date[1] == 3 ) && ( Temp_Gps_Gprs.Date[2] == 5 ) && \
	    ( Temp_Gps_Gprs.Time[0] == 18 ) && ( Temp_Gps_Gprs.Time[1] == 21 ) && \
	    ( ( Temp_Gps_Gprs.Time[2] == 32 ) || ( Temp_Gps_Gprs.Time[2] == 33 ) ) )
	{
		if( Warn_Status[1] & 0x80 ) //  如果以前没触发，那么及时上报
		{
			PositionSD_Enable( );
			Current_UDP_sd = 1;
			rt_kprintf( "\r\n     进 线路 !\r\n" );
		}
		Warn_Status[1] &= ~0x80;    // 路线偏航报警
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void RouteRail_Judge( u8* LatiStr, u8* LongiStr )
{
	/*
	    纬度没有差值    1纬度  111km
	    40度纬度上 1经度为  85.3km   (北京地区)
	 */
	u8	i			= 0;
	u8	route_cout	= 0, seg_count = 0, seg_num = 0;
	u32 Latitude	= 0, Longitude = 0;
	// u32 DeltaLatiDis=0,DeltaLongiDis=0,CacuDist=0;
	// u8  InOutState=0;   //   0 表示 in   1  表示Out
	u32 Route_Status	= 0;    // 每个bit 表示 一个路线 偏航状态默认为0
	u32 Segment_Status	= 0;    //  当前线路中，对应端的偏航情况， 默认为0
	u32 Distance		= 0;
//     u8    InAreaJudge=0; //  判断是否在判断区域 bit 0 经度范围 bit  1 纬度范围
	u32 Distance_Array[6];      //存储当条线路的最小距离，默认是个大数值

	//  1. get value
	Latitude	= ( LatiStr[0] << 24 ) + ( LatiStr[1] << 16 ) + ( LatiStr[2] << 8 ) + LatiStr[3];
	Longitude	= ( LongiStr[0] << 24 ) + ( LongiStr[1] << 16 ) + ( LongiStr[2] << 8 ) + LongiStr[3];

	// rt_kprintf("\r\n 当前---->  Latitude:   %d     Longitude: %d\r\n",Latitude,Longitude);

	//  2.  Judge
	for( route_cout = 0; route_cout < Route_Mum; route_cout++ )                 // 读取路线
	{
		// 2.1  --------   读取路线-----------
		memset( (u8*)&ROUTE_Obj, 0, sizeof( ROUTE_Obj ) );                      //  clear all  first
		DF_ReadFlash( DF_Route_Page + route_cout, 0, (u8*)&ROUTE_Obj, sizeof( ROUTE_Obj ) );
		DF_delay_us( 20 );
		//rt_kprintf("\r\n -----> ROUTE_Obj.RouteID:   %d \r\n",ROUTE_Obj.Route_ID);
		// 2.2  -----  判断是否有效  -------
		if( ( ROUTE_Obj.Effective_flag == 1 ) && ( ROUTE_Obj.Points_Num > 1 ) ) //  判断是否有效且有拐点，若无效不处理
		{
			// 2.2.0    当前段距离付给一个大的数值
			for( i = 0; i < 6; i++ )
			{
				Distance_Array[i] = ROUTE_DIS_Default;
			}
			// 2.2.1      计算段数
			seg_num = ROUTE_Obj.Points_Num - 1; // 线路段数目
			//  2.2.2    判断路线中每一段的状态
			Segment_Status = 0;                 // 清除段判断状态，每个线路重新开始一次
			for( seg_count = 0; seg_count < seg_num; seg_count++ )
			{
				if( ( ROUTE_Obj.RoutePoints[seg_count + 1].POINT_Latitude == 0 ) && ( ROUTE_Obj.RoutePoints[seg_count + 1].POINT_Longitude == 0 ) )
				{
					rt_kprintf( "\r\n  该点为0 ，jump\r\n" );
					continue;
				}
				//----- 开始做距离计算, 在没在区域在函数里边做了判断
				Distance_Array[seg_count] = Distance_Point2Line( Latitude, Longitude, ROUTE_Obj.RoutePoints[seg_count].POINT_Latitude, ROUTE_Obj.RoutePoints[seg_count].POINT_Longitude, ROUTE_Obj.RoutePoints[seg_count + 1].POINT_Latitude, ROUTE_Obj.RoutePoints[seg_count + 1].POINT_Longitude );
			}
			//=========================================================
			//  2.4 ------  打印显示距离，找出最小数值----
			Distance = Distance_Array[0]; // 最小距离
			for( i = 0; i < 6; i++ )
			{
				if( Distance >= Distance_Array[i] )
				{
					Distance = Distance_Array[i];
				}
				// rt_kprintf("\r\n  Distance[%d]=%d",i,Distance_Array[i]);
			}
			rt_kprintf( "\r\n MinDistance =%d  Width=%d \r\n", Distance, ( ROUTE_Obj.RoutePoints[seg_num].Width >> 1 ) ); //

