nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
			if( Distance < ROUTE_DIS_Default )
			{
				//  ---- 和路段宽度做对比
				if( Distance > ( ROUTE_Obj.RoutePoints[seg_num].Width >> 1 ) )
				{
					rt_kprintf( "\r\n 路线偏离\r\n" );
					Segment_Status |= ( 1 << seg_num ); //  把相应的bit  置位
				}
			}

			//
		}
		// 2.4  根据 2.2 结果判断当期路线状态
		if( Segment_Status )
		{
			Route_Status |= ( 1 << route_cout );    //  把相应的bit  置位
		}
	}
	// 3.  Result
	if( Route_Status )
	{
		if( ( Warn_Status[1] & 0x80 ) == 0 )        //  如果以前没触发，那么及时上报
		{
			PositionSD_Enable( );
			Current_UDP_sd = 1;
		}

		Warn_Status[1] |= 0x80;                     // 路线偏航报警
		rt_kprintf( "\r\n    路径偏航触发 !\r\n" );
	}else
	{
		if( Warn_Status[1] & 0x80 )                 //  如果以前没触发，那么及时上报
		{
			PositionSD_Enable( );
			Current_UDP_sd = 1;
		}

		Warn_Status[1] &= ~0x80;                    // 路线偏航报警
	}
}

//--------  D点到直线距离计算-------


/*
     P1(x1,y1)   P2(x2,y2)  ,把点P(x1,y2)作为坐标原点，即x1=0，y2=0；

     那么两点P1，P2 确定的直线方程(两点式)为:
             (x-x1)/(x2-x1) =(y-y1)/(y2-y1)                          (1)

    注:  标准式直线方程为 AX+BY+C=0;
             那么平面上任意一点P(x0,y0) 到直线的距离表示为
             d=abs(Ax0+By0+C)/sqrt(A^2+B^2)

    其中把方程式(1) 转换成标准式为:
            (y2-y1)x+(x1-x2)y+x1(y1-y2)+y1(x2-x1)=0;

   由于点(x1,y2)为原点  即x1=0，y2=0；  P1(0,y1) , P2(x2,0)
    所以   A=-y1 ,  B=-x2, C=y1x2
    那么 直线的方程:
                  -y1x-x2y+y1x2=0;  (2)

   =>     d=abs(-y1x0-x2y0+y1x2)/sqrt(y1^2+x2^2)       (3)

         其中 (3)  为最终应用的公式

        注:  先根据经纬度折合计算出 x0，y0，x1,y1,x2,y2  的数值单位为: 米
   =>  区域判断:
           根据(2) 可以求出  过 P1(0,y1) , P2(x2,0) 点与已知直线垂直的两条直线方程
              P1(0,y1) :      x2x-y1y+y1^2=0  (4)
              P2(x2,0) :      x2x-y1y-x2^2=0  (5)

          如果 y1 >=0      直线(4)    在直线(5)  的上边
          那么 点在线段区域内的判断方法是
                       (4) <=  0    且  (5)  >=0
       另
           如果 y1 <=0      直线(5)    在直线(4)  的上边
          那么 点在线段区域内的判断方法是
                       (4) >=  0    且  (5)  <=0
   //------------------------------------------------------------------------------------------

       纬度没有差值    1纬度  111km
       40度纬度上 1经度为  85.3km   (北京地区)

       X 轴为 经度(longitude) 差值
       Y 轴为纬度 (latitude)  差值


   //------------------------------------------------------------------------------------------
 */

u32   Distance_Point2Line( u32 Cur_Lat, u32 Cur_Longi, u32 P1_Lat, u32 P1_Longi, u32 P2_Lat, u32 P2_Longi )
{                                                                           //   输入当前点 ，返回点到既有直线的距离
	long	x0			= 0, y0 = 0, Line4_Resualt = 0, Line5_Resualt = 0;  // 单位: 米
	long	y1			= 0;
	long	x2			= 0;
	long	distance	= 0;
	// long  Rabs=0;
//      long  Rsqrt=0;
	long	DeltaA1 = 0, DeltaA2 = 0, DeltaO1 = 0, DeltaO2 = 0;             //  DeltaA : Latitude     DeltaO:  Longitude
	// u32   Line4_Resualt2=0,Line5_Resualt2=0;
	double	fx0				= 0, fy0 = 0, fy1 = 0, fx2 = 0;
	double	FLine4_Resualt2 = 0, FLine5_Resualt2 = 0, fRabs = 0, fRsqrt = 0;

	// 0.   先粗略的判断
	DeltaA1 = abs( Cur_Lat - P1_Lat );
	DeltaA2 = abs( Cur_Lat - P2_Lat );
	DeltaO1 = abs( Cur_Lat - P1_Longi );
	DeltaO2 = abs( Cur_Lat - P2_Longi );


	/* if((DeltaA1>1000000) &&(DeltaA2>1000000))
	        {
	            rt_kprintf("\r\n  Latitude 差太大\r\n");
	            return   ROUTE_DIS_Default;
	   }
	   if((DeltaO1>1000000) &&(DeltaO2>1000000))
	        {
	            rt_kprintf("\r\n  Longitude 差太大\r\n");
	            return   ROUTE_DIS_Default;
	   }
	 */
	// 1.  获取  P1(0,y1)   P2(x2,0) ,和P(x0,y0)    P(x1,y2)为原点  即x1=0，y2=0；  P1(0,y1) , P2(x2,0)
	x2 = abs( P2_Longi - P1_Longi ); // a/1000000*85300=a 853/10000 m =a x 0.0853
	if( P2_Longi < P1_Longi )
	{
		x2 = 0 - x2;
	}
	fx2 = (double)( (double)x2 / 1000 );
	//rt_kprintf("\r\n P2_L=%d,P1_L=%d   delta=%d \r\n",P2_Longi,P1_Longi,(P2_Longi-P1_Longi));
	// if(P2_Longi
	y1 = abs( P2_Lat - P1_Lat ); //  a/1000000*111000=a/9.009	除以一百万得到度数 再乘以 111000 米得到实际距离
	if( P2_Lat < P1_Lat )
	{
		y1 = 0 - y1;
	}
	fy1 = (double)( (double)y1 / 1000 );
	//rt_kprintf("\r\n P2_LA=%d,P1_LA=%d   delta=%d \r\n",P2_Lat,P1_Lat,(P2_Lat-P1_Lat));

	//   rt_kprintf("\r\n 已知两点坐标: P1(0,%d)   P2(%d,0) \r\n", y1,x2);
	//    当前点
	x0 = abs( Cur_Longi - P1_Longi );
	if( Cur_Longi < P1_Longi )
	{
		x0 = 0 - x0;
	}
	fx0 = (double)( (double)x0 / 1000 );
	//rt_kprintf("\r\n Cur_L=%d,P1_L=%d   delta=%d \r\n",Cur_Longi,P1_Longi,(Cur_Longi-P1_Longi));

	y0 = abs( Cur_Lat - P2_Lat ); //  a/1000000*111000=a/9.009
	if( Cur_Lat < P2_Lat )
	{
		y0 = 0 - y0;
	}
	fy0 = (double)( (double)y0 / 1000 );
	// rt_kprintf("\r\n Cur_La=%d,P2_La=%d   delta=%d \r\n",Cur_Lat,P2_Lat,(Cur_Lat-P2_Lat));
	//   rt_kprintf("\r\n当前点坐标: P0(%d,%d)    \r\n", x0,y0);
	// 2. 判断y1  的大小， 求出过 P1(0,y1)   P2(x2,0) ,和已知直线的方程，并判断
	//     当前点是否在路段垂直范围内

	//  2.1   将当前点带入， 过 P1(0,y1)   的 直线方程(4)  求出结果
	Line4_Resualt	= ( x2 * x0 ) - ( y1 * y0 ) + ( y1 * y1 );
	FLine4_Resualt2 = fx2 * fx0 - fy1 * fy0 + fy1 * fy1;
	//     rt_kprintf("\r\n Line4=x2*x0-y1*y0+y1*y1=(%d)*(%d)-(%d)*(%d)+(%d)*(%d)=%ld     x2*x0=%d    y1*y0=%d   y1*y1=%d  \r\n",x2,x0,y1,y0,y1,y1,Line4_Resualt,x2*x0,y1*y0,y1*y1);
	//     rt_kprintf("\r\n FLine4=fx2*fx0-fy1*fy0+fy1*fy1=(%f)*(%f)-(%f)*(%f)+(%f)*(%f)=%f      fx2*fx0=%f    fy1*fy0=%f   fy1*fy1=%f  \r\n",fx2,fx0,fy1,fy0,fy1,fy1,FLine4_Resualt2,fx2*fx0,fy1*fy0,fy1*fy1);

	//   2.2   将当前点带入， 过P2(x2,0) 的 直线方程(5)  求出结果
	Line5_Resualt	= ( x2 * x0 ) - y1 * y0 - x2 * x2;
	FLine5_Resualt2 = fx2 * fx0 - fy1 * fy0 - fx2 * fx2;
	//rt_kprintf("\r\n Line5=x2*x0-y1*y0-x2*x2=(%d)*(%d)-(%d)*(%d)-(%d)*(%d)=%ld     Se : %ld   \r\n",x2,x0,y1,y0,x2,x2,Line5_Resualt,Line5_Resualt2);
	//    rt_kprintf("\r\n FLine5=fx2*fx0-fy1*fy0-fx2*fx2=(%f)*(%f)-(%f)*(%f)-(%f)*(%f)=%f      fx2*fx0=%f    fy1*fy0=%f   fx2*fx2=%f  \r\n",fx2,fx0,fy1,fy0,fx2,fx2,FLine5_Resualt2,fx2*fx0,fy1*fy0,fx2*fx2);
	// rt_kprintf("\r\n  Line4_Resualt=%d     Line5_Resualt=%d  \r\n",Line4_Resualt,Line5_Resualt);

	if( fy1 >= 0 )                      //  直线(4) 在上发
	{
		//   2.3   判断区域    (4) <=  0    且  (5)  >=0     // 判断条件取反
		if( ( FLine4_Resualt2 > 0 ) || ( FLine5_Resualt2 < 0 ) )
		{
			return ROUTE_DIS_Default;   //  不满足条件返回最大数值
		}
	} else
	{                                   //  直线(5)
		//   2.4   判断区域     (4) >=  0    且  (5)  <=0     // 判断条件取反
		if( ( FLine4_Resualt2 < 0 ) || ( FLine5_Resualt2 > 0 ) )
		{
			return ROUTE_DIS_Default;   //  不满足条件返回最大数值
		}
	}

	rt_kprintf( "\r\n In judge area \r\n" );
	//rt_kprintf("\r\n   Current== Latitude:   %d     Longitude: %d     Point1== Latitude:   %d     Longitude: %d     Point2== Latitude:   %d     Longitude: %d\r\n",Cur_Lat,Cur_Longi,P1_Lat,P1_Longi,P2_Lat,P2_Longi);

	//  3. 将差值差算成实际距离
#if 0
	x2	= x2 * 0.0853;  // a/1000000*85300=a 853/10000 m =a x 0.0853
	y1	= y1 / 9;       //  a/1000000*111000=a/9.009	除以一百万得到度数 再乘以 111000 米得到实际距离
	x0	= x0 * 0.0853;
	y0	= y0 / 9;       //  a/1000000*111000=a/9.009
#else
	fx2 = fx2 * 0.0853; // a/1000000*85300=a 853/10000 m =a x 0.0853
	fy1 = fy1 / 9;      //  a/1000000*111000=a/9.009	除以一百万得到度数 再乘以 111000 米得到实际距离
	fx0 = fx0 * 0.0853;
	fy0 = fy0 / 9;      //  a/1000000*111000=a/9.009
#endif

