nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
	//  4. 计算距离
	//Rabs=0-y1*x0-x2*y0+y1*x2;
	// rt_kprintf("\r\n Test -y1*x0=%d -y0*x2=%d  y1*x2=%d   Rabs=%d  \r\n",0-y1*x0,0-y0*x2,0-y1*x2,Rabs);
#if 0
	Rabs	= abs( -y1 * x0 - x2 * y0 + y1 * x2 );
	Rsqrt	= sqrt( y1 * y1 + x2 * x2 );
	// distance=abs(-y1*x0-x2*y0-y1*x2)/sqrt(y1*y1+x2*x2);
	distance = Rabs / Rsqrt;
	// rt_kprintf("\r\n Rabs=%d    Rsqrt=%d   d=%d",Rabs,Rsqrt,distance);
#else
	fRabs	= abs( -fy1 * fx0 - fx2 * fy0 + fy1 * fx2 );
	fRsqrt	= sqrt( fy1 * fy1 + fx2 * fx2 );
	// distance=abs(-y1*x0-x2*y0-y1*x2)/sqrt(y1*y1+x2*x2);
	distance = (long)( ( fRabs / fRsqrt ) * 1000 );
	// rt_kprintf("\r\n Rabs=%d    Rsqrt=%d   d=%d",Rabs,Rsqrt,distance);
#endif

	return distance;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
unsigned short int CRC16_file( unsigned short int num )
{
#if  0
	unsigned short int	i = 0, j = 0;
	unsigned char		buffer_temp[514];
	memset( buffer_temp, 0, sizeof( buffer_temp ) );
	for( i = 0; i < num; i++ )
	{
		if( i == 0 )                //第一包
		{
			Last_crc		= 0;    // clear first
			crc_fcs			= 0;
			buffer_temp[0]	= 0;
			buffer_temp[1]	= 51;
			DF_ReadFlash( 51, 0, &buffer_temp[2], PageSIZE );
			WatchDog_Feed( );

			Last_crc = CRC16_1( buffer_temp, 514, 0xffff );
			rt_kprintf( "\r\ni=%d,j=%d,Last_crc=%x", i, j, Last_crc );
		}else if( i == ( num - 1 ) ) //最后一包
		{
			buffer_temp[0]	= 0;
			buffer_temp[1]	= 50;
			DF_ReadFlash( 50, 0, &buffer_temp[2], PageSIZE );
			FileTCB_CRC16	= ( (unsigned short int)buffer_temp[512] << 8 ) + (unsigned short int)buffer_temp[513];
			crc_fcs			= CRC16_1( buffer_temp, 512, Last_crc );
			rt_kprintf( "\r\ni=%d,j=%d,Last_crc=%x ReadCrc=%x ", i, j, crc_fcs, FileTCB_CRC16 );
		}else
		{   // 中间的包
			j				= i + 51;
			buffer_temp[0]	= (char)( j >> 8 );
			buffer_temp[1]	= (char)j;
			DF_ReadFlash( j, 0, &buffer_temp[2], PageSIZE );
			WatchDog_Feed( );
			Last_crc = CRC16_1( buffer_temp, 514, Last_crc );
			//rt_kprintf("\r\ni=%d,j=%d,Last_crc=%d",i,j,Last_crc);
		}
	}
	rt_kprintf( "\r\n  校验结果 %x", crc_fcs );
	return crc_fcs;
#endif
	return 1;
}

//-------  JT808  Related   Save  Process---------
void  Save_Status( u8 year, u8 mon, u8 day, u8 hour, u8 min, u8 sec )
{    // 存储事故疑点 最近20s车辆的状态字，和当前最近的有效位置信息
	u16				wr_add = 3, j = 0, cur = 0;
	u8				FCS;
	u8				regDateTime[6];
	static uint8_t	Statustmp[500];
//		u32  latitude=0,longitude=0;

	Time2BCD( regDateTime );
	//----------------------------------------------------------------------------
	wr_add = 0;
	memcpy( Statustmp, regDateTime, 6 );
	wr_add += 6;
	//-----------------------  Status Register   --------------------------------
	cur = save_sensorCounter;                               //20s的事故疑点
	for( j = 0; j < 100; j++ )
	{
		Statustmp[wr_add++] = Sensor_buf[cur].DOUBTspeed;   //速度
		Statustmp[wr_add++] = Sensor_buf[cur].DOUBTstatus;  //状态
		cur++;
		if( cur > 100 )
		{
			cur = 0;
		}
	}
	//---------------------------------------------------------------------------------------
	FCS = 0;
	for( j = 0; j < wr_add; j++ )
	{
		FCS ^= Statustmp[j];
	} //求上边数据的异或和      不算校验 信息长度为   206
	  //------------------------------------------------------------------------------
	Statustmp[wr_add++] = FCS;
	//-----------------------------------------------------------------------------
	rt_kprintf( "\r\n 存储行车记录  Record  write: %d    SaveLen: %d    \r\n", Recorder_write, wr_add );
	Api_DFdirectory_Write( doubt_data, Statustmp, wr_add );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void Spd_Exp_Wr( void )
{
	u8	content[40];
	u8	wr_add = 0, i = 0, FCS = 0;

	memset( content, 0, sizeof( content ) );
	memcpy( content + wr_add, JT808Conf_struct.Driver_Info.DriverCard_ID, 18 );
	wr_add += 18;
	memcpy( content + wr_add, speed_Exd.ex_startTime, 6 );
	wr_add += 6;
	memcpy( content + wr_add, speed_Exd.ex_endTime, 6 );
	wr_add				+= 6;
	content[wr_add++]	= speed_Exd.current_maxSpd / 10;

	FCS = 0;
	for( i = 0; i < 32; i++ )
	{
		FCS ^= content[i];
	}                           //求上边数据的异或和
	content[wr_add++] = FCS;    // 第31字节

	Api_DFdirectory_Write( spd_warn, (u8*)content, 32 );
	//----------- debug -----------------------
	rt_kprintf( "\r\n 超速报警  %X-%X-%X %X:%X:%X,MaxSpd=%d\r\n", speed_Exd.ex_endTime[0], speed_Exd.ex_endTime[1], speed_Exd.ex_endTime[2], speed_Exd.ex_endTime[3], speed_Exd.ex_endTime[4], speed_Exd.ex_endTime[5], speed_Exd.current_maxSpd );
	//--------- clear status ----------------------------
	Spd_ExpInit( );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void  JT808_Related_Save_Process( void )
{
	if( DF_LOCK )
	{
		return;
	}

	if( Dev_Voice.CMD_Type != '1' ) // 录音时不做以下处理
	{
		//-------------------------
		//    存储疑点数据
		if( 1 == NandsaveFlg.Doubt_SaveFlag )
		{
			if( sensor_writeOverFlag == 1 )
			{
				time_now = Get_RTC( ); //  RTC  相关
				Save_Status( time_now.year, time_now.month, time_now.day, time_now.hour, time_now.min, time_now.sec );
				NandsaveFlg.Doubt_SaveFlag = 0;
				return;
			}
		}

		//-----------------  超速报警 ----------------------
		if( speed_Exd.excd_status == 2 )
		{
			Spd_Exp_Wr( );
			return;
		}


		/*
		   if(NandsaveFlg.Setting_SaveFlag==1)   // 参数 修改记录
		   {
		   Save_Common(Settingchg_write,TYPE_SettingChgAdd);
		   Settingchg_write++;
		   if(Settingchg_write>=Max_CommonNum)
		   Settingchg_write=0;
		   DF_Write_RecordAdd(Settingchg_write,Settingchg_read,TYPE_SettingChgAdd);
		   NandsaveFlg.Setting_SaveFlag=0; // clear flag
		   }
		 */
	}
	//	 定时存储里程
	if( ( Vehicle_RunStatus ) && ( ( Systerm_Reset_counter & 0xff ) == 0xff ) )
	{   //  如果车辆在行驶过程中，每255 秒存储一次里程数据
		Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
		return;
	}

	//--------------------------------------------------------------
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u8   Time_FastJudge( void )
{
	u32 Date_value1		= 0, Time_value1 = 0;
	u32 Date_valueRTC	= 0, Time_valueRTC = 0;

	Date_value1		= Gps_Gprs.Date[0] * 365 + Gps_Gprs.Date[1] * 30 + Gps_Gprs.Date[2];
	Date_valueRTC	= time_now.year * 3600 + time_now.day * 60 + time_now.day;
	Time_value1		= Gps_Gprs.Time[0] * 365 + Gps_Gprs.Time[1] * 30 + Gps_Gprs.Time[2];
	Time_valueRTC	= time_now.hour * 3600 + time_now.min * 60 + time_now.sec;

