nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
	if( Date_value1 > Date_valueRTC )
	{
		rt_kprintf( "\r\n  日期超前，Kick  OUT  !\r\n" );
		StatusReg_GPS_V( ); //  不定位
		return false;
	}
	if( ( Time_value1 > Time_valueRTC ) && ( ( Time_value1 - Time_valueRTC ) > 120 ) )
	{
		rt_kprintf( "\r\n  时间超前，Kick  OUT  !\r\n" );
		StatusReg_GPS_V( ); // 不定位
		return false;
	}
	return true;
}

/*
    打印输出 HEX 信息，Descrip : 描述信息 ，instr :打印信息， inlen: 打印长度
 */
void OutPrint_HEX( u8 * Descrip, u8 *instr, u16 inlen )
{
	u32 i = 0;
	rt_kprintf( "\r\n %s:", Descrip );
	for( i = 0; i < inlen; i++ )
	{
		rt_kprintf( "%2X ", instr[i] );
	}
	rt_kprintf( "\r\n" );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void Tired_Check( void )
{
	/*if( DispContent == 2 )
	{
		rt_kprintf( "\r\n				速度: %d Km/h    Debugspd=%d KM/h \r\n", GPS_speed / 10, DebugSpd / 10 );
	}*/
	if( GPS_speed > 60 )                                                                                                        // GPS_speed 单位为0.1 km/h  速度大于6 km/h  认为是行驶
	// if(DebugSpd>60)
	{
		//-------------疲劳驾驶相关 -----------------------
		TiredConf_struct.Tired_drive.ACC_ONstate_counter++;                                                                     // ACC 累计工作时间
		if( DispContent == 5 )
		{
			rt_kprintf( "\r\n  ACC ON = %d", TiredConf_struct.Tired_drive.ACC_ONstate_counter );
		}
		if( TiredConf_struct.Tired_drive.ACC_ONstate_counter > 3 )                                                              //ACC 开 485 外设开电，防抖处理
		{
			Power_485CH1_ON;                                                                                                    // 第一路485的电        上电工作
		}

		TiredConf_struct.Tired_drive.ACC_Offstate_counter = 0;                                                                  // clear
		//------ 停车超时相关  -----------
		TiredConf_struct.TiredDoor.Parking_currentcnt	= 0;                                                                    // Clear  停车 计数器清 0
		Warn_Status[1]									&= ~0x08;                                                               // 停车超时清除
		//---------------------------------
		if( TiredConf_struct.Tired_drive.ACC_ONstate_counter == ( TiredConf_struct.TiredDoor.Door_DrvKeepingSec + 40 - 30 ) )   //提前5分钟蜂鸣器提示注意疲劳驾驶 14100
		{
			TiredConf_struct.Tired_drive.Tgvoice_play = 1;
			TTS_play( "您还有20秒就疲劳驾驶，请注意安全" );
		}

		Status_TiredwhRst = 1;                                                                                                  // 没疲劳时为1
		if( TiredConf_struct.Tired_drive.ACC_ONstate_counter >= ( TiredConf_struct.TiredDoor.Door_DrvKeepingSec + 40 ) )        //14400 // 连续驾驶超过4小时算疲劳驾驶
		{
			TiredConf_struct.Tired_drive.Tgvoice_play = 0;

			Status_TiredwhRst								= 2;                                                                // 疲劳了就为2了
			TiredConf_struct.Tired_drive.Tireddrv_status	= 1;                                                                // 记录疲劳驾驶的状态
			if( TiredConf_struct.Tired_drive.ACC_ONstate_counter == ( TiredConf_struct.TiredDoor.Door_DrvKeepingSec + 40 ) )    //14400
			{
				//Tired_drive.Tgvoice_play=1;  // 开始播放疲劳驾驶语音提示
				// Tired_drive.voicePly_counter++;
				Time2BCD( TiredConf_struct.Tired_drive.start_time );
				rt_kprintf( "\r\n   疲劳驾驶触发了! \r\n" );
				TTS_play( "您已经疲劳驾驶，请注意休息" );
				tts_bro_tired_flag	= 1;
				Warn_Status[3]		|= 0x04; //BIT(2)  疲劳驾驶
				//---- 触发即时上报数据-------
				PositionSD_Enable( );
				Current_UDP_sd = 1;
				//-------------------------------------
				Rstart_time = 1;
			}
			//--------- 蜂鸣器提示相关	关闭蜂鸣器 记录下疲劳驾驶  ------------
			Warn_Status[3]								|= 0x04;                                                                    //BIT(2)  疲劳驾驶
			TiredConf_struct.Tired_drive.Tgvoice_play	= 0;
		}
		TiredConf_struct.Tired_drive.Flag = 1;
	}else
	{
		//------------ 疲劳驾驶相关  ----------------------
		if( TiredConf_struct.Tired_drive.Flag == 1 )                                                                                //只有从ACCon切换过来时才做以下处理，如果长期关着，没有必要了
		{
			//-- ACC 没有休息前还算AccON 的状态  ---------------
			TiredConf_struct.Tired_drive.ACC_ONstate_counter++;                                                                     // ACC 累计工作时间

			if( DispContent == 5 )
			{
				rt_kprintf( "\r\n	ACC ON 2 = %d, GPS_speed = %d", TiredConf_struct.Tired_drive.ACC_ONstate_counter, GPS_speed );
			}
			if( TiredConf_struct.Tired_drive.ACC_ONstate_counter == ( TiredConf_struct.TiredDoor.Door_DrvKeepingSec + 40 - 30 ) )   //提前5分钟蜂鸣器提示注意疲劳驾驶 14100
			{
				TiredConf_struct.Tired_drive.Tgvoice_play = 1;
				TTS_play( "您还有20秒就疲劳驾驶，请注意安全" );
			}

			if( TiredConf_struct.Tired_drive.ACC_ONstate_counter >= ( TiredConf_struct.TiredDoor.Door_DrvKeepingSec + 40 ) )        //14400 // 连续驾驶超过4小时算疲劳驾驶
			{
				Status_TiredwhRst								= 2;                                                                // 疲劳了就为2了
				TiredConf_struct.Tired_drive.Tireddrv_status	= 1;                                                                // 记录疲劳驾驶的状态
				if( TiredConf_struct.Tired_drive.ACC_ONstate_counter == ( TiredConf_struct.TiredDoor.Door_DrvKeepingSec + 40 ) )    //14400
				{
					Time2BCD( TiredConf_struct.Tired_drive.start_time );
					rt_kprintf( "\r\n	 速度小，但未满足休息门限时间 疲劳驾驶触发了! \r\n");
					TTS_play( "您已经疲劳驾驶，请注意休息" );
					tts_bro_tired_flag	= 1;
					Warn_Status[3]		|= 0x04;                                                                                    //BIT(2)  疲劳驾驶
					//---- 触发即时上报数据-------
					PositionSD_Enable( );
					Current_UDP_sd = 1;
					//-------------------------------------
					Rstart_time = 1;
				}
				Warn_Status[3] |= 0x04;                                                                                             //BIT(2)  疲劳驾驶
			}
			//------------------------------------------------------------------------------
			TiredConf_struct.Tired_drive.ACC_Offstate_counter++;
			if( DispContent == 5 )
			{
				rt_kprintf( "\r\n  ACC OFF = %d, GPS_speed = %d", TiredConf_struct.Tired_drive.ACC_Offstate_counter, GPS_speed );
			}
			if( TiredConf_struct.Tired_drive.ACC_Offstate_counter >= TiredConf_struct.TiredDoor.Door_MinSleepSec )  //1200	// ACC 关20分钟视为休息
			{
				if( TiredConf_struct.Tired_drive.ACC_Offstate_counter == TiredConf_struct.TiredDoor.Door_MinSleepSec )
				{
					TiredConf_struct.Tired_drive.ACC_Offstate_counter	= 0;
					TiredConf_struct.Tired_drive.ACC_ONstate_counter	= 0;
					Warn_Status[3]										&= ~0x04;                                   //BIT(2)	疲劳驾驶
					if( tts_bro_tired_flag == 1 )
					{
						TTS_play( "您的疲劳驾驶报警已经解除" );
						tts_bro_tired_flag = 0;
					}
					// Status_TiredwhRst=0;
					// DF_WriteFlashSector(DF_TiredStartTime_Page,0,(u8*)&Status_TiredwhRst,1); //清除O后要写入
					//---- 触发即时上报数据-------
					PositionSD_Enable( );
					Current_UDP_sd = 1;
					//-------------------------------------	                          rt_kprintf("\r\n   ACC  休息了 \r\n");
					if( Rstart_time == 1 )
					{
						TiredConf_struct.Tired_drive.Flag = 0; ///////
						//Tired_drive.ACC_ONstate_counter=0;

						Rstart_time										= 0;
						TiredConf_struct.Tired_drive.Tireddrv_status	= 2;
						//rt_kprintf("\r\n疲劳结束时间写入");
					}
				}
			}
		}

		//----------  超长停车相关 ------------------------------------------------------
		if( GPS_speed < 3 )                                                                                         //(GPS_speed==0)  // 停车超时从速度为0时开始
		//if(DebugSpd<3)
		{
			TiredConf_struct.TiredDoor.Parking_currentcnt++;
			//if(DispContent==2)
			//  printf("\r\n @#@\r\n");
			if( TiredConf_struct.TiredDoor.Parking_currentcnt >= TiredConf_struct.TiredDoor.Door_MaxParkingSec )    //TiredDoor.Door_MaxParkingSec)
			{                                                                                                       //  停车大于门限值，就算停车了
				Warn_Status[1] |= 0x08;                                                                             // 停车超时触发
				if( TiredConf_struct.TiredDoor.Parking_currentcnt == TiredConf_struct.TiredDoor.Door_MaxParkingSec )
				{
					//---- 触发即时上报数据-------
					PositionSD_Enable( );
					Current_UDP_sd = 1;
					//-------------------------------------
					TTS_play( " 超时停车触发" );
					rt_kprintf( "\r\n 超时停车触发! \r\n" );
				}
			}
		}else
		{
			TiredConf_struct.TiredDoor.Parking_currentcnt = 0;
		}
		//--------------------------------------------------------------------------------
	}
}

//E:\work_xj\F4_BD\北斗行车记录仪过检(新协议)\2-21 RT-Thread_NewBoard-LCD2-Jiance\bsp\stm32f407vgt6_RecDrv\app_712\lcd\Menu_0_3_Sim.c
void CAN_struct_init( void )
{
	//-------  protocol variables
	CAN_trans.can1_sample_dur	= 0;        // can1 采集间隔  ms
	CAN_trans.can1_trans_dur	= 0;        // can1  上报间隔 s
	CAN_trans.can1_enable_get	= 0;        // 500ms

	CAN_trans.can2_sample_dur	= 0;        // can2 采集间隔  ms
	CAN_trans.can2_trans_dur	= 0;        // can2  上报间隔 s

	//   u8      canid_1[8];// 原始设置
	CAN_trans.canid_1_Filter_ID = 0;        // 接收判断用
	//u8      canid_1_Rxbuf[400]; // 接收buffer
	CAN_trans.canid_1_RxWr			= 0;    // 写buffer下标
	CAN_trans.canid_1_SdWr			= 0;
	CAN_trans.canid_1_ext_state		= 0;    // 扩展帧状态
	CAN_trans.canid_1_sample_dur	= 10;   // 改ID 的采集间隔
	CAN_trans.canid_ID_enableGet	= 0;

	//------- system variables
	CAN_trans.canid_timer		= 0;        //定时器
	CAN_trans.canid_0705_sdFlag = 0;        // 发送标志位

	CAN_trans.nonew_CANdataflag;            //没有新数据来标志位
	CAN_trans.nonew_CANdata_timer;          //  计时器
	CAN_trans.BAK_WR = 0;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void  CAN_send_timer( void )
{
	u16 i = 0, datanum = 0;;
	if( CAN_trans.can1_trans_dur > 0 )
	{
		CAN_trans.canid_timer++;
		// if( CAN_trans.canid_timer>=CAN_trans.can1_trans_dur)
		if( CAN_trans.canid_timer >= 4 )
		{
			CAN_trans.canid_timer = 0;
			//------  判断有没有数据项
			if( CAN_trans.canid_1_RxWr )
			{
				datanum = ( CAN_trans.canid_1_RxWr >> 3 );
				memcpy( CAN_trans.canid_1_Sdbuf, CAN_trans.canid_1_Rxbuf, CAN_trans.canid_1_RxWr );
				CAN_trans.canid_1_SdWr = CAN_trans.canid_1_RxWr;
				for( i = 0; i < datanum; i++ )
				{
					CAN_trans.canid_1_ID_SdBUF[i] = CAN_trans.canid_1_ID_RxBUF[i];
				}

				CAN_trans.canid_1_RxWr		= 0; // clear
				CAN_trans.canid_0705_sdFlag = 1;
			}else
			{
				rt_kprintf( "\r\n rx=%d  dur=%ds   CAN send trigger ,no data \r\n", CAN_trans.canid_1_RxWr, CAN_trans.can1_trans_dur );
			}
		}
	}else
	{
		CAN_trans.canid_0705_sdFlag = 0;
		CAN_trans.canid_timer		= 0;
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void  CAN_Send_judge( void )
{
	u16 i = 0, datanum = 0;;

