nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
	datanum = ( CAN_trans.canid_1_RxWr >> 3 );

	if( datanum >= 35 )
	{
		datanum = ( CAN_trans.canid_1_RxWr >> 3 );
		memcpy( CAN_trans.canid_1_Sdbuf, CAN_trans.canid_1_Rxbuf, CAN_trans.canid_1_RxWr );
		CAN_trans.canid_1_SdWr = CAN_trans.canid_1_RxWr;
		for( i = 0; i < datanum; i++ )
		{
			CAN_trans.canid_1_ID_SdBUF[i] = CAN_trans.canid_1_ID_RxBUF[i];
		}

		CAN_trans.canid_1_RxWr		= 0; // clear
		CAN_trans.canid_0705_sdFlag = 1;
	}
}

//--------------  SMS Msg  Send Related  ------------------------
void SMS_send_init( void )
{
	SMS_send.Msg_sdState	= 0;
	SMS_send.Msg_step		= 0;
	SMS_send.Msg_timer		= 0;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void SMS_send_process( void )
{
	if( SMS_send.Msg_sdState == 1 )
	{
		switch( SMS_send.Msg_step )
		{
			case 1:                         // 发送命令AT+CMGS="13051953513"    //13602069191
				rt_hw_gsm_output( "AT+CMGS=\"13051953513\"\r\n" );
				SMS_send.Msg_step	= 2;
				SMS_send.Msg_timer	= 0;    // clear  timer   and  start counter
				rt_kprintf( "AT+CMGS=\"13051953513\"\r\n" );
				break;
			case  2:    break;
			case  4:                        // 发送内容 0x1A 结束
				rt_hw_gsm_output( "ProductNum:70420  Type: TW705  DeviceNum:03 " );
				SMS_send.Msg_step = 5;
				rt_kprintf( "ProductNum:70420  Type: TW705  DeviceNum:03 \x1a" );
				break;
			case  7:
				rt_hw_gsm_output( "\x1a" );
				SMS_send.Msg_step = 8;
				break;
			default:
				break;
		}
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void  SMS_send_Step( u8 step )
{
	SMS_send.Msg_step = step;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
u8  SMS_send_stateQuery( void )
{
	return SMS_send.Msg_sdState;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void  SMS_send_enable( void )
{
	//  要发送短信
	SMS_send.Msg_sdState	= 1;
	SMS_send.Msg_step		= 1;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void  SMS_send_end( void )
{
	SMS_send_init( );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void SMS_Send_timer( void )
{
	if( SMS_send.Msg_sdState == 1 )
	{
		SMS_send.Msg_timer++;
		if( SMS_send.Msg_timer >= 10 ) // 2s
		{
			SMS_send.Msg_timer = 0;
			SMS_send_end( );
			rt_kprintf( " \r\n   SMS send timeout !\r\n" );
		}
		//-----------------------------
		if( SMS_send.Msg_step == 6 )
		{
			SMS_send.Msg_step = 7;
		}

		if( SMS_send.Msg_step == 5 )
		{
			SMS_send.Msg_step = 6;
		}

		if( SMS_send.Msg_step == 3 )
		{
			SMS_send.Msg_step = 4;
		}

		if( SMS_send.Msg_step == 2 )
		{
			rt_hw_gsm_output( "\r\n" );
			SMS_send.Msg_step = 3;
		}
		//-----------------------------
	}
}

//--------------------------------------------------------------------------
int use_gpsSpd( void )
{
	JT808Conf_struct.Speed_GetType		= 0;
	JT808Conf_struct.DF_K_adjustState	= 0; // clear  Flag
	ModuleStatus						&= ~Status_Pcheck;

	Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
	rt_kprintf( " \r\n  ------------------------设置从GPS获取速度  Speed_GetType= %d", JT808Conf_struct.Speed_GetType );
	return 1;
}

FINSH_FUNCTION_EXPORT( use_gpsSpd, usegpsspd );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
int use_sensorspd( void )
{
	JT808Conf_struct.Speed_GetType		= 1;
	JT808Conf_struct.DF_K_adjustState	= 1; // clear  Flag
	ModuleStatus						|= Status_Pcheck;
	Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
	rt_kprintf( " \r\n  ------------------------设置从Sensor获取速度	Speed_GetType= %d", JT808Conf_struct.Speed_GetType );
	return 1;
}

FINSH_FUNCTION_EXPORT( use_sensorspd, sensorSpd );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void  Init_original( void )
{
	if( SysConf_struct.Version_ID == SYSID )    //  check  wether need  update  or not
	{
		SysConf_struct.Version_ID = SYSID + 1;
		Api_Config_write( config, ID_CONF_SYS, (u8*)&SysConf_struct, sizeof( SysConf_struct ) );
		Systerm_Reset_counter	= Max_SystemCounter;
		ISP_resetFlag			= 2;            //   借助远程下载重启机制复位系统
	}
	rt_kprintf( "\r\n 手动恢复出厂设置 \r\n" );
}

FINSH_FUNCTION_EXPORT( Init_original, Init_original );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void  apn_set( u8 * Content )
{
	u8 infolen = 0;

	infolen = strlen( Content );
	memset( APN_String, 0, sizeof( APN_String ) );
	memcpy( APN_String, (char*)Content, infolen );
	memset( (u8*)SysConf_struct.APN_str, 0, sizeof( APN_String ) );
	memcpy( (u8*)SysConf_struct.APN_str, (char*)Content, infolen );
	Api_Config_write( config, ID_CONF_SYS, (u8*)&SysConf_struct, sizeof( SysConf_struct ) );
	DataLink_APN_Set( APN_String, 1 );
	rt_kprintf( "\r\n 手动设置APN \r\n" );
}

FINSH_FUNCTION_EXPORT( apn_set, Set APN_String );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void  dur( u8 *content )
{
	sscanf( content, "%d", (u32*)&Current_SD_Duration );
	rt_kprintf( "\r\n 手动设置上报时间间隔 %d s\r\n", Current_SD_Duration );

	JT808Conf_struct.DURATION.Default_Dur = Current_SD_Duration;
	Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
}

FINSH_FUNCTION_EXPORT( dur, Set APN_String );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void idset( u8 *ID )
{
	u8 len = 0;

