nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
	if( strlen( ID ) != 12 )
	{
		rt_kprintf( "\r\nID  长度不够\r\n" ); return;
	}

	memcpy( (char*)JT808Conf_struct.Vechicle_Info.Vech_sim, ID, 12 );
	Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );

	memcpy( (char*)IMSI_CODE + 3, (char*)JT808Conf_struct.Vechicle_Info.Vech_sim, 12 );
	IMSI_Convert_SIMCODE( ); //  translate
	rt_kprintf( "\r\n ID=%s\r\n", ID );
}

FINSH_FUNCTION_EXPORT( idset, idset );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void recoverset( void )
{
	FirstRun_Config_Write( ); // 里边更新了 SYSID
}

FINSH_FUNCTION_EXPORT( recoverset, recoverset );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void chepai( u8 *instr )
{
	memset( JT808Conf_struct.Vechicle_Info.Vech_Num, 0, sizeof( JT808Conf_struct.Vechicle_Info.Vech_Num ) );
	memcpy( JT808Conf_struct.Vechicle_Info.Vech_Num, instr, 8 );
	Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
}

FINSH_FUNCTION_EXPORT( chepai, chepai );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void  localtrig( u8 *instr )
{
	local_trig = instr[0] - 0x30;
	if( local_trig )
	{
		GPS_getfirst = 1; local_timer = 0;
	}else
	{
		GPS_getfirst = 0; local_timer = 0;
	}
	rt_kprintf( "\r\n Enable local  time=%d  \r\n", local_trig );
}

FINSH_FUNCTION_EXPORT( localtrig, localtrig );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void  current( void )
{
	PositionSD_Enable( );
	Current_UDP_sd = 1;
	memcpy( BakTime, CurrentTime, 3 ); // update

	//  rt_kprintf("\r\n---> tim1  %d  \r\n",TIM1_Timer_Counter);
	//TIM1_Timer_Counter=0;
}

FINSH_FUNCTION_EXPORT( current, current );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void txt_play( u8 *instr )
{
	u16 len = strlen( instr );

	//--------------  播报----
	Dev_Voice.CMD_Type = '2';
	memset( Dev_Voice.Play_info, 0, sizeof( Dev_Voice.Play_info ) );
	memcpy( Dev_Voice.Play_info, instr, len );
	Dev_Voice.info_sdFlag = 1;

	//#ifdef LCD_5inch
	//DwinLCD.Type=LCD_SDTXT;
	// memset(DwinLCD.TXT_content,0,sizeof(DwinLCD.TXT_content));
	//DwinLCD.TXT_contentLen=AsciiToGb(DwinLCD.TXT_content,infolen-1,UDP_HEX_Rx+14);
	//#endif
	//  TTS
	TTS_Get_Data( instr, len );

#ifdef LCD_5inch
	//======  信息都在屏幕上显示
	DwinLCD.Type = LCD_SDTXT;
	memset( DwinLCD.TXT_content, 0, sizeof( DwinLCD.TXT_content ) );
	DwinLCD.TXT_contentLen = AsciiToGb( DwinLCD.TXT_content, len, instr );
#endif
}

FINSH_FUNCTION_EXPORT( txt_play, txt_play );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void ICack( void )
{
	u8	i			= 0;
	u8	ackreg[24]	= { 0x00, 0x01, 0xf1, 0xd8, 0x37, 0x25, 0x61, 0xe8, 0x30, 0x7c, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0xc6, 0x39 };

	memcpy( IC_MOD.IC_Rx, ackreg, 24 );
	rt_kprintf( "\r\n IC 卡透传len=%dBytes  RX:", 24 );
	for( i = 0; i < 24; i++ )
	{
		rt_kprintf( "%2X ", ackreg[i] );
	}
	rt_kprintf( "\r\n" );
	//------ 直接发送给IC 卡模块-----
	DeviceData_Encode_Send( 0x0B, 0x40, ackreg, 24 ); 
}

FINSH_FUNCTION_EXPORT( ICack, ICack ); 


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void  msg_send( void )
{
	SMS_send_enable( );
	rt_kprintf( "\r\n   收到使能发送短信\r\n" );
}

FINSH_FUNCTION_EXPORT( msg_send, msg_send );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void close_com( void )
{
	JT808Conf_struct.Close_CommunicateFlag = 1;
	Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
	Close_DataLink( );
	rt_kprintf( "\r\nclose com\r\n" );
}

FINSH_FUNCTION_EXPORT( close_com, close_com );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void open_com( u8 *intstr )
{
	rt_kprintf( "\r\n open com\r\n" );
	redial( );
	JT808Conf_struct.Close_CommunicateFlag = 0;
	Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );

	if( intstr[0] == '0' )
	{
		Mangqu_Init( );
		MangQU.Enable_SD_state = 0;
	}else
	if( intstr[0] == '1' )
	{
		MangQU.Enable_SD_state = 1;
		// MangQU.PacketNum=0;
		MangQU.PacketNum = 0;
		BlindZoneData_send_start( );
	}
}

FINSH_FUNCTION_EXPORT( open_com, open_com[1 | 0] );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void app_queenable( u8* instr )
{
	if( instr[0] == '0' )
	{
		app_que_enable	= 0;
		stop_current	= 0;
		//----- init-----------------
		AppQue.write_num		= 0;
		AppQue.read_num			= 0;
		AppQue.sd_enable_flag	= 0;
		AppQue.abnormal_counter = 0;
		AppQue.re_send_flag		= 0;
		AppQue.send_timer		= 0;
		//-------------------------
		rt_kprintf( "\r\n app que disable\r\n" );
	}
	if( instr[0] == '1' )
	{
		app_que_enable = 1;
		//----- init-----------------
		AppQue.write_num		= 0;
		AppQue.read_num			= 0;
		AppQue.sd_enable_flag	= 0;
		AppQue.abnormal_counter = 0;
		AppQue.re_send_flag		= 0;
		AppQue.send_timer		= 0;
		//-------------------------
		rt_kprintf( "\r\n app que enable\r\n" );
	}
}

FINSH_FUNCTION_EXPORT( app_queenable, app_queenable );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void   stop_normal( u8 *instr )
{
	if( instr[0] == '0' )
	{
		stopNormal				= 0;
		AppQue.sd_enable_flag	= 0;
		rt_kprintf( "\r\n  stop_normal disable\r\n" );
	}
	if( instr[0] == '1' )
	{
		stopNormal				= 1;
		AppQue.sd_enable_flag	= 0;
		rt_kprintf( "\r\n stop_normal que enable -only  pos\r\n" );
	}
	if( instr[0] == '2' )
	{
		stopNormal = 2;
		rt_kprintf( "\r\n stop_normal que enable-forbid all\r\n" );
	}
}

