nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
FINSH_FUNCTION_EXPORT( stop_normal, stop_normal[1 | 0] );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void  link_ic( char *str )
{
	u8			i = 0;
	u8			reg_str[80];

	uint8_t		ip[4];
	uint16_t	port;

	if( strlen( (const char*)str ) )
	{
		i = str2ipport( (char*)str, ip, &port );
		if( i == 5 )
		{
			memcpy( (char*)SysConf_struct.BD_IC_main_IP, ip, 4 );
			SysConf_struct.BD_IC_TCP_port = port;
			Api_Config_write( config, ID_CONF_SYS, (u8*)&SysConf_struct, sizeof( SysConf_struct ) );
			DataLink_IC_Socket_set( ip, port, 0 );
		}
	}

	Hand_Login		= 0;
	Enable_IClink	= 1;
	TCP2_ready_dial = 1;
	rt_kprintf( "   \r\n    Handle  link  IC  \r\n" );
}

FINSH_FUNCTION_EXPORT( link_ic, link_ic );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void cansd_last( void )
{
	u16 i = 0, datanum = 0;;

	datanum = ( CAN_trans.canid_1_RxWr >> 3 );
	memcpy( CAN_trans.canid_1_Sdbuf, CAN_trans.canid_1_Rxbuf, CAN_trans.canid_1_RxWr );
	CAN_trans.canid_1_SdWr = CAN_trans.canid_1_RxWr;
	for( i = 0; i < datanum; i++ )
	{
		CAN_trans.canid_1_ID_SdBUF[i] = CAN_trans.canid_1_ID_RxBUF[i];
	}

	CAN_trans.canid_1_RxWr		= 0; // clear
	CAN_trans.canid_0705_sdFlag = 1;

	rt_kprintf( "   \r\n    send link last \r\n" );
}

FINSH_FUNCTION_EXPORT( cansd_last, cansd_last );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void stopcurrent( u8 *instr )
{
	if( instr[0] == '0' )
	{
		stop_current = 0; rt_kprintf( "\r\n  enable current \r\n" );
	}

	if( instr[0] == '1' )
	{
		stop_current = 1; rt_kprintf( "\r\n stop current \r\n" );
	}
}

FINSH_FUNCTION_EXPORT( stopcurrent, stopcurrent[1 | 0] );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void sim_0700( uint8_t cmd )
{
	Recode_Obj.SD_Data_Flag = 1;
	Recode_Obj.CountStep	= 1;
	Recode_Obj.CMD			= cmd;
	if( ( cmd == 0x13 ) || ( cmd == 0x14 ) )
	{
		Recode_Obj.Devide_Flag = 0;
		Stuff_RecoderACK_0700H( Packet_Normal );
	}else
	{
		Recode_Obj.Devide_Flag = 1;
		Stuff_RecoderACK_0700H( Packet_Divide );
	}
	Recode_Obj.SD_Data_Flag = 0;
}


FINSH_FUNCTION_EXPORT( sim_0700, sim_0700 );


void password(u8 value)
{
  rt_kprintf("\r\n password(%d)",value);
  JT808Conf_struct.password_flag=value;     // clear  first flag		
  Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));    

}
FINSH_FUNCTION_EXPORT( password, password ); 

void buzzer_onoff(u8 in) 
{
   
   GPIO_InitTypeDef GPIO_InitStructure;
   
     if(0==in)
    {  
     GPIO_StructInit(&GPIO_InitStructure);

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5; 			//指定复用引脚
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;		//模式为输入
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;	//频率为快速
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_DOWN;		//下拉以便节省电能
	GPIO_Init(GPIOA, &GPIO_InitStructure);  
	  
    }
	  
   if(1==in)
    {
	  //-----------------  hardware  0x101    5   Beep -----------------
	/*仅设置结构体中的部分成员：这种情况下，用户应当首先调用函数PPP_SturcInit(..)
	来初始化变量PPP_InitStructure，然后再修改其中需要修改的成员。这样可以保证其他
	成员的值（多为缺省值）被正确填入。
	 */
	
	GPIO_StructInit(&GPIO_InitStructure);
	
	/*配置GPIOA_Pin_5，作为TIM2_Channel1 PWM输出*/
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5; 			//指定复用引脚
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;		//模式必须为复用！
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;	//频率为快速
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;		//上拉与否对PWM产生无影响
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	//GPIO_PinAFConfig(GPIOA, GPIO_PinSource1, GPIO_AF_TIM2); //复用GPIOA_Pin1为TIM2_Ch2
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource5, GPIO_AF_TIM2); //复用GPIOA_Pin5为TIM2_Ch1, 
	} 


}
FINSH_FUNCTION_EXPORT(buzzer_onoff, buzzer_onoff[1|0]);    

void end_link(void)
{
   DataLink_EndFlag=1;
   rt_kprintf("\r\n 手动挂断\r\n");
   
}
FINSH_FUNCTION_EXPORT(end_link, end_link);  

void mq_erase(void)
{
  u8  i=0;
				for(i=0;i<10;i++)
				{
	                 WatchDog_Feed(); 
					 SST25V_BlockErase_64KByte(((CycleStart_offset+128*i)<<9));   
			         DF_delay_ms(600);   
				     WatchDog_Feed(); 
				}
				
	cycle_write=0;//6959
	cycle_read=0;	//0
	DF_Write_RecordAdd(cycle_write,cycle_read,TYPE_CycleAdd);   	
	rt_kprintf("\r\n earse_MQ   WR=%d  RD=%d \r\n",cycle_write,cycle_read);    		

}
FINSH_FUNCTION_EXPORT(mq_erase,mq_erase);
	
void mq_cmd(void)
{
   Get_GSM_HexData("7E860200180136013000046AEF01010000006640000262548106BC3E400238A9580717CBC09C7E",78,0);
   OutPrint_HEX("盲区围栏", GSM_HEX, GSM_HEX_len); 
}
FINSH_FUNCTION_EXPORT(mq_cmd, mq_cmd);

u32 Get_MQ_true_CuurentTotal_packets(void)
{
   u32  delta_reg=0;
        //获取总包数
	        if(cycle_read<cycle_write)
	        {
	           /* delta_reg=cycle_write-cycle_read;
				// 计算总包数
				if(delta_reg%MQ_PKNUM)
				    CurrentTotal=delta_reg/MQ_PKNUM+1;
				else
					 CurrentTotal=delta_reg/MQ_PKNUM;
			    */
			    if(cycle_write%MQ_PKNUM)
				    CurrentTotal=cycle_write/MQ_PKNUM+1;
				else
					 CurrentTotal=cycle_write/MQ_PKNUM; 

	        }
			else   // write 小于 read
			{	    
				// 计算总包数
			    delta_reg=Max_CycleNum+cycle_write-cycle_read; 
				if(delta_reg%MQ_PKNUM)
				    CurrentTotal=delta_reg/MQ_PKNUM+2;  // 跨界要分2包
				else
					 CurrentTotal=delta_reg/MQ_PKNUM+1; 

			}
   return CurrentTotal;
}

void  sequence_sd(u8 value)
{

  BD_send_Init();
  DF_Write_RecordAdd(BDSD.write,BDSD.read,TYPE_BDsdAdd); 
  
  BDSD.Enable_Working=value;   
  		  
  rt_kprintf("\r\n  消息队列发送模式: %d\r\n",BDSD.Enable_Working);
}
FINSH_FUNCTION_EXPORT(sequence_sd, sequence_sd0:disable1:enable);
	

void mq_true_enable(u8 value)
{
 u32  delta_reg=0;
  switch(value)
  { 
     case 2:
          {
		    mq_erase();
			MQsend_counter=0;
		    MQ_TrueUse.Enable_SD_state=2;
			rt_kprintf("\r\n  MQ_true mode  :enable save !\r\n");
		  }
		 break;
	case 1:  	  
		  {
		    MQ_TrueUse.Enable_SD_state=1; 
			MQ_TrueUse.PacketNum=1;
		     //获取总包数
		    Mq_total_pkg=Get_MQ_true_CuurentTotal_packets();
			rt_kprintf("\r\n  MQ_true mode  :enable send ! write=%d  read=%d  Totalpackets: %d  CurrentTotal=%d\r\n",cycle_write,cycle_read,Mq_total_pkg,CurrentTotal);
			
		  }
	      break;
    case  0:
	default:
		  MQ_TrueUse.Enable_SD_state=0; 
			rt_kprintf("\r\n  MQ_true mode  :enable disable !\r\n"); 
	      break;
  	}		  

}
FINSH_FUNCTION_EXPORT(mq_true_enable, mq_true_enable 0:idle+othervalue 1:send 2:save);
//+++++++++++++++++++++++++++++++++++++++wxg++++++++++鉴权+++++++++++
void jianquan(u8 *str)
{
	memset( JT808Conf_struct.ConfirmCode, 0, sizeof( JT808Conf_struct.ConfirmCode ));
	memcpy( JT808Conf_struct.ConfirmCode, str, strlen(str) );	
	JT808Conf_struct.Regsiter_Status	= 1;
	Api_Config_Recwrite_Large( jt808, 0, (u8*)&JT808Conf_struct, sizeof( JT808Conf_struct ) );
	rt_kprintf( "鉴权码: %s\r\n		   鉴权码长度: %d\r\n", str, strlen( (const char*)str ) );
	//-------- 开始鉴权 ------
	DEV_Login.Operate_enable = 1;
}
FINSH_FUNCTION_EXPORT(jianquan,1);

 void bd_time_set(void)
 	{
       
	   TDateTime   now;
	   
 	  	  now.year=Gps_Gprs.Date[0];
	  now.month=Gps_Gprs.Date[1];
	  now.day=Gps_Gprs.Date[2]; 

	  now.hour=Gps_Gprs.Time[0];
	  now.min=Gps_Gprs.Time[1];
	  now.sec=Gps_Gprs.Time[2];
	  now.week=3;
	  
	 // Set_RTC(now);
	 Device_RTC_set(now);  

 	}
FINSH_FUNCTION_EXPORT(bd_time_set,1); 

void in(void)
{
  close_com();
   mq_true_enable(2);  //  使能盲区补报存储
   rt_kprintf("\r\n  Area  In \r\n");
}
FINSH_FUNCTION_EXPORT(in,1); 


void out(void)
{
   open_com("0");
   mq_true_enable(1); // 使能盲区补报上报  
   rt_kprintf("\r\n  Area  Out \r\n");
}
FINSH_FUNCTION_EXPORT(out,1); 

// C.  Module
